[
  {
    "name": "Artificial Intelligence",
    "feed": [
      {
        "title": "Recursive Euclidean Distance Based Robust Aggregation Technique For Federated Learning.",
        "link": "http://arxiv.org/abs/2303.11337",
        "abstract": "Federated learning has gained popularity as a solution to data availability and privacy challenges in machine learning. However, the aggregation process of local model updates to obtain a global model in federated learning is susceptible to malicious attacks, such as backdoor poisoning, label-flipping, and membership inference. Malicious users aim to sabotage the collaborative learning process by training the local model with malicious data. In this paper, we propose a novel robust aggregation approach based on recursive Euclidean distance calculation. Our approach measures the distance of the local models from the previous global model and assigns weights accordingly. Local models far away from the global model are assigned smaller weights to minimize the data poisoning effect during aggregation. Our experiments demonstrate that the proposed algorithm outperforms state-of-the-art algorithms by at least $5\\%$ in accuracy while reducing time complexity by less than $55\\%$. Our contribution is significant as it addresses the critical issue of malicious attacks in federated learning while improving the accuracy of the global model.",
        "creator": "Charuka Herath, Yogachandran Rahulamathavan, Xiaolan Liu"
      },
      {
        "title": "FedMAE: Federated Self-Supervised Learning with One-Block Masked Auto-Encoder.",
        "link": "http://arxiv.org/abs/2303.11339",
        "abstract": "Latest federated learning (FL) methods started to focus on how to use unlabeled data in clients for training due to users' privacy concerns, high labeling costs, or lack of expertise. However, current Federated Semi-Supervised/Self-Supervised Learning (FSSL) approaches fail to learn large-scale images because of the limited computing resources of local clients. In this paper, we introduce a new framework FedMAE, which stands for Federated Masked AutoEncoder, to address the problem of how to utilize unlabeled large-scale images for FL. Specifically, FedMAE can pre-train one-block Masked AutoEncoder (MAE) using large images in lightweight client devices, and then cascades multiple pre-trained one-block MAEs in the server to build a multi-block ViT backbone for downstream tasks. Theoretical analysis and experimental results on image reconstruction and classification show that our FedMAE achieves superior performance compared to the state-of-the-art FSSL methods.",
        "creator": "Nan Yang, Xuanyu Chen, Charles Z. Liu, Dong Yuan, Wei Bao, Lizhen Cui"
      },
      {
        "title": "HDformer: A Higher Dimensional Transformer for Diabetes Detection Utilizing Long Range Vascular Signals.",
        "link": "http://arxiv.org/abs/2303.11340",
        "abstract": "Diabetes mellitus is a worldwide concern, and early detection can help to prevent serious complications. Low-cost, non-invasive detection methods, which take cardiovascular signals into deep learning models, have emerged. However, limited accuracy constrains their clinical usage. In this paper, we present a new Transformer-based architecture, Higher Dimensional Transformer (HDformer), which takes long-range photoplethysmography (PPG) signals to detect diabetes. The long-range PPG contains broader and deeper signal contextual information compared to the less-than-one-minute PPG signals commonly utilized in existing research. To increase the capability and efficiency of processing the long range data, we propose a new attention module Time Square Attention (TSA), reducing the volume of the tokens by more than 10x, while retaining the local/global dependencies. It converts the 1-dimensional inputs into 2-dimensional representations and groups adjacent points into a single 2D token, using the 2D Transformer models as the backbone of the encoder. It generates the dynamic patch sizes into a gated mixture-of-experts (MoE) network as decoder, which optimizes the learning on different attention areas. Extensive experimentations show that HDformer results in the state-of-the-art performance (sensitivity 98.4, accuracy 97.3, specificity 92.8, and AUC 0.929) on the standard MIMIC-III dataset, surpassing existing studies. This work is the first time to take long-range, non-invasive PPG signals via Transformer for diabetes detection, achieving a more scalable and convenient solution compared to traditional invasive approaches. The proposed HDformer can also be scaled to analyze general long-range biomedical waveforms. A wearable prototype finger-ring is designed as a proof of concept.",
        "creator": "Ella Lan"
      },
      {
        "title": "What does it take to catch a Chinchilla? Verifying Rules on Large-Scale Neural Network Training via Compute Monitoring.",
        "link": "http://arxiv.org/abs/2303.11341",
        "abstract": "As advanced machine learning systems' capabilities begin to play a significant role in geopolitics and societal order, it may become imperative that (1) governments be able to enforce rules on the development of advanced ML systems within their borders, and (2) countries be able to verify each other's compliance with potential future international agreements on advanced ML development. This work analyzes one mechanism to achieve this, by monitoring the computing hardware used for large-scale NN training. The framework's primary goal is to provide governments high confidence that no actor uses large quantities of specialized ML chips to execute a training run in violation of agreed rules. At the same time, the system does not curtail the use of consumer computing devices, and maintains the privacy and confidentiality of ML practitioners' models, data, and hyperparameters. The system consists of interventions at three stages: (1) using on-chip firmware to occasionally save snapshots of the the neural network weights stored in device memory, in a form that an inspector could later retrieve; (2) saving sufficient information about each training run to prove to inspectors the details of the training run that had resulted in the snapshotted weights; and (3) monitoring the chip supply chain to ensure that no actor can avoid discovery by amassing a large quantity of un-tracked chips. The proposed design decomposes the ML training rule verification problem into a series of narrow technical challenges, including a new variant of the Proof-of-Learning problem [Jia et al. '21].",
        "creator": "Yonadav Shavit"
      },
      {
        "title": "Reflexion: an autonomous agent with dynamic memory and self-reflection.",
        "link": "http://arxiv.org/abs/2303.11366",
        "abstract": "Recent advancements in decision-making large language model (LLM) agents have demonstrated impressive performance across various benchmarks. However, these state-of-the-art approaches typically necessitate internal model fine-tuning, external model fine-tuning, or policy optimization over a defined state space. Implementing these methods can prove challenging due to the scarcity of high-quality training data or the lack of well-defined state space. Moreover, these agents do not possess certain qualities inherent to human decision-making processes, specifically the ability to learn from mistakes. Self-reflection allows humans to efficiently solve novel problems through a process of trial and error. Building on recent research, we propose Reflexion, an approach that endows an agent with dynamic memory and self-reflection capabilities to enhance its existing reasoning trace and task-specific action choice abilities. To achieve full automation, we introduce a straightforward yet effective heuristic that enables the agent to pinpoint hallucination instances, avoid repetition in action sequences, and, in some environments, construct an internal memory map of the given environment. To assess our approach, we evaluate the agent's ability to complete decision-making tasks in AlfWorld environments and knowledge-intensive, search-based question-and-answer tasks in HotPotQA environments. We observe success rates of 97% and 51%, respectively, and provide a discussion on the emergent property of self-reflection.",
        "creator": "Noah Shinn, Beck Labash, Ashwin Gopinath"
      },
      {
        "title": "Bridging Imitation and Online Reinforcement Learning: An Optimistic Tale.",
        "link": "http://arxiv.org/abs/2303.11369",
        "abstract": "In this paper, we address the following problem: Given an offline demonstration dataset from an imperfect expert, what is the best way to leverage it to bootstrap online learning performance in MDPs. We first propose an Informed Posterior Sampling-based RL (iPSRL) algorithm that uses the offline dataset, and information about the expert's behavioral policy used to generate the offline dataset. Its cumulative Bayesian regret goes down to zero exponentially fast in N, the offline dataset size if the expert is competent enough. Since this algorithm is computationally impractical, we then propose the iRLSVI algorithm that can be seen as a combination of the RLSVI algorithm for online RL, and imitation learning. Our empirical results show that the proposed iRLSVI algorithm is able to achieve significant reduction in regret as compared to two baselines: no offline data, and offline dataset but used without information about the generative policy. Our algorithm bridges online RL and imitation learning for the first time.",
        "creator": "Botao Hao, Rahul Jain, Dengwang Tang, Zheng Wen"
      },
      {
        "title": "Neural Constraint Satisfaction: Hierarchical Abstraction for Combinatorial Generalization in Object Rearrangement.",
        "link": "http://arxiv.org/abs/2303.11373",
        "abstract": "Object rearrangement is a challenge for embodied agents because solving these tasks requires generalizing across a combinatorially large set of configurations of entities and their locations. Worse, the representations of these entities are unknown and must be inferred from sensory percepts. We present a hierarchical abstraction approach to uncover these underlying entities and achieve combinatorial generalization from unstructured visual inputs. By constructing a factorized transition graph over clusters of entity representations inferred from pixels, we show how to learn a correspondence between intervening on states of entities in the agent's model and acting on objects in the environment. We use this correspondence to develop a method for control that generalizes to different numbers and configurations of objects, which outperforms current offline deep RL methods when evaluated on simulated rearrangement tasks.",
        "creator": "Michael Chang, Alyssa L. Dayan, Franziska Meier, Thomas L. Griffiths, Sergey Levine, Amy Zhang"
      },
      {
        "title": "GNN-Ensemble: Towards Random Decision Graph Neural Networks.",
        "link": "http://arxiv.org/abs/2303.11376",
        "abstract": "Graph Neural Networks (GNNs) have enjoyed wide spread applications in graph-structured data. However, existing graph based applications commonly lack annotated data. GNNs are required to learn latent patterns from a limited amount of training data to perform inferences on a vast amount of test data. The increased complexity of GNNs, as well as a single point of model parameter initialization, usually lead to overfitting and sub-optimal performance. In addition, it is known that GNNs are vulnerable to adversarial attacks. In this paper, we push one step forward on the ensemble learning of GNNs with improved accuracy, generalization, and adversarial robustness. Following the principles of stochastic modeling, we propose a new method called GNN-Ensemble to construct an ensemble of random decision graph neural networks whose capacity can be arbitrarily expanded for improvement in performance. The essence of the method is to build multiple GNNs in randomly selected substructures in the topological space and subfeatures in the feature space, and then combine them for final decision making. These GNNs in different substructure and subfeature spaces generalize their classification in complementary ways. Consequently, their combined classification performance can be improved and overfitting on the training data can be effectively reduced. In the meantime, we show that GNN-Ensemble can significantly improve the adversarial robustness against attacks on GNNs.",
        "creator": "Wenqi Wei, Mu Qiao, Divyesh Jadav"
      },
      {
        "title": "Vibration Signal Denoising Using Deep Learning.",
        "link": "http://arxiv.org/abs/2303.11413",
        "abstract": "Structure vibration signals induced by footsteps are widely used for tasks like occupant identification, localization, human activity inference, structure health monitoring and so on. The vibration signals are collected as time series with amplitude values. However, the collected signals are always noisy in practice due to the influence of environmental noise, electromagnetic interference and other factors. The presence of noise affects the process of signal analysis, thus affecting the accuracy and error of the final tasks. In this paper, we mainly explore the denoising methods for footstep-induced vibration signals. We have considered different kinds of noise including stationary noises such as gaussian noises and non-stationary noises such as item-dropping vibration noise and music noises.",
        "creator": "Yuyan Wu, Senyang Jiang, Youzhi Liang"
      },
      {
        "title": "ADCNet: End-to-end perception with raw radar ADC data.",
        "link": "http://arxiv.org/abs/2303.11420",
        "abstract": "There is a renewed interest in radar sensors in the autonomous driving industry. As a relatively mature technology, radars have seen steady improvement over the last few years, making them an appealing alternative or complement to the commonly used LiDARs. An emerging trend is to leverage rich, low-level radar data for perception. In this work we push this trend to the extreme -- we propose a method to perform end-to-end learning on the raw radar analog-to-digital (ADC) data. Specifically, we design a learnable signal processing module inside the neural network, and a pre-training method guided by traditional signal processing algorithms. Experiment results corroborate the overall efficacy of the end-to-end learning method, while an ablation study validates the effectiveness of our individual innovations.",
        "creator": "Bo Yang, Ishan Khatri, Michael Happold, Chulong Chen"
      },
      {
        "title": "Improving EEG-based Emotion Recognition by Fusing Time-frequency And Spatial Representations.",
        "link": "http://arxiv.org/abs/2303.11421",
        "abstract": "Using deep learning methods to classify EEG signals can accurately identify people's emotions. However, existing studies have rarely considered the application of the information in another domain's representations to feature selection in the time-frequency domain. We propose a classification network of EEG signals based on the cross-domain feature fusion method, which makes the network more focused on the features most related to brain activities and thinking changes by using the multi-domain attention mechanism. In addition, we propose a two-step fusion method and apply these methods to the EEG emotion recognition network. Experimental results show that our proposed network, which combines multiple representations in the time-frequency domain and spatial domain, outperforms previous methods on public datasets and achieves state-of-the-art at present.",
        "creator": "Kexin Zhu, Xulong Zhang, Jianzong Wang, Ning Cheng, Jing Xiao"
      },
      {
        "title": "Improving Human-Robot Collaboration via Computational Design.",
        "link": "http://arxiv.org/abs/2303.11425",
        "abstract": "When robots entered our day-to-day life, the shared space surrounding humans and robots is critical for effective Human-Robot collaboration. The design of shared space should satisfy humans' preferences and robots' efficiency. This work uses kitchen design as an example to illustrate the importance of good space design in facilitating such collaboration. Given the kitchen boundary, counters, and recipes, the proposed method computes the optimal placement of counters that meet the requirement of kitchen design rules and improve Human-Robot collaboration. The key technical challenge is that the optimization method usually evaluates thousands of designs and the computational cost of motion planning, which is part of the evaluation function, is expensive. We use a decentralized motion planner that can solve multi-agent motion planning efficiently. Our results indicate that optimized kitchen designs can provide noticeable performance improvement to Human-Robot collaboration.",
        "creator": "Jixuan Zhi, Jyh-Ming Lien"
      },
      {
        "title": "Mind meets machine: Unravelling GPT-4's cognitive psychology.",
        "link": "http://arxiv.org/abs/2303.11436",
        "abstract": "Commonsense reasoning is a basic ingredient of intelligence in humans, empowering the ability to deduce conclusions based on the observations of surroundings. Large language models (LLMs) are emerging as potent tools increasingly capable of performing human-level tasks. The recent development in the form of GPT-4 and its demonstrated success in tasks complex to humans such as medical exam, bar exam and others has led to an increased confidence in the LLMs to become perfect instruments of intelligence. Though, the GPT-4 paper has shown performance on some common sense reasoning tasks, a comprehensive assessment of GPT-4 on common sense reasoning tasks, particularly on the existing well-established datasets is missing. In this study, we focus on the evaluation of GPT-4's performance on a set of common sense reasoning questions from the widely used CommonsenseQA dataset along with tools from cognitive psychology. In doing so, we understand how GPT-4 processes and integrates common sense knowledge with contextual information, providing insight into the underlying cognitive processes that enable its ability to generate common sense responses. We show that GPT-4 exhibits a high level of accuracy in answering common sense questions, outperforming its predecessor, GPT-3 and GPT-3.5. We show that the accuracy of GPT-4 on CommonSenseQA is 83 % and it has been shown in the original study that human accuracy over the same data was 89 %. Although, GPT-4 falls short of the human performance, it is a substantial improvement from the original 56.5 % in the original language model used by the CommonSenseQA study. Our results strengthen the already available assessments and confidence on GPT-4's common sense reasoning abilities which have significant potential to revolutionize the field of AI, by enabling machines to bridge the gap between human and machine reasoning.",
        "creator": "Sifatkaur, Manmeet Singh, Vaisakh SB, Neetiraj Malviya"
      },
      {
        "title": "Minimizing Fuzzy Interpretations in Fuzzy Description Logics by Using Crisp Bisimulations.",
        "link": "http://arxiv.org/abs/2303.11438",
        "abstract": "The problem of minimizing finite fuzzy interpretations in fuzzy description logics (FDLs) is worth studying. For example, the structure of a fuzzy/weighted social network can be treated as a fuzzy interpretation in FDLs, where actors are individuals and actions are roles. Minimizing the structure of a fuzzy/weighted social network makes it more compact, thus making network analysis tasks more efficient. In this work, we study the problem of minimizing a finite fuzzy interpretation in a FDL by using the largest crisp auto-bisimulation. The considered FDLs use the Baaz projection operator and their semantics is specified using an abstract algebra of fuzzy truth values, which can be any linear and complete residuated lattice. We provide an efficient algorithm with a complexity of $O((m \\log{l} + n) \\log{n})$ for minimizing a given finite fuzzy interpretation $\\mathcal{I}$, where $n$ is the size of the domain of $\\mathcal{I}$, $m$ is number of nonzero instances of atomic roles of $\\mathcal{I}$ and $l$ is the number of different fuzzy values used for instances of atomic roles of $\\mathcal{I}$. We prove that the fuzzy interpretation returned by the algorithm is minimal among the ones that preserve fuzzy TBoxes and ABoxes under certain conditions.",
        "creator": "Linh Anh Nguyen"
      },
      {
        "title": "Did You Train on My Dataset? Towards Public Dataset Protection with Clean-Label Backdoor Watermarking.",
        "link": "http://arxiv.org/abs/2303.11470",
        "abstract": "The huge supporting training data on the Internet has been a key factor in the success of deep learning models. However, this abundance of public-available data also raises concerns about the unauthorized exploitation of datasets for commercial purposes, which is forbidden by dataset licenses. In this paper, we propose a backdoor-based watermarking approach that serves as a general framework for safeguarding public-available data. By inserting a small number of watermarking samples into the dataset, our approach enables the learning model to implicitly learn a secret function set by defenders. This hidden function can then be used as a watermark to track down third-party models that use the dataset illegally. Unfortunately, existing backdoor insertion methods often entail adding arbitrary and mislabeled data to the training set, leading to a significant drop in performance and easy detection by anomaly detection algorithms. To overcome this challenge, we introduce a clean-label backdoor watermarking framework that uses imperceptible perturbations to replace mislabeled samples. As a result, the watermarking samples remain consistent with the original labels, making them difficult to detect. Our experiments on text, image, and audio datasets demonstrate that the proposed framework effectively safeguards datasets with minimal impact on original task performance. We also show that adding just 1% of watermarking samples can inject a traceable watermarking function and that our watermarking samples are stealthy and look benign upon visual inspection.",
        "creator": "Ruixiang Tang, Qizhang Feng, Ninghao Liu, Fan Yang, Xia Hu"
      },
      {
        "title": "AI-in-the-Loop -- The impact of HMI in AI-based Application.",
        "link": "http://arxiv.org/abs/2303.11508",
        "abstract": "Artificial intelligence (AI) and human-machine interaction (HMI) are two keywords that usually do not fit embedded applications. Within the steps needed before applying AI to solve a specific task, HMI is usually missing during the AI architecture design and the training of an AI model. The human-in-the-loop concept is prevalent in all other steps of developing AI, from data analysis via data selection and cleaning to performance evaluation. During AI architecture design, HMI can immediately highlight unproductive layers of the architecture so that lightweight network architecture for embedded applications can be created easily. We show that by using this HMI, users can instantly distinguish which AI architecture should be trained and evaluated first since a high accuracy on the task could be expected. This approach reduces the resources needed for AI development by avoiding training and evaluating AI architectures with unproductive layers and leads to lightweight AI architectures. These resulting lightweight AI architectures will enable HMI while running the AI on an edge device. By enabling HMI during an AI uses inference, we will introduce the AI-in-the-loop concept that combines AI's and humans' strengths. In our AI-in-the-loop approach, the AI remains the working horse and primarily solves the task. If the AI is unsure whether its inference solves the task correctly, it asks the user to use an appropriate HMI. Consequently, AI will become available in many applications soon since HMI will make AI more reliable and explainable.",
        "creator": "Julius Sch&#xf6;ning, Clemens Westerkamp"
      },
      {
        "title": "Indeterminate Probability Neural Network.",
        "link": "http://arxiv.org/abs/2303.11536",
        "abstract": "We propose a new general model called IPNN - Indeterminate Probability Neural Network, which combines neural network and probability theory together. In the classical probability theory, the calculation of probability is based on the occurrence of events, which is hardly used in current neural networks. In this paper, we propose a new general probability theory, which is an extension of classical probability theory, and makes classical probability theory a special case to our theory. Besides, for our proposed neural network framework, the output of neural network is defined as probability events, and based on the statistical analysis of these events, the inference model for classification task is deduced. IPNN shows new property: It can perform unsupervised clustering while doing classification. Besides, IPNN is capable of making very large classification with very small neural network, e.g. model with 100 output nodes can classify 10 billion categories. Theoretical advantages are reflected in experimental results.",
        "creator": "Tao Yang, Chuang Liu, Xiaofeng Ma, Weijia Lu, Ning Wu, Bingyang Li, Zhifei Yang, Peng Liu, Lin Sun, Xiaodong Zhang, Can Zhang"
      },
      {
        "title": "Fix the Noise: Disentangling Source Feature for Controllable Domain Translation.",
        "link": "http://arxiv.org/abs/2303.11545",
        "abstract": "Recent studies show strong generative performance in domain translation especially by using transfer learning techniques on the unconditional generator. However, the control between different domain features using a single model is still challenging. Existing methods often require additional models, which is computationally demanding and leads to unsatisfactory visual quality. In addition, they have restricted control steps, which prevents a smooth transition. In this paper, we propose a new approach for high-quality domain translation with better controllability. The key idea is to preserve source features within a disentangled subspace of a target feature space. This allows our method to smoothly control the degree to which it preserves source features while generating images from an entirely new domain using only a single model. Our extensive experiments show that the proposed method can produce more consistent and realistic images than previous works and maintain precise controllability over different levels of transformation. The code is available at https://github.com/LeeDongYeun/FixNoise.",
        "creator": "Dongyeun Lee, Jae Young Lee, Doyeon Kim, Jaehyun Choi, Jaejun Yoo, Junmo Kim"
      },
      {
        "title": "Dynamic Healthcare Embeddings for Improving Patient Care.",
        "link": "http://arxiv.org/abs/2303.11563",
        "abstract": "As hospitals move towards automating and integrating their computing systems, more fine-grained hospital operations data are becoming available. These data include hospital architectural drawings, logs of interactions between patients and healthcare professionals, prescription data, procedures data, and data on patient admission, discharge, and transfers. This has opened up many fascinating avenues for healthcare-related prediction tasks for improving patient care. However, in order to leverage off-the-shelf machine learning software for these tasks, one needs to learn structured representations of entities involved from heterogeneous, dynamic data streams. Here, we propose DECENT, an auto-encoding heterogeneous co-evolving dynamic neural network, for learning heterogeneous dynamic embeddings of patients, doctors, rooms, and medications from diverse data streams. These embeddings capture similarities among doctors, rooms, patients, and medications based on static attributes and dynamic interactions. DECENT enables several applications in healthcare prediction, such as predicting mortality risk and case severity of patients, adverse events (e.g., transfer back into an intensive care unit), and future healthcare-associated infections. The results of using the learned patient embeddings in predictive modeling show that DECENT has a gain of up to 48.1% on the mortality risk prediction task, 12.6% on the case severity prediction task, 6.4% on the medical intensive care unit transfer task, and 3.8% on the Clostridioides difficile (C.diff) Infection (CDI) prediction task over the state-of-the-art baselines. In addition, case studies on the learned doctor, medication, and room embeddings show that our approach learns meaningful and interpretable embeddings.",
        "creator": "Hankyu Jang (1), Sulyun Lee (2), D. M. Hasibul Hasan (1), Philip M. Polgreen (3), Sriram V. Pemmaraju (1), Bijaya Adhikari (1) ((1) Department of Computer Science, University of Iowa, (2) Interdisciplinary Graduate Program in Informatics, University of Iowa, (3) Department of Internal Medicine, University of Iowa)"
      },
      {
        "title": "Agave crop segmentation and maturity classification with deep learning data-centric strategies using very high-resolution satellite imagery.",
        "link": "http://arxiv.org/abs/2303.11564",
        "abstract": "The responsible and sustainable agave-tequila production chain is fundamental for the social, environment and economic development of Mexico's agave regions. It is therefore relevant to develop new tools for large scale automatic agave region monitoring. In this work, we present an Agave tequilana Weber azul crop segmentation and maturity classification using very high resolution satellite imagery, which could be useful for this task. To achieve this, we solve real-world deep learning problems in the very specific context of agave crop segmentation such as lack of data, low quality labels, highly imbalanced data, and low model performance. The proposed strategies go beyond data augmentation and data transfer combining active learning and the creation of synthetic images with human supervision. As a result, the segmentation performance evaluated with Intersection over Union (IoU) value increased from 0.72 to 0.90 in the test set. We also propose a method for classifying agave crop maturity with 95\\% accuracy. With the resulting accurate models, agave production forecasting can be made available for large regions. In addition, some supply-demand problems such excessive supplies of agave or, deforestation, could be detected early.",
        "creator": "Abraham S&#xe1;nchez, Ra&#xfa;l Nanclares, Alexander Quevedo, Ulises Pelagio, Alejandra Aguilar, Gabriela Calvario, E. Ulises Moya-S&#xe1;nchez"
      },
      {
        "title": "Large AI Models in Health Informatics: Applications, Challenges, and the Future.",
        "link": "http://arxiv.org/abs/2303.11568",
        "abstract": "Large AI models, or foundation models, are models recently emerging with massive scales both parameter-wise and data-wise, the magnitudes of which often reach beyond billions. Once pretrained, large AI models demonstrate impressive performance in various downstream tasks. A concrete example is the recent debut of ChatGPT, whose capability has compelled people's imagination about the far-reaching influence that large AI models can have and their potential to transform different domains of our life. In health informatics, the advent of large AI models has brought new paradigms for the design of methodologies. The scale of multimodality data in the biomedical and health domain has been ever-expanding especially since the community embraced the era of deep learning, which provides the ground to develop, validate, and advance large AI models for breakthroughs in health-related areas. This article presents an up-to-date comprehensive review of large AI models, from background to their applications. We identify seven key sectors that large AI models are applicable and might have substantial influence, including 1) molecular biology and drug discovery; 2) medical diagnosis and decision-making; 3) medical imaging and vision; 4) medical informatics; 5) medical education; 6) public health; and 7) medical robotics. We examine their challenges in health informatics, followed by a critical discussion about potential future directions and pitfalls of large AI models in transforming the field of health informatics.",
        "creator": "Jianing Qiu, Lin Li, Jiankai Sun, Jiachuan Peng, Peilun Shi, Ruiyang Zhang, Yinzhao Dong, Kyle Lam, Frank P.-W. Lo, Bo Xiao, Wu Yuan, Dong Xu, Benny Lo"
      },
      {
        "title": "A Review on Machine Theory of Mind.",
        "link": "http://arxiv.org/abs/2303.11594",
        "abstract": "Theory of Mind (ToM) is the ability to attribute mental states to others, the basis of human cognition. At present, there has been growing interest in the AI with cognitive abilities, for example in healthcare and the motoring industry. Beliefs, desires, and intentions are the early abilities of infants and the foundation of human cognitive ability, as well as for machine with ToM. In this paper, we review recent progress in machine ToM on beliefs, desires, and intentions. And we shall introduce the experiments, datasets and methods of machine ToM on these three aspects, summarize the development of different tasks and datasets in recent years, and compare well-behaved models in aspects of advantages, limitations and applicable conditions, hoping that this study can guide researchers to quickly keep up with latest trend in this field. Unlike other domains with a specific task and resolution framework, machine ToM lacks a unified instruction and a series of standard evaluation tasks, which make it difficult to formally compare the proposed models. We argue that, one method to address this difficulty is now to present a standard assessment criteria and dataset, better a large-scale dataset covered multiple aspects of ToM.",
        "creator": "Yuanyuan Mao, Shuang Liu, Pengshuai Zhao, Qin Ni, Xin Lin, Liang He"
      },
      {
        "title": "Low-complexity Deep Video Compression with A Distributed Coding Architecture.",
        "link": "http://arxiv.org/abs/2303.11599",
        "abstract": "Prevalent predictive coding-based video compression methods rely on a heavy encoder to reduce the temporal redundancy, which makes it challenging to deploy them on resource-constrained devices. Meanwhile, as early as the 1970s, distributed source coding theory has indicated that independent encoding and joint decoding with side information (SI) can achieve high-efficient compression of correlated sources. This has inspired a distributed coding architecture aiming at reducing the encoding complexity. However, traditional distributed coding methods suffer from a substantial performance gap to predictive coding ones. Inspired by the great success of learning-based compression, we propose the first end-to-end distributed deep video compression framework to improve the rate-distortion performance. A key ingredient is an effective SI generation module at the decoder, which helps to effectively exploit inter-frame correlations without computation-intensive encoder-side motion estimation and compensation. Experiments show that our method significantly outperforms conventional distributed video coding and H.264. Meanwhile, it enjoys 6-7x encoding speedup against DVC [1] with comparable compression performance. Code is released at https://github.com/Xinjie-Q/Distributed-DVC.",
        "creator": "Xinjie Zhang, Jiawei Shao, Jun Zhang"
      },
      {
        "title": "Heterogeneous-Branch Collaborative Learning for Dialogue Generation.",
        "link": "http://arxiv.org/abs/2303.11621",
        "abstract": "With the development of deep learning, advanced dialogue generation methods usually require a greater amount of computational resources. One promising approach to obtaining a high-performance and lightweight model is knowledge distillation, which relies heavily on the pre-trained powerful teacher. Collaborative learning, also known as online knowledge distillation, is an effective way to conduct one-stage group distillation in the absence of a well-trained large teacher model. However, previous work has a severe branch homogeneity problem due to the same training objective and the independent identical training sets. To alleviate this problem, we consider the dialogue attributes in the training of network branches. Each branch learns the attribute-related features based on the selected subset. Furthermore, we propose a dual group-based knowledge distillation method, consisting of positive distillation and negative distillation, to further diversify the features of different branches in a steadily and interpretable way. The proposed approach significantly improves branch heterogeneity and outperforms state-of-the-art collaborative learning methods on two widely used open-domain dialogue datasets.",
        "creator": "Yiwei Li, Shaoxiong Feng, Bin Sun, Kan Li"
      },
      {
        "title": "Assessor-Guided Learning for Continual Environments.",
        "link": "http://arxiv.org/abs/2303.11624",
        "abstract": "This paper proposes an assessor-guided learning strategy for continual learning where an assessor guides the learning process of a base learner by controlling the direction and pace of the learning process thus allowing an efficient learning of new environments while protecting against the catastrophic interference problem. The assessor is trained in a meta-learning manner with a meta-objective to boost the learning process of the base learner. It performs a soft-weighting mechanism of every sample accepting positive samples while rejecting negative samples. The training objective of a base learner is to minimize a meta-weighted combination of the cross entropy loss function, the dark experience replay (DER) loss function and the knowledge distillation loss function whose interactions are controlled in such a way to attain an improved performance. A compensated over-sampling (COS) strategy is developed to overcome the class imbalanced problem of the episodic memory due to limited memory budgets. Our approach, Assessor-Guided Learning Approach (AGLA), has been evaluated in the class-incremental and task-incremental learning problems. AGLA achieves improved performances compared to its competitors while the theoretical analysis of the COS strategy is offered. Source codes of AGLA, baseline algorithms and experimental logs are shared publicly in \\url{https://github.com/anwarmaxsum/AGLA} for further study.",
        "creator": "Muhammad Anwar Ma&#x27;sum, Mahardhika Pratama, Edwin Lughofer, Weiping Ding, Wisnu Jatmiko"
      },
      {
        "title": "BoxSnake: Polygonal Instance Segmentation with Box Supervision.",
        "link": "http://arxiv.org/abs/2303.11630",
        "abstract": "Box-supervised instance segmentation has gained much attention as it requires only simple box annotations instead of costly mask or polygon annotations. However, existing box-supervised instance segmentation models mainly focus on mask-based frameworks. We propose a new end-to-end training technique, termed BoxSnake, to achieve effective polygonal instance segmentation using only box annotations for the first time. Our method consists of two loss functions: (1) a point-based unary loss that constrains the bounding box of predicted polygons to achieve coarse-grained segmentation; and (2) a distance-aware pairwise loss that encourages the predicted polygons to fit the object boundaries. Compared with the mask-based weakly-supervised methods, BoxSnake further reduces the performance gap between the predicted segmentation and the bounding box, and shows significant superiority on the Cityscapes dataset.",
        "creator": "Rui Yang, Lin Song, Yixiao Ge, Xiu Li"
      },
      {
        "title": "Manipulating Transfer Learning for Property Inference.",
        "link": "http://arxiv.org/abs/2303.11643",
        "abstract": "Transfer learning is a popular method for tuning pretrained (upstream) models for different downstream tasks using limited data and computational resources. We study how an adversary with control over an upstream model used in transfer learning can conduct property inference attacks on a victim's tuned downstream model. For example, to infer the presence of images of a specific individual in the downstream training set. We demonstrate attacks in which an adversary can manipulate the upstream model to conduct highly effective and specific property inference attacks (AUC score $&gt; 0.9$), without incurring significant performance loss on the main task. The main idea of the manipulation is to make the upstream model generate activations (intermediate features) with different distributions for samples with and without a target property, thus enabling the adversary to distinguish easily between downstream models trained with and without training examples that have the target property. Our code is available at https://github.com/yulongt23/Transfer-Inference.",
        "creator": "Yulong Tian, Fnu Suya, Anshuman Suri, Fengyuan Xu, David Evans"
      },
      {
        "title": "A Survey on Class Imbalance in Federated Learning.",
        "link": "http://arxiv.org/abs/2303.11673",
        "abstract": "Federated learning, which allows multiple client devices in a network to jointly train a machine learning model without direct exposure of clients' data, is an emerging distributed learning technique due to its nature of privacy preservation. However, it has been found that models trained with federated learning usually have worse performance than their counterparts trained in the standard centralized learning mode, especially when the training data is imbalanced. In the context of federated learning, data imbalance may occur either locally one one client device, or globally across many devices. The complexity of different types of data imbalance has posed challenges to the development of federated learning technique, especially considering the need of relieving data imbalance issue and preserving data privacy at the same time. Therefore, in the literature, many attempts have been made to handle class imbalance in federated learning. In this paper, we present a detailed review of recent advancements along this line. We first introduce various types of class imbalance in federated learning, after which we review existing methods for estimating the extent of class imbalance without the need of knowing the actual data to preserve data privacy. After that, we discuss existing methods for handling class imbalance in FL, where the advantages and disadvantages of the these approaches are discussed. We also summarize common evaluation metrics for class imbalanced tasks, and point out potential future directions.",
        "creator": "Jing Zhang, Chuanwen Li, Jianzgong Qi, Jiayuan He"
      },
      {
        "title": "Linking generative semi-supervised learning and generative open-set recognition.",
        "link": "http://arxiv.org/abs/2303.11702",
        "abstract": "This study investigates the relationship between semi-supervised learning (SSL) and open-set recognition (OSR) in the context of generative adversarial networks (GANs). Although no previous study has formally linked SSL and OSR, their respective methods share striking similarities. Specifically, SSL-GANs and OSR-GANs require generator to produce samples in the complementary space. Subsequently, by regularising networks with generated samples, both SSL and OSR classifiers generalize the open space. To demonstrate the connection between SSL and OSR, we theoretically and experimentally compare state-of-the-art SSL-GAN methods with state-of-the-art OSR-GAN methods. Our results indicate that the SSL optimised margin-GANs, which have a stronger foundation in literature, set the new standard for the combined SSL-OSR task and achieves new state-of-other art results in certain general OSR experiments. However, the OSR optimised adversarial reciprocal point (ARP)-GANs still slightly out-performed margin-GANs at other OSR experiments. This result indicates unique insights for the combined optimisation task of SSL-OSR.",
        "creator": "Emile Reyn Engelbrecht, Johan du Preez"
      },
      {
        "title": "Efficiently Explaining CSPs with Unsatisfiable Subset Optimization (extended algorithms and examples).",
        "link": "http://arxiv.org/abs/2303.11712",
        "abstract": "We build on a recently proposed method for stepwise explaining solutions of Constraint Satisfaction Problems (CSP) in a human-understandable way. An explanation here is a sequence of simple inference steps where simplicity is quantified using a cost function. The algorithms for explanation generation rely on extracting Minimal Unsatisfiable Subsets (MUS) of a derived unsatisfiable formula, exploiting a one-to-one correspondence between so-called non-redundant explanations and MUSs. However, MUS extraction algorithms do not provide any guarantee of subset minimality or optimality with respect to a given cost function. Therefore, we build on these formal foundations and tackle the main points of improvement, namely how to generate explanations efficiently that are provably optimal (with respect to the given cost metric). For that, we developed (1) a hitting set-based algorithm for finding the optimal constrained unsatisfiable subsets; (2) a method for re-using relevant information over multiple algorithm calls; and (3) methods exploiting domain-specific information to speed up the explanation sequence generation. We experimentally validated our algorithms on a large number of CSP problems. We found that our algorithms outperform the MUS approach in terms of explanation quality and computational time (on average up to 56 % faster than a standard MUS approach).",
        "creator": "Emilio Gamba, Bart Bogaerts, Tias Guns"
      },
      {
        "title": "Style Miner: Find Significant and Stable Explanatory Factors in Time Series with Constrained Reinforcement Learning.",
        "link": "http://arxiv.org/abs/2303.11716",
        "abstract": "In high-dimensional time-series analysis, it is essential to have a set of key factors (namely, the style factors) that explain the change of the observed variable. For example, volatility modeling in finance relies on a set of risk factors, and climate change studies in climatology rely on a set of causal factors. The ideal low-dimensional style factors should balance significance (with high explanatory power) and stability (consistent, no significant fluctuations). However, previous supervised and unsupervised feature extraction methods can hardly address the tradeoff. In this paper, we propose Style Miner, a reinforcement learning method to generate style factors. We first formulate the problem as a Constrained Markov Decision Process with explanatory power as the return and stability as the constraint. Then, we design fine-grained immediate rewards and costs and use a Lagrangian heuristic to balance them adaptively. Experiments on real-world financial data sets show that Style Miner outperforms existing learning-based methods by a large margin and achieves a relatively 10% gain in R-squared explanatory power compared to the industry-renowned factors proposed by human experts.",
        "creator": "Dapeng Li, Feiyang Pan, Jia He, Zhiwei Xu, Dandan Tu, Guoliang Fan"
      },
      {
        "title": "A Complete Survey on Generative AI (AIGC): Is ChatGPT from GPT-4 to GPT-5 All You Need?.",
        "link": "http://arxiv.org/abs/2303.11717",
        "abstract": "As ChatGPT goes viral, generative AI (AIGC, a.k.a AI-generated content) has made headlines everywhere because of its ability to analyze and create text, images, and beyond. With such overwhelming media coverage, it is almost impossible for us to miss the opportunity to glimpse AIGC from a certain angle. In the era of AI transitioning from pure analysis to creation, it is worth noting that ChatGPT, with its most recent language model GPT-4, is just a tool out of numerous AIGC tasks. Impressed by the capability of the ChatGPT, many people are wondering about its limits: can GPT-5 (or other future GPT variants) help ChatGPT unify all AIGC tasks for diversified content creation? Toward answering this question, a comprehensive review of existing AIGC tasks is needed. As such, our work comes to fill this gap promptly by offering a first look at AIGC, ranging from its techniques to applications. Modern generative AI relies on various technical foundations, ranging from model architecture and self-supervised pretraining to generative modeling methods (like GAN and diffusion models). After introducing the fundamental techniques, this work focuses on the technological development of various AIGC tasks based on their output type, including text, images, videos, 3D content, etc., which depicts the full potential of ChatGPT's future. Moreover, we summarize their significant applications in some mainstream industries, such as education and creativity content. Finally, we discuss the challenges currently faced and present an outlook on how generative AI might evolve in the near future.",
        "creator": "Chaoning Zhang, Chenshuang Zhang, Sheng Zheng, Yu Qiao, Chenghao Li, Mengchun Zhang, Sumit Kumar Dam, Chu Myaet Thwal, Ye Lin Tun, Le Luang Huy, Donguk kim, Sung-Ho Bae, Lik-Hang Lee, Yang Yang, Heng Tao Shen, In So Kweon, Choong Seon Hong"
      },
      {
        "title": "Online Learning of Wheel Odometry Correction for Mobile Robots with Attention-based Neural Network.",
        "link": "http://arxiv.org/abs/2303.11725",
        "abstract": "Modern robotic platforms need a reliable localization system to operate daily beside humans. Simple pose estimation algorithms based on filtered wheel and inertial odometry often fail in the presence of abrupt kinematic changes and wheel slips. Moreover, despite the recent success of visual odometry, service and assistive robotic tasks often present challenging environmental conditions where visual-based solutions fail due to poor lighting or repetitive feature patterns. In this work, we propose an innovative online learning approach for wheel odometry correction, paving the way for a robust multi-source localization system. An efficient attention-based neural network architecture has been studied to combine precise performances with real-time inference. The proposed solution shows remarkable results compared to a standard neural network and filter-based odometry correction algorithms. Nonetheless, the online learning paradigm avoids the time-consuming data collection procedure and can be adopted on a generic robotic platform on-the-fly.",
        "creator": "Alessandro Navone, Mauro Martini, Simone Angarano, Marcello Chiaberge"
      },
      {
        "title": "Abstract Visual Reasoning: An Algebraic Approach for Solving Raven's Progressive Matrices.",
        "link": "http://arxiv.org/abs/2303.11730",
        "abstract": "We introduce algebraic machine reasoning, a new reasoning framework that is well-suited for abstract reasoning. Effectively, algebraic machine reasoning reduces the difficult process of novel problem-solving to routine algebraic computation. The fundamental algebraic objects of interest are the ideals of some suitably initialized polynomial ring. We shall explain how solving Raven's Progressive Matrices (RPMs) can be realized as computational problems in algebra, which combine various well-known algebraic subroutines that include: Computing the Gr\\\"obner basis of an ideal, checking for ideal containment, etc. Crucially, the additional algebraic structure satisfied by ideals allows for more operations on ideals beyond set-theoretic operations.  Our algebraic machine reasoning framework is not only able to select the correct answer from a given answer set, but also able to generate the correct answer with only the question matrix given. Experiments on the I-RAVEN dataset yield an overall $93.2\\%$ accuracy, which significantly outperforms the current state-of-the-art accuracy of $77.0\\%$ and exceeds human performance at $84.4\\%$ accuracy.",
        "creator": "Jingyi Xu, Tushar Vaidya, Yufei Wu, Saket Chandra, Zhangsheng Lai, Kai Fong Ernest Chong"
      },
      {
        "title": "DIPPM: a Deep Learning Inference Performance Predictive Model using Graph Neural Networks.",
        "link": "http://arxiv.org/abs/2303.11733",
        "abstract": "Deep Learning (DL) has developed to become a corner-stone in many everyday applications that we are now relying on. However, making sure that the DL model uses the underlying hardware efficiently takes a lot of effort. Knowledge about inference characteristics can help to find the right match so that enough resources are given to the model, but not too much. We have developed a DL Inference Performance Predictive Model (DIPPM) that predicts the inference latency, energy, and memory usage of a given input DL model on the NVIDIA A100 GPU. We also devised an algorithm to suggest the appropriate A100 Multi-Instance GPU profile from the output of DIPPM. We developed a methodology to convert DL models expressed in multiple frameworks to a generalized graph structure that is used in DIPPM. It means DIPPM can parse input DL models from various frameworks. Our DIPPM can be used not only helps to find suitable hardware configurations but also helps to perform rapid design-space exploration for the inference performance of a model. We constructed a graph multi-regression dataset consisting of 10,508 different DL models to train and evaluate the performance of DIPPM, and reached a resulting Mean Absolute Percentage Error (MAPE) as low as 1.9%.",
        "creator": "Karthick Panner Selvam, Mats Brorsson"
      },
      {
        "title": "Unlocking Layer-wise Relevance Propagation for Autoencoders.",
        "link": "http://arxiv.org/abs/2303.11734",
        "abstract": "Autoencoders are a powerful and versatile tool often used for various problems such as anomaly detection, image processing and machine translation. However, their reconstructions are not always trivial to explain. Therefore, we propose a fast explainability solution by extending the Layer-wise Relevance Propagation method with the help of Deep Taylor Decomposition framework. Furthermore, we introduce a novel validation technique for comparing our explainability approach with baseline methods in the case of missing ground-truth data. Our results highlight computational as well as qualitative advantages of the proposed explainability solution with respect to existing methods.",
        "creator": "Kenyu Kobayashi, Renata Khasanova, Arno Schneuwly, Felix Schmidt, Matteo Casserini"
      },
      {
        "title": "Poisoning Attacks in Federated Edge Learning for Digital Twin 6G-enabled IoTs: An Anticipatory Study.",
        "link": "http://arxiv.org/abs/2303.11745",
        "abstract": "Federated edge learning can be essential in supporting privacy-preserving, artificial intelligence (AI)-enabled activities in digital twin 6G-enabled Internet of Things (IoT) environments. However, we need to also consider the potential of attacks targeting the underlying AI systems (e.g., adversaries seek to corrupt data on the IoT devices during local updates or corrupt the model updates); hence, in this article, we propose an anticipatory study for poisoning attacks in federated edge learning for digital twin 6G-enabled IoT environments. Specifically, we study the influence of adversaries on the training and development of federated learning models in digital twin 6G-enabled IoT environments. We demonstrate that attackers can carry out poisoning attacks in two different learning settings, namely: centralized learning and federated learning, and successful attacks can severely reduce the model's accuracy. We comprehensively evaluate the attacks on a new cyber security dataset designed for IoT applications with three deep neural networks under the non-independent and identically distributed (Non-IID) data and the independent and identically distributed (IID) data. The poisoning attacks, on an attack classification problem, can lead to a decrease in accuracy from 94.93% to 85.98% with IID data and from 94.18% to 30.04% with Non-IID.",
        "creator": "Mohamed Amine Ferrag, Burak Kantarci, Lucas C. Cordeiro, Merouane Debbah, Kim-Kwang Raymond Choo"
      },
      {
        "title": "Lightweight Contrastive Protein Structure-Sequence Transformation.",
        "link": "http://arxiv.org/abs/2303.11783",
        "abstract": "Pretrained protein structure models without labels are crucial foundations for the majority of protein downstream applications. The conventional structure pretraining methods follow the mature natural language pretraining methods such as denoised reconstruction and masked language modeling but usually destroy the real representation of spatial structures. The other common pretraining methods might predict a fixed set of predetermined object categories, where a restricted supervised manner limits their generality and usability as additional labeled data is required to specify any other protein concepts. In this work, we introduce a novel unsupervised protein structure representation pretraining with a robust protein language model. In particular, we first propose to leverage an existing pretrained language model to guide structure model learning through an unsupervised contrastive alignment. In addition, a self-supervised structure constraint is proposed to further learn the intrinsic information about the structures. With only light training data, the pretrained structure model can obtain better generalization ability. To quantitatively evaluate the proposed structure models, we design a series of rational evaluation methods, including internal tasks (e.g., contact map prediction, distribution alignment quality) and external/downstream tasks (e.g., protein design). The extensive experimental results conducted on multiple tasks and specific datasets demonstrate the superiority of the proposed sequence-structure transformation framework.",
        "creator": "Jiangbin Zheng, Ge Wang, Yufei Huang, Bozhen Hu, Siyuan Li, Cheng Tan, Xinwen Fan, Stan Z. Li"
      },
      {
        "title": "Addressing Class Variable Imbalance in Federated Semi-supervised Learning.",
        "link": "http://arxiv.org/abs/2303.11809",
        "abstract": "Federated Semi-supervised Learning (FSSL) combines techniques from both fields of federated and semi-supervised learning to improve the accuracy and performance of models in a distributed environment by using a small fraction of labeled data and a large amount of unlabeled data. Without the need to centralize all data in one place for training, it collect updates of model training after devices train models at local, and thus can protect the privacy of user data. However, during the federal training process, some of the devices fail to collect enough data for local training, while new devices will be included to the group training. This leads to an unbalanced global data distribution and thus affect the performance of the global model training. Most of the current research is focusing on class imbalance with a fixed number of classes, while little attention is paid to data imbalance with a variable number of classes. Therefore, in this paper, we propose Federated Semi-supervised Learning for Class Variable Imbalance (FCVI) to solve class variable imbalance. The class-variable learning algorithm is used to mitigate the data imbalance due to changes of the number of classes. Our scheme is proved to be significantly better than baseline methods, while maintaining client privacy.",
        "creator": "Zehui Dong, Wenjing Liu, Siyuan Liu, Xingzhi Chen"
      },
      {
        "title": "Dens-PU: PU Learning with Density-Based Positive Labeled Augmentation.",
        "link": "http://arxiv.org/abs/2303.11848",
        "abstract": "This study proposes a novel approach for solving the PU learning problem based on an anomaly-detection strategy. Latent encodings extracted from positive-labeled data are linearly combined to acquire new samples. These new samples are used as embeddings to increase the density of positive-labeled data and, thus, define a boundary that approximates the positive class. The further a sample is from the boundary the more it is considered as a negative sample. Once a set of negative samples is obtained, the PU learning problem reduces to binary classification. The approach, named Dens-PU due to its reliance on the density of positive-labeled data, was evaluated using benchmark image datasets, and state-of-the-art results were attained.",
        "creator": "Vasileios Sevetlidis, George Pavlidis, Spyridon Mouroutsos, Antonios Gasteratos"
      },
      {
        "title": "LoRCoN-LO: Long-term Recurrent Convolutional Network-based LiDAR Odometry.",
        "link": "http://arxiv.org/abs/2303.11853",
        "abstract": "We propose a deep learning-based LiDAR odometry estimation method called LoRCoN-LO that utilizes the long-term recurrent convolutional network (LRCN) structure. The LRCN layer is a structure that can process spatial and temporal information at once by using both CNN and LSTM layers. This feature is suitable for predicting continuous robot movements as it uses point clouds that contain spatial information. Therefore, we built a LoRCoN-LO model using the LRCN layer, and predicted the pose of the robot through this model. For performance verification, we conducted experiments exploiting a public dataset (KITTI). The results of the experiment show that LoRCoN-LO displays accurate odometry prediction in the dataset. The code is available at https://github.com/donghwijung/LoRCoN-LO.",
        "creator": "Donghwi Jung, Jae-Kyung Cho, Younghwa Jung, Soohyun Shin, Seong-Woo Kim"
      },
      {
        "title": "Modeling Relational Patterns for Logical Query Answering over Knowledge Graphs.",
        "link": "http://arxiv.org/abs/2303.11858",
        "abstract": "Answering first-order logical (FOL) queries over knowledge graphs (KG) remains a challenging task mainly due to KG incompleteness. Query embedding approaches this problem by computing the low-dimensional vector representations of entities, relations, and logical queries. KGs exhibit relational patterns such as symmetry and composition and modeling the patterns can further enhance the performance of query embedding models. However, the role of such patterns in answering FOL queries by query embedding models has not been yet studied in the literature. In this paper, we fill in this research gap and empower FOL queries reasoning with pattern inference by introducing an inductive bias that allows for learning relation patterns. To this end, we develop a novel query embedding method, RoConE, that defines query regions as geometric cones and algebraic query operators by rotations in complex space. RoConE combines the advantages of Cone as a well-specified geometric representation for query embedding, and also the rotation operator as a powerful algebraic operation for pattern inference. Our experimental results on several benchmark datasets confirm the advantage of relational patterns for enhancing logical query answering task.",
        "creator": "Yunjie He, Mojtaba Nayyeri, Bo Xiong, Evgeny Kharlamov, Steffen Staab"
      },
      {
        "title": "Online Transformers with Spiking Neurons for Fast Prosthetic Hand Control.",
        "link": "http://arxiv.org/abs/2303.11860",
        "abstract": "Transformers are state-of-the-art networks for most sequence processing tasks. However, the self-attention mechanism often used in Transformers requires large time windows for each computation step and thus makes them less suitable for online signal processing compared to Recurrent Neural Networks (RNNs). In this paper, instead of the self-attention mechanism, we use a sliding window attention mechanism. We show that this mechanism is more efficient for continuous signals with finite-range dependencies between input and target, and that we can use it to process sequences element-by-element, this making it compatible with online processing. We test our model on a finger position regression dataset (NinaproDB8) with Surface Electromyographic (sEMG) signals measured on the forearm skin to estimate muscle activities. Our approach sets the new state-of-the-art in terms of accuracy on this dataset while requiring only very short time windows of 3.5 ms at each inference step. Moreover, we increase the sparsity of the network using Leaky-Integrate and Fire (LIF) units, a bio-inspired neuron model that activates sparsely in time solely when crossing a threshold. We thus reduce the number of synaptic operations up to a factor of $\\times5.3$ without loss of accuracy. Our results hold great promises for accurate and fast online processing of sEMG signals for smooth prosthetic hand control and is a step towards Transformers and Spiking Neural Networks (SNNs) co-integration for energy efficient temporal signal processing.",
        "creator": "Nathan Leroux, Jan Finkbeiner, Emre Neftci"
      },
      {
        "title": "Continual Learning in the Presence of Spurious Correlation.",
        "link": "http://arxiv.org/abs/2303.11863",
        "abstract": "Most continual learning (CL) algorithms have focused on tackling the stability-plasticity dilemma, that is, the challenge of preventing the forgetting of previous tasks while learning new ones. However, they have overlooked the impact of the knowledge transfer when the dataset in a certain task is biased - namely, when some unintended spurious correlations of the tasks are learned from the biased dataset. In that case, how would they affect learning future tasks or the knowledge already learned from the past tasks? In this work, we carefully design systematic experiments using one synthetic and two real-world datasets to answer the question from our empirical findings. Specifically, we first show through two-task CL experiments that standard CL methods, which are unaware of dataset bias, can transfer biases from one task to another, both forward and backward, and this transfer is exacerbated depending on whether the CL methods focus on the stability or the plasticity. We then present that the bias transfer also exists and even accumulate in longer sequences of tasks. Finally, we propose a simple, yet strong plug-in method for debiasing-aware continual learning, dubbed as Group-class Balanced Greedy Sampling (BGS). As a result, we show that our BGS can always reduce the bias of a CL model, with a slight loss of CL performance at most.",
        "creator": "Donggyu Lee, Sangwon Jung, Taesup Moon"
      },
      {
        "title": "Better Understanding Differences in Attribution Methods via Systematic Evaluations.",
        "link": "http://arxiv.org/abs/2303.11884",
        "abstract": "Deep neural networks are very successful on many vision tasks, but hard to interpret due to their black box nature. To overcome this, various post-hoc attribution methods have been proposed to identify image regions most influential to the models' decisions. Evaluating such methods is challenging since no ground truth attributions exist. We thus propose three novel evaluation schemes to more reliably measure the faithfulness of those methods, to make comparisons between them more fair, and to make visual inspection more systematic. To address faithfulness, we propose a novel evaluation setting (DiFull) in which we carefully control which parts of the input can influence the output in order to distinguish possible from impossible attributions. To address fairness, we note that different methods are applied at different layers, which skews any comparison, and so evaluate all methods on the same layers (ML-Att) and discuss how this impacts their performance on quantitative metrics. For more systematic visualizations, we propose a scheme (AggAtt) to qualitatively evaluate the methods on complete datasets. We use these evaluation schemes to study strengths and shortcomings of some widely used attribution methods over a wide range of models. Finally, we propose a post-processing smoothing step that significantly improves the performance of some attribution methods, and discuss its applicability.",
        "creator": "Sukrut Rao, Moritz B&#xf6;hle, Bernt Schiele"
      },
      {
        "title": "Penalty-Based Imitation Learning With Cross Semantics Generation Sensor Fusion for Autonomous Driving.",
        "link": "http://arxiv.org/abs/2303.11888",
        "abstract": "With the rapid development of Pattern Recognition and Computer Vision technologies, tasks like object detection or semantic segmentation have achieved even better accuracy than human beings. Based on these solid foundations, autonomous driving is becoming an important research direction, aiming to revolute the future of transportation and mobility. Sensors are critical to autonomous driving's security and feasibility to perceive the surrounding environment. Multi-Sensor fusion has become a current research hot spot because of its potential for multidimensional perception and integration ability. In this paper, we propose a novel feature-level multi-sensor fusion technology for end-to-end autonomous driving navigation with imitation learning. Our paper mainly focuses on fusion technologies for Lidar and RGB information. We also provide a brand-new penalty-based imitation learning method to reinforce the model's compliance with traffic rules and unify the objective of imitation learning and the metric of autonomous driving.",
        "creator": "Hongkuan Zhou, Aifen Sui, Letian Shi"
      },
      {
        "title": "Multi-agent Reinforcement Learning for Regional Signal control in Large-scale Grid Traffic network.",
        "link": "http://arxiv.org/abs/2303.11899",
        "abstract": "Adaptive traffic signal control with Multi-agent Reinforcement Learning(MARL) is a very popular topic nowadays. In most existing novel methods, one agent controls single intersections and these methods focus on the cooperation between intersections. However, the non-stationary property of MARL still limits the performance of the above methods as the size of traffic networks grows. One compromised strategy is to assign one agent with a region of intersections to reduce the number of agents. There are two challenges in this strategy, one is how to partition a traffic network into small regions and the other is how to search for the optimal joint actions for a region of intersections. In this paper, we propose a novel training framework RegionLight where our region partition rule is based on the adjacency between the intersection and extended Branching Dueling Q-Network(BDQ) to Dynamic Branching Dueling Q-Network(DBDQ) to bound the growth of the size of joint action space and alleviate the bias introduced by imaginary intersections outside of the boundary of the traffic network. Our experiments on both real datasets and synthetic datasets demonstrate that our framework performs best among other novel frameworks and that our region partition rule is robust.",
        "creator": "Hankang Gu, Shangbo Wang"
      },
      {
        "title": "Deephys: Deep Electrophysiology, Debugging Neural Networks under Distribution Shifts.",
        "link": "http://arxiv.org/abs/2303.11912",
        "abstract": "Deep Neural Networks (DNNs) often fail in out-of-distribution scenarios. In this paper, we introduce a tool to visualize and understand such failures. We draw inspiration from concepts from neural electrophysiology, which are based on inspecting the internal functioning of a neural networks by analyzing the feature tuning and invariances of individual units. Deep Electrophysiology, in short Deephys, provides insights of the DNN's failures in out-of-distribution scenarios by comparative visualization of the neural activity in in-distribution and out-of-distribution datasets. Deephys provides seamless analyses of individual neurons, individual images, and a set of set of images from a category, and it is capable of revealing failures due to the presence of spurious features and novel features. We substantiate the validity of the qualitative visualizations of Deephys thorough quantitative analyses using convolutional and transformers architectures, in several datasets and distribution shifts (namely, colored MNIST, CIFAR-10 and ImageNet).",
        "creator": "Anirban Sarkar, Matthew Groth, Ian Mason, Tomotake Sasaki, Xavier Boix"
      },
      {
        "title": "Do intermediate feature coalitions aid explainability of black-box models?.",
        "link": "http://arxiv.org/abs/2303.11920",
        "abstract": "This work introduces the notion of intermediate concepts based on levels structure to aid explainability for black-box models. The levels structure is a hierarchical structure in which each level corresponds to features of a dataset (i.e., a player-set partition). The level of coarseness increases from the trivial set, which only comprises singletons, to the set, which only contains the grand coalition. In addition, it is possible to establish meronomies, i.e., part-whole relationships, via a domain expert that can be utilised to generate explanations at an abstract level. We illustrate the usability of this approach in a real-world car model example and the Titanic dataset, where intermediate concepts aid in explainability at different levels of abstraction.",
        "creator": "Minal Suresh Patil, Kary Fr&#xe4;mling"
      },
      {
        "title": "Using Explanations to Guide Models.",
        "link": "http://arxiv.org/abs/2303.11932",
        "abstract": "Deep neural networks are highly performant, but might base their decision on spurious or background features that co-occur with certain classes, which can hurt generalization. To mitigate this issue, the usage of 'model guidance' has gained popularity recently: for this, models are guided to be \"right for the right reasons\" by regularizing the models' explanations to highlight the right features. Experimental validation of these approaches has thus far however been limited to relatively simple and / or synthetic datasets. To gain a better understanding of which model-guiding approaches actually transfer to more challenging real-world datasets, in this work we conduct an in-depth evaluation across various loss functions, attribution methods, models, and 'guidance depths' on the PASCAL VOC 2007 and MS COCO 2014 datasets, and show that model guidance can sometimes even improve model performance. In this context, we further propose a novel energy loss, show its effectiveness in directing the model to focus on object features. We also show that these gains can be achieved even with a small fraction (e.g. 1%) of bounding box annotations, highlighting the cost effectiveness of this approach. Lastly, we show that this approach can also improve generalization under distribution shifts. Code will be made available.",
        "creator": "Sukrut Rao, Moritz B&#xf6;hle, Amin Parchami-Araghi, Bernt Schiele"
      },
      {
        "title": "Sparse Distributed Memory is a Continual Learner.",
        "link": "http://arxiv.org/abs/2303.11934",
        "abstract": "Continual learning is a problem for artificial neural networks that their biological counterparts are adept at solving. Building on work using Sparse Distributed Memory (SDM) to connect a core neural circuit with the powerful Transformer model, we create a modified Multi-Layered Perceptron (MLP) that is a strong continual learner. We find that every component of our MLP variant translated from biology is necessary for continual learning. Our solution is also free from any memory replay or task information, and introduces novel methods to train sparse networks that may be broadly applicable.",
        "creator": "Trenton Bricken, Xander Davies, Deepak Singh, Dmitry Krotov, Gabriel Kreiman"
      },
      {
        "title": "Representational Tenets for Memory Athletics.",
        "link": "http://arxiv.org/abs/2303.11944",
        "abstract": "We describe the current state of world-class memory competitions, including the methods used to prepare for and compete in memory competitions, based on the subjective report of World Memory Championship Grandmaster and co-author Nelson Dellis. We then explore the reported experiences through the lens of the Simulated, Situated, and Structurally coherent Qualia (S3Q) theory of consciousness, in order to propose a set of experiments to help further understand the boundaries of expert memory performance.",
        "creator": "Kevin Schmidt, Othalia Larue, Ray Kulhanek, Dylan Flaute, Razvan Veliche, Christian Manasseh, Nelson Dellis, Scott Clouse, Jared Culbertson, Steve Rogers"
      },
      {
        "title": "Unsupervised Cross-Domain Rumor Detection with Contrastive Learning and Cross-Attention.",
        "link": "http://arxiv.org/abs/2303.11945",
        "abstract": "Massive rumors usually appear along with breaking news or trending topics, seriously hindering the truth. Existing rumor detection methods are mostly focused on the same domain, and thus have poor performance in cross-domain scenarios due to domain shift. In this work, we propose an end-to-end instance-wise and prototype-wise contrastive learning model with a cross-attention mechanism for cross-domain rumor detection. The model not only performs cross-domain feature alignment but also enforces target samples to align with the corresponding prototypes of a given source domain. Since target labels in a target domain are unavailable, we use a clustering-based approach with carefully initialized centers by a batch of source domain samples to produce pseudo labels. Moreover, we use a cross-attention mechanism on a pair of source data and target data with the same labels to learn domain-invariant representations. Because the samples in a domain pair tend to express similar semantic patterns, especially on the people's attitudes (e.g., supporting or denying) towards the same category of rumors, the discrepancy between a pair of the source domain and target domain will be decreased. We conduct experiments on four groups of cross-domain datasets and show that our proposed model achieves state-of-the-art performance.",
        "creator": "Hongyan Ran, Caiyan Jia"
      },
      {
        "title": "The Power of Nudging: Exploring Three Interventions for Metacognitive Skills Instruction across Intelligent Tutoring Systems.",
        "link": "http://arxiv.org/abs/2303.11965",
        "abstract": "Deductive domains are typical of many cognitive skills in that no single problem-solving strategy is always optimal for solving all problems. It was shown that students who know how and when to use each strategy (StrTime) outperformed those who know neither and stick to the default strategy (Default). In this work, students were trained on a logic tutor that supports a default forward-chaining and a backward-chaining (BC) strategy, then a probability tutor that only supports BC. We investigated three types of interventions on teaching the Default students how and when to use which strategy on the logic tutor: Example, Nudge and Presented. Meanwhile, StrTime students received no interventions. Overall, our results show that Nudge outperformed their Default peers and caught up with StrTime on both tutors.",
        "creator": "Mark Abdelshiheed, John Wesley Hostetter, Preya Shabrina, Tiffany Barnes, Min Chi"
      },
      {
        "title": "Deep trip generation with graph neural networks for bike sharing system expansion.",
        "link": "http://arxiv.org/abs/2303.11977",
        "abstract": "Bike sharing is emerging globally as an active, convenient, and sustainable mode of transportation. To plan successful bike-sharing systems (BSSs), many cities start from a small-scale pilot and gradually expand the system to cover more areas. For station-based BSSs, this means planning new stations based on existing ones over time, which requires prediction of the number of trips generated by these new stations across the whole system. Previous studies typically rely on relatively simple regression or machine learning models, which are limited in capturing complex spatial relationships. Despite the growing literature in deep learning methods for travel demand prediction, they are mostly developed for short-term prediction based on time series data, assuming no structural changes to the system. In this study, we focus on the trip generation problem for BSS expansion, and propose a graph neural network (GNN) approach to predicting the station-level demand based on multi-source urban built environment data. Specifically, it constructs multiple localized graphs centered on each target station and uses attention mechanisms to learn the correlation weights between stations. We further illustrate that the proposed approach can be regarded as a generalized spatial regression model, indicating the commonalities between spatial regression and GNNs. The model is evaluated based on realistic experiments using multi-year BSS data from New York City, and the results validate the superior performance of our approach compared to existing methods. We also demonstrate the interpretability of the model for uncovering the effects of built environment features and spatial interactions between stations, which can provide strategic guidance for BSS station location selection and capacity planning.",
        "creator": "Yuebing Liang, Fangyi Ding, Guan Huang, Zhan Zhao"
      },
      {
        "title": "Artificial muses: Generative Artificial Intelligence Chatbots Have Risen to Human-Level Creativity.",
        "link": "http://arxiv.org/abs/2303.12003",
        "abstract": "A widespread view is that Artificial Intelligence cannot be creative. We tested this assumption by comparing human-generated ideas with those generated by six Generative Artificial Intelligence (GAI) chatbots: $alpa.\\!ai$, $Copy.\\!ai$, ChatGPT (versions 3 and 4), $Studio.\\!ai$, and YouChat. Humans and a specifically trained AI independently assessed the quality and quantity of ideas. We found no qualitative difference between AI and human-generated creativity, although there are differences in how ideas are generated. Interestingly, 9.4 percent of humans were more creative than the most creative GAI, GPT-4. Our findings suggest that GAIs are valuable assistants in the creative process. Continued research and development of GAI in creative tasks is crucial to fully understand this technology's potential benefits and drawbacks in shaping the future of creativity. Finally, we discuss the question of whether GAIs are capable of being truly creative.",
        "creator": "Jennifer Haase, Paul H. P. Hanel"
      },
      {
        "title": "Logical Reasoning over Natural Language as Knowledge Representation: A Survey.",
        "link": "http://arxiv.org/abs/2303.12023",
        "abstract": "Logical reasoning is central to human cognition and intelligence. Past research of logical reasoning within AI uses formal language as knowledge representation~(and symbolic reasoners). However, reasoning with formal language has proved challenging~(e.g., brittleness and knowledge-acquisition bottleneck). This paper provides a comprehensive overview on a new paradigm of logical reasoning, which uses natural language as knowledge representation~(and pretrained language models as reasoners), including philosophical definition and categorization of logical reasoning, advantages of the new paradigm, benchmarks and methods, challenges of the new paradigm, desirable tasks &amp; methods in the future, and relation to related NLP fields. This new paradigm is promising since it not only alleviates many challenges of formal representation but also has advantages over end-to-end neural methods.",
        "creator": "Zonglin Yang, Xinya Du, Rui Mao, Jinjie Ni, Erik Cambria"
      },
      {
        "title": "cTBL: Augmenting Large Language Models for Conversational Tables.",
        "link": "http://arxiv.org/abs/2303.12024",
        "abstract": "An open challenge in multimodal conversational AI requires augmenting large language models with information from textual and non-textual sources for multi-turn dialogue. To address this problem, this paper introduces Conversational Tables (cTBL), a three-step encoder-decoder approach to retrieve tabular information and generate dialogue responses grounded on the retrieved information. cTBL uses Transformer encoder embeddings for Dense Table Retrieval and obtains up to 5% relative improvement in Top-1 and Top-3 accuracy over sparse retrieval on the HyrbiDialogue dataset. Additionally, cTBL performs tabular knowledge retrieval using both encoder and decoder models, resulting in up to 46% relative improvement in ROUGE scores and better human evaluation for response generation on HyrbiDialogue.",
        "creator": "Anirudh S Sundar, Larry Heck"
      },
      {
        "title": "The Representational Status of Deep Learning Models.",
        "link": "http://arxiv.org/abs/2303.12032",
        "abstract": "This paper aims to clarify the representational status of Deep Learning Models (DLMs). While commonly referred to as 'representations', what this entails is ambiguous due to a conflation of functional and relational conceptions of representation. This paper argues that while DLMs represent their targets in a relational sense, they are best understood as highly idealized models. This result has immediate implications for explainable AI (XAI) and directs philosophical attention toward examining the idealized nature of DLM representations and their role in future scientific investigation.",
        "creator": "Eamon Duede"
      },
      {
        "title": "Roots and Requirements for Collaborative AI.",
        "link": "http://arxiv.org/abs/2303.12040",
        "abstract": "The vision of AI collaborators has long been a staple of science fiction, where artificial agents understand nuances of collaboration and human communication. They bring advantages to their human collaborators and teams by contributing their special talents. Government advisory groups and leaders in AI have advocated for years that AIs should be human compatible and be capable of effective collaboration. Nonetheless, robust AIs that can collaborate like talented people remain out of reach. This position paper draws on a cognitive analysis of what effective and robust collaboration requires of human and artificial agents. It sketches a history of public and AI visions for artificial collaborators, starting with early visions of intelligence augmentation (IA) and artificial intelligence (AI). It is intended as motivation and context for a second position paper on collaborative AI (Stefik &amp; Price, 2023). The second paper reviews the multi-disciplinary state-of-the-art and proposes a roadmap for bootstrapping collaborative AIs.",
        "creator": "Mark Stefik"
      },
      {
        "title": "Dexterity from Touch: Self-Supervised Pre-Training of Tactile Representations with Robotic Play.",
        "link": "http://arxiv.org/abs/2303.12076",
        "abstract": "Teaching dexterity to multi-fingered robots has been a longstanding challenge in robotics. Most prominent work in this area focuses on learning controllers or policies that either operate on visual observations or state estimates derived from vision. However, such methods perform poorly on fine-grained manipulation tasks that require reasoning about contact forces or about objects occluded by the hand itself. In this work, we present T-Dex, a new approach for tactile-based dexterity, that operates in two phases. In the first phase, we collect 2.5 hours of play data, which is used to train self-supervised tactile encoders. This is necessary to bring high-dimensional tactile readings to a lower-dimensional embedding. In the second phase, given a handful of demonstrations for a dexterous task, we learn non-parametric policies that combine the tactile observations with visual ones. Across five challenging dexterous tasks, we show that our tactile-based dexterity models outperform purely vision and torque-based models by an average of 1.7X. Finally, we provide a detailed analysis on factors critical to T-Dex including the importance of play data, architectures, and representation learning.",
        "creator": "Irmak Guzey, Ben Evans, Soumith Chintala, Lerrel Pinto"
      },
      {
        "title": "Contextual Linear Bandits under Noisy Features: Towards Bayesian Oracles.",
        "link": "http://arxiv.org/abs/1703.01347",
        "abstract": "We study contextual linear bandit problems under feature uncertainty; they are noisy with missing entries. To address the challenges of the noise, we analyze Bayesian oracles given observed noisy features. Our Bayesian analysis finds that the optimal hypothesis can be far from the underlying realizability function, depending on the noise characteristics, which are highly non-intuitive and do not occur for classical noiseless setups. This implies that classical approaches cannot guarantee a non-trivial regret bound. Therefore, we propose an algorithm that aims at the Bayesian oracle from observed information under this model, achieving $\\tilde{O}(d\\sqrt{T})$ regret bound when there is a large number of arms. We demonstrate the proposed algorithm using synthetic and real-world datasets.",
        "creator": "Jung-hun Kim, Se-Young Yun, Minchan Jeong, Jun Hyun Nam, Jinwoo Shin, Richard Combes"
      },
      {
        "title": "Holistic Deep Learning.",
        "link": "http://arxiv.org/abs/2110.15829",
        "abstract": "This paper presents a novel holistic deep learning framework that simultaneously addresses the challenges of vulnerability to input perturbations, overparametrization, and performance instability from different train-validation splits. The proposed framework holistically improves accuracy, robustness, sparsity, and stability over standard deep learning models, as demonstrated by extensive experiments on both tabular and image data sets. The results are further validated by ablation experiments and SHAP value analysis, which reveal the interactions and trade-offs between the different evaluation metrics. To support practitioners applying our framework, we provide a prescriptive approach that offers recommendations for selecting an appropriate training loss function based on their specific objectives. All the code to reproduce the results can be found at https://github.com/kimvc7/HDL.",
        "creator": "Dimitris Bertsimas, Kimberly Villalobos Carballo, L&#xe9;onard Boussioux, Michael Lingzhi Li, Alex Paskov, Ivan Paskov"
      },
      {
        "title": "Pre-trained Token-replaced Detection Model as Few-shot Learner.",
        "link": "http://arxiv.org/abs/2203.03235",
        "abstract": "Pre-trained masked language models have demonstrated remarkable ability as few-shot learners. In this paper, as an alternative, we propose a novel approach to few-shot learning with pre-trained token-replaced detection models like ELECTRA. In this approach, we reformulate a classification or a regression task as a token-replaced detection problem. Specifically, we first define a template and label description words for each task and put them into the input to form a natural language prompt. Then, we employ the pre-trained token-replaced detection model to predict which label description word is the most original (i.e., least replaced) among all label description words in the prompt. A systematic evaluation on 16 datasets demonstrates that our approach outperforms few-shot learners with pre-trained masked language models in both one-sentence and two-sentence learning tasks.",
        "creator": "Zicheng Li, Shoushan Li, Guodong Zhou"
      },
      {
        "title": "DeepGraviLens: a Multi-Modal Architecture for Classifying Gravitational Lensing Data.",
        "link": "http://arxiv.org/abs/2205.00701",
        "abstract": "Gravitational lensing is the relativistic effect generated by massive bodies, which bend the space-time surrounding them. It is a deeply investigated topic in astrophysics and allows validating theoretical relativistic results and studying faint astrophysical objects that would not be visible otherwise. In recent years Machine Learning methods have been applied to support the analysis of the gravitational lensing phenomena by detecting lensing effects in data sets consisting of images associated with brightness variation time series. However, the state-of-art approaches either consider only images and neglect time-series data or achieve relatively low accuracy on the most difficult data sets. This paper introduces DeepGraviLens, a novel multi-modal network that classifies spatio-temporal data belonging to one non-lensed system type and three lensed system types. It surpasses the current state of the art accuracy results by $\\approx$ 19% to $\\approx$ 43%, depending on the considered data set. Such an improvement will enable the acceleration of the analysis of lensed objects in upcoming astrophysical surveys, which will exploit the petabytes of data collected, e.g., from the Vera C. Rubin Observatory.",
        "creator": "Nicol&#xf2; Oreste Pinciroli Vago, Piero Fraternali"
      },
      {
        "title": "MolScribe: Robust Molecular Structure Recognition with Image-To-Graph Generation.",
        "link": "http://arxiv.org/abs/2205.14311",
        "abstract": "Molecular structure recognition is the task of translating a molecular image into its graph structure. Significant variation in drawing styles and conventions exhibited in chemical literature poses a significant challenge for automating this task. In this paper, we propose MolScribe, a novel image-to-graph generation model that explicitly predicts atoms and bonds, along with their geometric layouts, to construct the molecular structure. Our model flexibly incorporates symbolic chemistry constraints to recognize chirality and expand abbreviated structures. We further develop data augmentation strategies to enhance the model robustness against domain shifts. In experiments on both synthetic and realistic molecular images, MolScribe significantly outperforms previous models, achieving 76-93% accuracy on public benchmarks. Chemists can also easily verify MolScribe's prediction, informed by its confidence estimation and atom-level alignment with the input image. MolScribe is publicly available through Python and web interfaces: https://github.com/thomas0809/MolScribe.",
        "creator": "Yujie Qian, Jiang Guo, Zhengkai Tu, Zhening Li, Connor W. Coley, Regina Barzilay"
      },
      {
        "title": "GAMR: A Guided Attention Model for (visual) Reasoning.",
        "link": "http://arxiv.org/abs/2206.04928",
        "abstract": "Humans continue to outperform modern AI systems in their ability to flexibly parse and understand complex visual scenes. Here, we present a novel module for visual reasoning, the Guided Attention Model for (visual) Reasoning (GAMR), which instantiates an active vision theory -- positing that the brain solves complex visual reasoning problems dynamically -- via sequences of attention shifts to select and route task-relevant visual information into memory. Experiments on an array of visual reasoning tasks and datasets demonstrate GAMR's ability to learn visual routines in a robust and sample-efficient manner. In addition, GAMR is shown to be capable of zero-shot generalization on completely novel reasoning tasks. Overall, our work provides computational support for cognitive theories that postulate the need for a critical interplay between attention and memory to dynamically maintain and manipulate task-relevant visual information to solve complex visual reasoning tasks.",
        "creator": "Mohit Vaishnav, Thomas Serre"
      },
      {
        "title": "An Abstract View on Optimizations in Propositional Frameworks.",
        "link": "http://arxiv.org/abs/2206.06440",
        "abstract": "Search-optimization problems are plentiful in scientific and engineering domains. Artificial intelligence has long contributed to the development of search algorithms and declarative programming languages geared toward solving and modeling search-optimization problems. Automated reasoning and knowledge representation are the subfields of AI that are particularly vested in these developments. Many popular automated reasoning paradigms provide users with languages supporting optimization statements: answer set programming or MaxSAT on minone, to name a few. These paradigms vary significantly in their languages and in the ways they express quality conditions on computed solutions. Here we propose a unifying framework of so-called weight systems that eliminates syntactic distinctions between paradigms and allows us to see essential similarities and differences between optimization statements provided by paradigms. This unifying outlook has significant simplifying and explanatory potential in the studies of optimization and modularity in automated reasoning and knowledge representation. It also supplies researchers with a convenient tool for proving the formal properties of distinct frameworks; bridging these frameworks; and facilitating the development of translational solvers.",
        "creator": "Yuliya Lierler"
      },
      {
        "title": "From Understanding Genetic Drift to a Smart-Restart Mechanism for Estimation-of-Distribution Algorithms.",
        "link": "http://arxiv.org/abs/2206.09090",
        "abstract": "Estimation-of-distribution algorithms (EDAs) are optimization algorithms that learn a distribution on the search space from which good solutions can be sampled easily. A key parameter of most EDAs is the sample size (population size). If the population size is too small, the update of the probabilistic model builds on few samples, leading to the undesired effect of genetic drift. Too large population sizes avoid genetic drift, but slow down the process.  Building on a recent quantitative analysis of how the population size leads to genetic drift, we design a smart-restart mechanism for EDAs. By stopping runs when the risk for genetic drift is high, it automatically runs the EDA in good parameter regimes.  Via a mathematical runtime analysis, we prove a general performance guarantee for this smart-restart scheme. This in particular shows that in many situations where the optimal (problem-specific) parameter values are known, the restart scheme automatically finds these, leading to the asymptotically optimal performance.  We also conduct an extensive experimental analysis. On four classic benchmark problems, we clearly observe the critical influence of the population size on the performance, and we find that the smart-restart scheme leads to a performance close to the one obtainable with optimal parameter values. Our results also show that previous theory-based suggestions for the optimal population size can be far from the optimal ones, leading to a performance clearly inferior to the one obtained via the smart-restart scheme. We also conduct experiments with PBIL (cross-entropy algorithm) on two combinatorial optimization problems from the literature, the max-cut problem and the bipartition problem. Again, we observe that the smart-restart mechanism finds much better values for the population size than those suggested in the literature, leading to a much better performance.",
        "creator": "Weijie Zheng, Benjamin Doerr"
      },
      {
        "title": "Ask-AC: An Initiative Advisor-in-the-Loop Actor-Critic Framework.",
        "link": "http://arxiv.org/abs/2207.01955",
        "abstract": "Despite the promising results achieved, state-of-the-art interactive reinforcement learning schemes rely on passively receiving supervision signals from advisor experts, in the form of either continuous monitoring or pre-defined rules, which inevitably result in a cumbersome and expensive learning process. In this paper, we introduce a novel initiative advisor-in-the-loop actor-critic framework, termed as Ask-AC, that replaces the unilateral advisor-guidance mechanism with a bidirectional learner-initiative one, and thereby enables a customized and efficacious message exchange between learner and advisor. At the heart of Ask-AC are two complementary components, namely action requester and adaptive state selector, that can be readily incorporated into various discrete actor-critic architectures. The former component allows the agent to initiatively seek advisor intervention in the presence of uncertain states, while the latter identifies the unstable states potentially missed by the former especially when environment changes, and then learns to promote the ask action on such states. Experimental results on both stationary and non-stationary environments and across different actor-critic backbones demonstrate that the proposed framework significantly improves the learning efficiency of the agent, and achieves the performances on par with those obtained by continuous advisor monitoring.",
        "creator": "Shunyu Liu, Na Yu, Jie Song, Kaixuan Chen, Zunlei Feng, Mingli Song"
      },
      {
        "title": "$L_2$BN: Enhancing Batch Normalization by Equalizing the $L_2$ Norms of Features.",
        "link": "http://arxiv.org/abs/2207.02625",
        "abstract": "In this paper, we analyze batch normalization from the perspective of discriminability and find the disadvantages ignored by previous studies: the difference in $l_2$ norms of sample features can hinder batch normalization from obtaining more distinguished inter-class features and more compact intra-class features. To address this issue, we propose a simple yet effective method to equalize the $l_2$ norms of sample features. Concretely, we $l_2$-normalize each sample feature before feeding them into batch normalization, and therefore the features are of the same magnitude. Since the proposed method combines the $l_2$ normalization and batch normalization, we name our method $L_2$BN. The $L_2$BN can strengthen the compactness of intra-class features and enlarge the discrepancy of inter-class features. The $L_2$BN is easy to implement and can exert its effect without any additional parameters or hyper-parameters. We evaluate the effectiveness of $L_2$BN through extensive experiments with various models on image classification and acoustic scene classification tasks. The results demonstrate that the $L_2$BN can boost the generalization ability of various neural network models and achieve considerable performance improvements.",
        "creator": "Zhennan Wang, Kehan Li, Runyi Yu, Yian Zhao, Pengchong Qiao, Chang Liu, Fan Xu, Xiangyang Ji, Guoli Song, Jie Chen"
      },
      {
        "title": "TaDaa: real time Ticket Assignment Deep learning Auto Advisor for customer support, help desk, and issue ticketing systems.",
        "link": "http://arxiv.org/abs/2207.11187",
        "abstract": "This paper proposes TaDaa: Ticket Assignment Deep learning Auto Advisor, which leverages the latest Transformers models and machine learning techniques quickly assign issues within an organization, like customer support, help desk and alike issue ticketing systems. The project provides functionality to 1) assign an issue to the correct group, 2) assign an issue to the best resolver, and 3) provide the most relevant previously solved tickets to resolvers. We leverage one ticketing system sample dataset, with over 3k+ groups and over 10k+ resolvers to obtain a 95.2% top 3 accuracy on group suggestions and a 79.0% top 5 accuracy on resolver suggestions. We hope this research will greatly improve average issue resolution time on customer support, help desk, and issue ticketing systems.",
        "creator": "Leon Feng, Jnana Senapati, Bill Liu"
      },
      {
        "title": "Computational Choreography using Human Motion Synthesis.",
        "link": "http://arxiv.org/abs/2210.04366",
        "abstract": "Should deep learning models be trained to analyze human performance art? To help answer this question, we explore an application of deep neural networks to synthesize artistic human motion. Problem tasks in human motion synthesis can include predicting the motions of humans in-the-wild, as well as generating new sequences of motions based on said predictions. We will discuss the potential of a less traditional application, where learning models are applied to predicting dance movements. There have been notable, recent efforts to analyze dance movements in a computational light, such as the Everybody Dance Now (EDN) learning model and a Cal Poly master's thesis, Take The Lead (TTL). We have effectively combined these two works along with our own deep neural network to produce a new system for dance motion prediction, image-to-image translation, and video generation.",
        "creator": "Patrick Perrine, Trevor Kirkby"
      },
      {
        "title": "Mitigating Covertly Unsafe Text within Natural Language Systems.",
        "link": "http://arxiv.org/abs/2210.09306",
        "abstract": "An increasingly prevalent problem for intelligent technologies is text safety, as uncontrolled systems may generate recommendations to their users that lead to injury or life-threatening consequences. However, the degree of explicitness of a generated statement that can cause physical harm varies. In this paper, we distinguish types of text that can lead to physical harm and establish one particularly underexplored category: covertly unsafe text. Then, we further break down this category with respect to the system's information and discuss solutions to mitigate the generation of text in each of these subcategories. Ultimately, our work defines the problem of covertly unsafe language that causes physical harm and argues that this subtle yet dangerous issue needs to be prioritized by stakeholders and regulators. We highlight mitigation strategies to inspire future researchers to tackle this challenging problem and help improve safety within smart systems.",
        "creator": "Alex Mei, Anisha Kabir, Sharon Levy, Melanie Subbiah, Emily Allaway, John Judge, Desmond Patton, Bruce Bimber, Kathleen McKeown, William Yang Wang"
      },
      {
        "title": "MixMask: Revisiting Masking Strategy for Siamese ConvNets.",
        "link": "http://arxiv.org/abs/2210.11456",
        "abstract": "Recent advances in self-supervised learning have integrated Masked Image Modeling (MIM) and Siamese Networks into a unified framework that leverages the benefits of both techniques. However, several issues remain unaddressed when applying conventional erase-based masking with Siamese ConvNets. These include (I) the inability to drop uninformative masked regions in ConvNets as they process data continuously, resulting in low training efficiency compared to ViT models; and (II) the mismatch between erase-based masking and the contrastive-based objective in Siamese ConvNets, which differs from the MIM approach. In this paper, we propose a filling-based masking strategy called MixMask to prevent information incompleteness caused by the randomly erased regions in an image in the vanilla masking method. Furthermore, we introduce a flexible loss function design that considers the semantic distance change between two different mixed views to adapt the integrated architecture and prevent mismatches between the transformed input and objective in Masked Siamese ConvNets (MSCN). We conducted extensive experiments on various datasets, including CIFAR-100, Tiny-ImageNet, and ImageNet-1K. The results demonstrate that our proposed framework achieves superior accuracy on linear probing, semi-supervised, and supervised finetuning, outperforming the state-of-the-art MSCN by a significant margin. Additionally, we demonstrate the superiority of our approach in object detection and segmentation tasks. Our source code is available at https://github.com/LightnessOfBeing/MixMask.",
        "creator": "Kirill Vishniakov, Eric Xing, Zhiqiang Shen"
      },
      {
        "title": "Neural Co-Processors for Restoring Brain Function: Results from a Cortical Model of Grasping.",
        "link": "http://arxiv.org/abs/2210.11478",
        "abstract": "Objective: A major challenge in designing closed-loop brain-computer interfaces is finding optimal stimulation patterns as a function of ongoing neural activity for different subjects and objectives. Approach: To achieve goal-directed closed-loop neurostimulation, we propose \"neural co-processors\" which use artificial neural networks and deep learning to learn optimal closed-loop stimulation policies, shaping neural activity and bridging injured neural circuits for targeted repair and rehabilitation. The co-processor adapts the stimulation policy as the biological circuit itself adapts to the stimulation, achieving a form of brain-device co-adaptation. Here we use simulations to lay the groundwork for future in vivo tests of neural co-processors. We leverage a cortical model of grasping, to which we applied various forms of simulated lesions, allowing us to develop the critical learning algorithms and study adaptations to non-stationarity. Main results: Our simulations show the ability of a neural co-processor to learn a stimulation policy using a supervised learning approach, and to adapt that policy as the underlying brain and sensors change. Our co-processor successfully co-adapted with the simulated brain to accomplish the reach-and-grasp task after a variety of lesions were applied, achieving recovery towards healthy function. Significance: Our results provide the first proof-of-concept demonstration of a co-processor for adaptive activity-dependent closed-loop neurostimulation, optimizing for a rehabilitation goal. While a gap remains between simulations and applications, our results provide insights on how co-processors may be developed for learning complex adaptive stimulation policies for a variety of neural rehabilitation and neuroprosthetic applications.",
        "creator": "Matthew J. Bryan (1), Linxing Preston Jiang (1), Rajesh P N Rao (1) ((1) Neural Systems Laboratory, Paul G. Allen School of Computer Science &amp; Engineering, University of Washington)"
      },
      {
        "title": "Collecting Interactive Multi-modal Datasets for Grounded Language Understanding.",
        "link": "http://arxiv.org/abs/2211.06552",
        "abstract": "Human intelligence can remarkably adapt quickly to new tasks and environments. Starting from a very young age, humans acquire new skills and learn how to solve new tasks either by imitating the behavior of others or by following provided natural language instructions. To facilitate research which can enable similar capabilities in machines, we made the following contributions (1) formalized the collaborative embodied agent using natural language task; (2) developed a tool for extensive and scalable data collection; and (3) collected the first dataset for interactive grounded language understanding.",
        "creator": "Shrestha Mohanty, Negar Arabzadeh, Milagro Teruel, Yuxuan Sun, Artem Zholus, Alexey Skrynnik, Mikhail Burtsev, Kavya Srinet, Aleksandr Panov, Arthur Szlam, Marc-Alexandre C&#xf4;t&#xe9;, Julia Kiseleva"
      },
      {
        "title": "SAMSON: Sharpness-Aware Minimization Scaled by Outlier Normalization for Improving DNN Generalization and Robustness.",
        "link": "http://arxiv.org/abs/2211.11561",
        "abstract": "Energy-efficient deep neural network (DNN) accelerators are prone to non-idealities that degrade DNN performance at inference time. To mitigate such degradation, existing methods typically add perturbations to the DNN weights during training to simulate inference on noisy hardware. However, this often requires knowledge about the target hardware and leads to a trade-off between DNN performance and robustness, decreasing the former to increase the latter. In this work, we show that applying sharpness-aware training, by optimizing for both the loss value and loss sharpness, significantly improves robustness to noisy hardware at inference time without relying on any assumptions about the target hardware. In particular, we propose a new adaptive sharpness-aware method that conditions the worst-case perturbation of a given weight not only on its magnitude but also on the range of the weight distribution. This is achieved by performing sharpness-aware minimization scaled by outlier minimization (SAMSON). Our approach outperforms existing sharpness-aware training methods both in terms of model generalization performance in noiseless regimes and robustness in noisy settings, as measured on several architectures and datasets.",
        "creator": "Gon&#xe7;alo Mordido, S&#xe9;bastien Henwood, Sarath Chandar, Fran&#xe7;ois Leduc-Primeau"
      },
      {
        "title": "Multiagent Reinforcement Learning for Autonomous Routing and Pickup Problem with Adaptation to Variable Demand.",
        "link": "http://arxiv.org/abs/2211.14983",
        "abstract": "We derive a learning framework to generate routing/pickup policies for a fleet of autonomous vehicles tasked with servicing stochastically appearing requests on a city map. We focus on policies that 1) give rise to coordination amongst the vehicles, thereby reducing wait times for servicing requests, 2) are non-myopic, and consider a-priori potential future requests, 3) can adapt to changes in the underlying demand distribution. Specifically, we are interested in policies that are adaptive to fluctuations of actual demand conditions in urban environments, such as on-peak vs. off-peak hours. We achieve this through a combination of (i) an online play algorithm that improves the performance of an offline-trained policy, and (ii) an offline approximation scheme that allows for adapting to changes in the underlying demand model. In particular, we achieve adaptivity of our learned policy to different demand distributions by quantifying a region of validity using the q-valid radius of a Wasserstein Ambiguity Set. We propose a mechanism for switching the originally trained offline approximation when the current demand is outside the original validity region. In this case, we propose to use an offline architecture, trained on a historical demand model that is closer to the current demand in terms of Wasserstein distance. We learn routing and pickup policies over real taxicab requests in San Francisco with high variability between on-peak and off-peak hours, demonstrating the ability of our method to adapt to real fluctuation in demand distributions. Our numerical results demonstrate that our method outperforms alternative rollout-based reinforcement learning schemes, as well as other classical methods from operations research.",
        "creator": "Daniel Garces, Sushmita Bhattacharya, Stephanie Gil, Dimitri Bertsekas"
      },
      {
        "title": "Fine-Grained Selective Similarity Integration for Drug-Target Interaction Prediction.",
        "link": "http://arxiv.org/abs/2212.00543",
        "abstract": "The discovery of drug-target interactions (DTIs) is a pivotal process in pharmaceutical development. Computational approaches are a promising and efficient alternative to tedious and costly wet-lab experiments for predicting novel DTIs from numerous candidates. Recently, with the availability of abundant heterogeneous biological information from diverse data sources, computational methods have been able to leverage multiple drug and target similarities to boost the performance of DTI prediction. Similarity integration is an effective and flexible strategy to extract crucial information across complementary similarity views, providing a compressed input for any similarity-based DTI prediction model. However, existing similarity integration methods filter and fuse similarities from a global perspective, neglecting the utility of similarity views for each drug and target. In this study, we propose a Fine-Grained Selective similarity integration approach, called FGS, which employs a local interaction consistency-based weight matrix to capture and exploit the importance of similarities at a finer granularity in both similarity selection and combination steps. We evaluate FGS on five DTI prediction datasets under various prediction settings. Experimental results show that our method not only outperforms similarity integration competitors with comparable computational costs, but also achieves better prediction performance than state-of-the-art DTI prediction approaches by collaborating with conventional base models. Furthermore, case studies on the analysis of similarity weights and on the verification of novel predictions confirm the practical ability of FGS.",
        "creator": "Bin Liu, Jin Wang, Kaiwei Sun, Grigorios Tsoumakas"
      },
      {
        "title": "Policy Adaptation from Foundation Model Feedback.",
        "link": "http://arxiv.org/abs/2212.07398",
        "abstract": "Recent progress on vision-language foundation models have brought significant advancement to building general-purpose robots. By using the pre-trained models to encode the scene and instructions as inputs for decision making, the instruction-conditioned policy can generalize across different objects and tasks. While this is encouraging, the policy still fails in most cases given an unseen task or environment. In this work, we propose Policy Adaptation from Foundation model Feedback (PAFF). When deploying the trained policy to a new task or a new environment, we first let the policy play with randomly generated instructions to record the demonstrations. While the execution could be wrong, we can use the pre-trained foundation models to provide feedback to relabel the demonstrations. This automatically provides new pairs of demonstration-instruction data for policy fine-tuning. We evaluate our method on a broad range of experiments with the focus on generalization on unseen objects, unseen tasks, unseen environments, and sim-to-real transfer. We show PAFF improves baselines by a large margin in all cases. Our project page is available at https://geyuying.github.io/PAFF/",
        "creator": "Yuying Ge, Annabella Macaluso, Li Erran Li, Ping Luo, Xiaolong Wang"
      },
      {
        "title": "Multi-Resolution Online Deterministic Annealing: A Hierarchical and Progressive Learning Architecture.",
        "link": "http://arxiv.org/abs/2212.08189",
        "abstract": "Hierarchical learning algorithms that gradually approximate a solution to a data-driven optimization problem are essential to decision-making systems, especially under limitations on time and computational resources. In this study, we introduce a general-purpose hierarchical learning architecture that is based on the progressive partitioning of a possibly multi-resolution data space. The optimal partition is gradually approximated by solving a sequence of optimization sub-problems that yield a sequence of partitions with increasing number of subsets. We show that the solution of each optimization problem can be estimated online using gradient-free stochastic approximation updates. As a consequence, a function approximation problem can be defined within each subset of the partition and solved using the theory of two-timescale stochastic approximation algorithms. This simulates an annealing process and defines a robust and interpretable heuristic method to gradually increase the complexity of the learning architecture in a task-agnostic manner, giving emphasis to regions of the data space that are considered more important according to a predefined criterion. Finally, by imposing a tree structure in the progression of the partitions, we provide a means to incorporate potential multi-resolution structure of the data space into this approach, significantly reducing its complexity, while introducing hierarchical variable-rate feature extraction properties similar to certain classes of deep learning architectures. Asymptotic convergence analysis and experimental results are provided for supervised and unsupervised learning problems.",
        "creator": "Christos Mavridis, John Baras"
      },
      {
        "title": "Risk-Sensitive Reinforcement Learning with Exponential Criteria.",
        "link": "http://arxiv.org/abs/2212.09010",
        "abstract": "While risk-neutral reinforcement learning has shown experimental success in a number of applications, it is well-known to be non-robust with respect to noise and perturbations in the parameters of the system. For this reason, risk-sensitive reinforcement learning algorithms have been studied to introduce robustness and sample efficiency, and lead to better real-life performance. In this work, we introduce new model-free risk-sensitive reinforcement learning algorithms as variations of widely-used Policy Gradient algorithms with similar implementation properties. In particular, we study the effect of exponential criteria on the risk-sensitivity of the policy of a reinforcement learning agent, and develop variants of the Monte Carlo Policy Gradient algorithm and the online (temporal-difference) Actor-Critic algorithm. Analytical results showcase that the use of exponential criteria generalize commonly used ad-hoc regularization approaches. The implementation, performance, and robustness properties of the proposed methods are evaluated in simulated experiments.",
        "creator": "Erfaun Noorani, Christos Mavridis, John Baras"
      },
      {
        "title": "Short-length SSVEP data extension by a novel generative adversarial networks based framework.",
        "link": "http://arxiv.org/abs/2301.05599",
        "abstract": "Steady-state visual evoked potentials (SSVEPs) based brain-computer interface (BCI) has received considerable attention due to its high information transfer rate (ITR) and available quantity of targets. However, the performance of frequency identification methods heavily hinges on the amount of user calibration data and data length, which hinders the deployment in real-world applications. Recently, generative adversarial networks (GANs)-based data generation methods have been widely adopted to create synthetic electroencephalography (EEG) data, holds promise to address these issues. In this paper, we proposed a GAN-based end-to-end signal transformation network for data length extension, termed as TEGAN. TEGAN transforms short-length SSVEP signals into long-length artificial SSVEP signals. By incorporating a novel U-Net generator architecture and an auxiliary classifier into the network architecture, the TEGAN could produce conditioned features in the synthetic data. Additionally, we introduced a two-stage training strategy and the LeCam-divergence regularization term to regularize the training process of GAN during the network implementation. The proposed TEGAN was evaluated on two public SSVEP datasets (a 4-class dataset and a 12-class dataset). With the assistance of TEGAN, the performance of traditional frequency recognition methods and deep learning-based methods have been significantly improved under limited calibration data. And the classification performance gap of various frequency recognition methods has been narrowed. This study substantiates the feasibility of the proposed method to extend the data length for short-time SSVEP signals for developing a high-performance BCI system. The proposed GAN-based methods have the great potential of shortening the calibration time and cutting down the budget for various real-world BCI-based applications.",
        "creator": "Yudong Pan, Ning Li, Yangsong Zhang, Peng Xu, Dezhong Yao"
      },
      {
        "title": "Diversity Induced Environment Design via Self-Play.",
        "link": "http://arxiv.org/abs/2302.02119",
        "abstract": "Recent work on designing an appropriate distribution of environments has shown promise for training effective generally capable agents. Its success is partly because of a form of adaptive curriculum learning that generates environment instances (or levels) at the frontier of the agent's capabilities. However, such an environment design framework often struggles to find effective levels in challenging design spaces and requires costly interactions with the environment. In this paper, we aim to introduce diversity in the Unsupervised Environment Design (UED) framework. Specifically, we propose a task-agnostic method to identify observed/hidden states that are representative of a given level. The outcome of this method is then utilized to characterize the diversity between two levels, which as we show can be crucial to effective performance. In addition, to improve sampling efficiency, we incorporate the self-play technique that allows the environment generator to automatically generate environments that are of great benefit to the training agent. Quantitatively, our approach, Diversity-induced Environment Design via Self-Play (DivSP), shows compelling performance over existing methods.",
        "creator": "Dexun Li, Wenjun Li, Pradeep Varakantham"
      },
      {
        "title": "Learning Representations of Bi-level Knowledge Graphs for Reasoning beyond Link Prediction.",
        "link": "http://arxiv.org/abs/2302.02601",
        "abstract": "Knowledge graphs represent known facts using triplets. While existing knowledge graph embedding methods only consider the connections between entities, we propose considering the relationships between triplets. For example, let us consider two triplets $T_1$ and $T_2$ where $T_1$ is (Academy_Awards, Nominates, Avatar) and $T_2$ is (Avatar, Wins, Academy_Awards). Given these two base-level triplets, we see that $T_1$ is a prerequisite for $T_2$. In this paper, we define a higher-level triplet to represent a relationship between triplets, e.g., $\\langle T_1$, PrerequisiteFor, $T_2\\rangle$ where PrerequisiteFor is a higher-level relation. We define a bi-level knowledge graph that consists of the base-level and the higher-level triplets. We also propose a data augmentation strategy based on the random walks on the bi-level knowledge graph to augment plausible triplets. Our model called BiVE learns embeddings by taking into account the structures of the base-level and the higher-level triplets, with additional consideration of the augmented triplets. We propose two new tasks: triplet prediction and conditional link prediction. Given a triplet $T_1$ and a higher-level relation, the triplet prediction predicts a triplet that is likely to be connected to $T_1$ by the higher-level relation, e.g., $\\langle T_1$, PrerequisiteFor, ?$\\rangle$. The conditional link prediction predicts a missing entity in a triplet conditioned on another triplet, e.g., $\\langle T_1$, PrerequisiteFor, (Avatar, Wins, ?)$\\rangle$. Experimental results show that BiVE significantly outperforms all other methods in the two new tasks and the typical base-level link prediction in real-world bi-level knowledge graphs.",
        "creator": "Chanyoung Chung, Joyce Jiyoung Whang"
      },
      {
        "title": "Adap-$\\tau$: Adaptively Modulating Embedding Magnitude for Recommendation.",
        "link": "http://arxiv.org/abs/2302.04775",
        "abstract": "Recent years have witnessed the great successes of embedding-based methods in recommender systems. Despite their decent performance, we argue one potential limitation of these methods -- the embedding magnitude has not been explicitly modulated, which may aggravate popularity bias and training instability, hindering the model from making a good recommendation. It motivates us to leverage the embedding normalization in recommendation. By normalizing user/item embeddings to a specific value, we empirically observe impressive performance gains (9\\% on average) on four real-world datasets. Although encouraging, we also reveal a serious limitation when applying normalization in recommendation -- the performance is highly sensitive to the choice of the temperature $\\tau$ which controls the scale of the normalized embeddings.  To fully foster the merits of the normalization while circumvent its limitation, this work studied on how to adaptively set the proper $\\tau$. Towards this end, we first make a comprehensive analyses of $\\tau$ to fully understand its role on recommendation. We then accordingly develop an adaptive fine-grained strategy Adap-$\\tau$ for the temperature with satisfying four desirable properties including adaptivity, personalized, efficiency and model-agnostic. Extensive experiments have been conducted to validate the effectiveness of the proposal. The code is available at \\url{https://github.com/junkangwu/Adap_tau}.",
        "creator": "Jiawei Chen, Junkang Wu, Jiancan Wu, Sheng Zhou, Xuezhi Cao, Xiangnan He"
      },
      {
        "title": "GPT4MIA: Utilizing Generative Pre-trained Transformer (GPT-3) as A Plug-and-Play Transductive Model for Medical Image Analysis.",
        "link": "http://arxiv.org/abs/2302.08722",
        "abstract": "In this paper, we propose a novel approach (called GPT4MIA) that utilizes Generative Pre-trained Transformer (GPT) as a plug-and-play transductive inference tool for medical image analysis (MIA). We provide theoretical analysis on why a large pre-trained language model such as GPT-3 can be used as a plug-and-play transductive inference model for MIA. At the methodological level, we develop several technical treatments to improve the efficiency and effectiveness of GPT4MIA, including better prompt structure design, sample selection, and prompt ordering of representative samples/features. We present two concrete use cases (with workflow) of GPT4MIA: (1) detecting prediction errors and (2) improving prediction accuracy, working in conjecture with well-established vision-based models for image classification (e.g., ResNet). Experiments validate that our proposed method is effective for these two tasks. We further discuss the opportunities and challenges in utilizing Transformer-based large language models for broader MIA applications.",
        "creator": "Yizhe Zhang, Danny Z. Chen"
      },
      {
        "title": "Liveness score-based regression neural networks for face anti-spoofing.",
        "link": "http://arxiv.org/abs/2302.09461",
        "abstract": "Previous anti-spoofing methods have used either pseudo maps or user-defined labels, and the performance of each approach depends on the accuracy of the third party networks generating pseudo maps and the way in which the users define the labels. In this paper, we propose a liveness score-based regression network for overcoming the dependency on third party networks and users. First, we introduce a new labeling technique, called pseudo-discretized label encoding for generating discretized labels indicating the amount of information related to real images. Secondly, we suggest the expected liveness score based on a regression network for training the difference between the proposed supervision and the expected liveness score. Finally, extensive experiments were conducted on four face anti-spoofing benchmarks to verify our proposed method on both intra-and cross-dataset tests. The experimental results show our approach outperforms previous methods.",
        "creator": "Youngjun Kwak, Minyoung Jung, Hunjae Yoo, JinHo Shin, Changick Kim"
      },
      {
        "title": "MulGT: Multi-task Graph-Transformer with Task-aware Knowledge Injection and Domain Knowledge-driven Pooling for Whole Slide Image Analysis.",
        "link": "http://arxiv.org/abs/2302.10574",
        "abstract": "Whole slide image (WSI) has been widely used to assist automated diagnosis under the deep learning fields. However, most previous works only discuss the SINGLE task setting which is not aligned with real clinical setting, where pathologists often conduct multiple diagnosis tasks simultaneously. Also, it is commonly recognized that the multi-task learning paradigm can improve learning efficiency by exploiting commonalities and differences across multiple tasks. To this end, we present a novel multi-task framework (i.e., MulGT) for WSI analysis by the specially designed Graph-Transformer equipped with Task-aware Knowledge Injection and Domain Knowledge-driven Graph Pooling modules. Basically, with the Graph Neural Network and Transformer as the building commons, our framework is able to learn task-agnostic low-level local information as well as task-specific high-level global representation. Considering that different tasks in WSI analysis depend on different features and properties, we also design a novel Task-aware Knowledge Injection module to transfer the task-shared graph embedding into task-specific feature spaces to learn more accurate representation for different tasks. Further, we elaborately design a novel Domain Knowledge-driven Graph Pooling module for each task to improve both the accuracy and robustness of different tasks by leveraging different diagnosis patterns of multiple tasks. We evaluated our method on two public WSI datasets from TCGA projects, i.e., esophageal carcinoma and kidney carcinoma. Experimental results show that our method outperforms single-task counterparts and the state-of-theart methods on both tumor typing and staging tasks.",
        "creator": "Weiqin Zhao, Shujun Wang, Maximus Yeung, Tianye Niu, Lequan Yu"
      },
      {
        "title": "DNG: Taxonomy Expansion by Exploring the Intrinsic Directed Structure on Non-gaussian Space.",
        "link": "http://arxiv.org/abs/2302.11165",
        "abstract": "Taxonomy expansion is the process of incorporating a large number of additional nodes (i.e., \"queries\") into an existing taxonomy (i.e., \"seed\"), with the most important step being the selection of appropriate positions for each query. Enormous efforts have been made by exploring the seed's structure. However, existing approaches are deficient in their mining of structural information in two ways: poor modeling of the hierarchical semantics and failure to capture directionality of is-a relation. This paper seeks to address these issues by explicitly denoting each node as the combination of inherited feature (i.e., structural part) and incremental feature (i.e., supplementary part). Specifically, the inherited feature originates from \"parent\" nodes and is weighted by an inheritance factor. With this node representation, the hierarchy of semantics in taxonomies (i.e., the inheritance and accumulation of features from \"parent\" to \"child\") could be embodied. Additionally, based on this representation, the directionality of is-a relation could be easily translated into the irreversible inheritance of features. Inspired by the Darmois-Skitovich Theorem, we implement this irreversibility by a non-Gaussian constraint on the supplementary feature. A log-likelihood learning objective is further utilized to optimize the proposed model (dubbed DNG), whereby the required non-Gaussianity is also theoretically ensured. Extensive experimental results on two real-world datasets verify the superiority of DNG relative to several strong baselines.",
        "creator": "Songlin Zhai, Weiqing Wang, Yuanfang Li, Yuan Meng"
      },
      {
        "title": "Explainable AI does not provide the explanations end-users are asking for.",
        "link": "http://arxiv.org/abs/2302.11577",
        "abstract": "Explainable Artificial Intelligence (XAI) techniques are frequently required by users in many AI systems with the goal of understanding complex models, their associated predictions, and gaining trust. While suitable for some specific tasks during development, their adoption by organisations to enhance trust in machine learning systems has unintended consequences. In this paper we discuss XAI's limitations in deployment and conclude that transparency alongside with rigorous validation are better suited to gaining trust in AI systems.",
        "creator": "Savio Rozario, George &#x10c;evora"
      },
      {
        "title": "Vid2Seq: Large-Scale Pretraining of a Visual Language Model for Dense Video Captioning.",
        "link": "http://arxiv.org/abs/2302.14115",
        "abstract": "In this work, we introduce Vid2Seq, a multi-modal single-stage dense event captioning model pretrained on narrated videos which are readily-available at scale. The Vid2Seq architecture augments a language model with special time tokens, allowing it to seamlessly predict event boundaries and textual descriptions in the same output sequence. Such a unified model requires large-scale training data, which is not available in current annotated datasets. We show that it is possible to leverage unlabeled narrated videos for dense video captioning, by reformulating sentence boundaries of transcribed speech as pseudo event boundaries, and using the transcribed speech sentences as pseudo event captions. The resulting Vid2Seq model pretrained on the YT-Temporal-1B dataset improves the state of the art on a variety of dense video captioning benchmarks including YouCook2, ViTT and ActivityNet Captions. Vid2Seq also generalizes well to the tasks of video paragraph captioning and video clip captioning, and to few-shot settings. Our code is publicly available at https://antoyang.github.io/vid2seq.html.",
        "creator": "Antoine Yang, Arsha Nagrani, Paul Hongsuck Seo, Antoine Miech, Jordi Pont-Tuset, Ivan Laptev, Josef Sivic, Cordelia Schmid"
      },
      {
        "title": "Privacy-Preserving Tree-Based Inference with Fully Homomorphic Encryption.",
        "link": "http://arxiv.org/abs/2303.01254",
        "abstract": "Privacy enhancing technologies (PETs) have been proposed as a way to protect the privacy of data while still allowing for data analysis. In this work, we focus on Fully Homomorphic Encryption (FHE), a powerful tool that allows for arbitrary computations to be performed on encrypted data. FHE has received lots of attention in the past few years and has reached realistic execution times and correctness.  More precisely, we explain in this paper how we apply FHE to tree-based models and get state-of-the-art solutions over encrypted tabular data. We show that our method is applicable to a wide range of tree-based models, including decision trees, random forests, and gradient boosted trees, and has been implemented within the Concrete-ML library, which is open-source at https://github.com/zama-ai/concrete-ml. With a selected set of use-cases, we demonstrate that our FHE version is very close to the unprotected version in terms of accuracy.",
        "creator": "Jordan Frery, Andrei Stoian, Roman Bredehoft, Luis Montero, Celia Kherfallah, Benoit Chevallier-Mames, Arthur Meyre"
      },
      {
        "title": "QAID: Question Answering Inspired Few-shot Intent Detection.",
        "link": "http://arxiv.org/abs/2303.01593",
        "abstract": "Intent detection with semantically similar fine-grained intents is a challenging task. To address it, we reformulate intent detection as a question-answering retrieval task by treating utterances and intent names as questions and answers. To that end, we utilize a question-answering retrieval architecture and adopt a two stages training schema with batch contrastive loss. In the pre-training stage, we improve query representations through self-supervised training. Then, in the fine-tuning stage, we increase contextualized token-level similarity scores between queries and answers from the same intent. Our results on three few-shot intent detection benchmarks achieve state-of-the-art performance.",
        "creator": "Asaf Yehudai, Matan Vetzler, Yosi Mass, Koren Lazar, Doron Cohen, Boaz Carmeli"
      },
      {
        "title": "Policy Mirror Descent Inherently Explores Action Space.",
        "link": "http://arxiv.org/abs/2303.04386",
        "abstract": "Explicit exploration in the action space was assumed to be indispensable for online policy gradient methods to avoid a drastic degradation in sample complexity, for solving general reinforcement learning problems over finite state and action spaces. In this paper, we establish for the first time an $\\tilde{\\mathcal{O}}(1/\\epsilon^2)$ sample complexity for online policy gradient methods without incorporating any exploration strategies. The essential development consists of two new on-policy evaluation operators and a novel analysis of the stochastic policy mirror descent method (SPMD). SPMD with the first evaluation operator, called value-based estimation, tailors to the Kullback-Leibler divergence. Provided the Markov chains on the state space of generated policies are uniformly mixing with non-diminishing minimal visitation measure, an $\\tilde{\\mathcal{O}}(1/\\epsilon^2)$ sample complexity is obtained with a linear dependence on the size of the action space. SPMD with the second evaluation operator, namely truncated on-policy Monte Carlo (TOMC), attains an $\\tilde{\\mathcal{O}}(\\mathcal{H}_{\\mathcal{D}}/\\epsilon^2)$ sample complexity, where $\\mathcal{H}_{\\mathcal{D}}$ mildly depends on the effective horizon and the size of the action space with properly chosen Bregman divergence (e.g., Tsallis divergence). SPMD with TOMC also exhibits stronger convergence properties in that it controls the optimality gap with high probability rather than in expectation. In contrast to explicit exploration, these new policy gradient methods can prevent repeatedly committing to potentially high-risk actions when searching for optimal policies.",
        "creator": "Yan Li, Guanghui Lan"
      },
      {
        "title": "ChatGPT Is on the Horizon: Could a Large Language Model Be All We Need for Intelligent Transportation?.",
        "link": "http://arxiv.org/abs/2303.05382",
        "abstract": "ChatGPT, developed by OpenAI, is one of the milestone large language models (LLMs) with 6 billion parameters. ChatGPT has demonstrated the impressive language understanding capability of LLM, particularly in generating conversational response. As LLMs start to gain more attention in various research or engineering domains, it is time to envision how LLM may revolutionize the way we approach intelligent transportation systems. This paper explores the future applications of LLM in addressing key transportation problems. By leveraging LLM with cross-modal encoder, an intelligent system can also process traffic data from different modalities and execute transportation operations through an LLM. We present and validate these potential transportation applications equipped by LLM. To further demonstrate this potential, we also provide a concrete smartphone-based crash report auto-generation and analysis framework as a use case. Despite the potential benefits, challenges related to data privacy, data quality, and model bias must be considered. Overall, the use of LLM in intelligent transport systems holds promise for more efficient, intelligent, and sustainable transportation systems that further improve daily life around the world.",
        "creator": "Ou Zheng, Mohamed Abdel-Aty, Dongdong Wang, Zijin Wang, Shengxuan Ding"
      },
      {
        "title": "CVT-SLR: Contrastive Visual-Textual Transformation for Sign Language Recognition with Variational Alignment.",
        "link": "http://arxiv.org/abs/2303.05725",
        "abstract": "Sign language recognition (SLR) is a weakly supervised task that annotates sign videos as textual glosses. Recent studies show that insufficient training caused by the lack of large-scale available sign language datasets becomes the main bottleneck for SLR. The majority of SLR works thereby adopt pretrained visual modules and develop two mainstream solutions. The multi-stream architectures extend multi-cue visual features, yielding the current SOTA performances but requiring complex designs and might introduce potential noise. Alternatively, the advanced single-cue SLR frameworks using explicit cross-modal alignment between visual and textual modalities are simple and effective, potentially competitive with the multi-cue framework. In this work, we propose a novel contrastive visual-textual transformation for SLR, CVT-SLR, to fully explore the pretrained knowledge of both the visual and language modalities. Based on the single-cue cross-modal alignment framework, we propose a variational autoencoder (VAE) for pretrained contextual knowledge while introducing the complete pretrained language module. The VAE implicitly aligns visual and textual modalities while benefiting from pretrained contextual knowledge as the traditional contextual module. Meanwhile, a contrastive cross-modal alignment algorithm is proposed to further enhance the explicit consistency constraints. Extensive experiments conducted on the two most popular public datasets, PHOENIX-2014 and PHOENIX-2014T, demonstrate that our proposed SLR framework not only consistently outperforms existing single-cue methods but even outperforms SOTA multi-cue methods.",
        "creator": "Jiangbin Zheng, Yile Wang, Cheng Tan, Siyuan Li, Ge Wang, Jun Xia, Yidong Chen, Stan Z. Li"
      },
      {
        "title": "Why is That a Good or Not a Good Frying Pan? -- Knowledge Representation for Functions of Objects and Tools for Design Understanding, Improvement, and Generation.",
        "link": "http://arxiv.org/abs/2303.06152",
        "abstract": "The understanding of the functional aspects of objects and tools is of paramount importance in supporting an intelligent system in navigating around in the environment and interacting with various objects, structures, and systems, to help fulfil its goals. A detailed understanding of functionalities can also lead to design improvements and novel designs that would enhance the operations of AI and robotic systems on the one hand, and human lives on the other. This paper demonstrates how a particular object - in this case, a frying pan - and its participation in the processes it is designed to support - in this case, the frying process - can be represented in a general function representational language and framework, that can be used to flesh out the processes and functionalities involved, leading to a deep conceptual understanding with explainability of functionalities that allows the system to answer \"why\" questions - why is something a good frying pan, say, or why a certain part on the frying pan is designed in a certain way? Or, why is something not a good frying pan? This supports the re-design and improvement on design of objects, artifacts, and tools, as well as the potential for generating novel designs that are functionally accurate, usable, and satisfactory.",
        "creator": "Seng-Beng Ho"
      },
      {
        "title": "Fast exploration and learning of latent graphs with aliased observations.",
        "link": "http://arxiv.org/abs/2303.07397",
        "abstract": "Consider this scenario: an agent navigates a latent graph by performing actions that take it from one node to another. The chosen action determines the probability distribution over the next visited node. At each node, the agent receives an observation, but this observation is not unique, so it does not identify the node, making the problem aliased. The purpose of this work is to provide a policy that approximately maximizes exploration efficiency (i.e., how well the graph is recovered for a given exploration budget). In the unaliased case, we show improved performance w.r.t. state-of-the-art reinforcement learning baselines. For the aliased case we are not aware of suitable baselines and instead show faster recovery w.r.t. a random policy for a wide variety of topologies, and exponentially faster recovery than a random policy for challenging topologies. We dub the algorithm eFeX (from eFficient eXploration).",
        "creator": "Miguel Lazaro-Gredilla, Ishan Deshpande, Sivaramakrishnan Swaminathan, Meet Dave, Dileep George"
      },
      {
        "title": "WDiscOOD: Out-of-Distribution Detection via Whitened Linear Discriminative Analysis.",
        "link": "http://arxiv.org/abs/2303.07543",
        "abstract": "Deep neural networks are susceptible to generating overconfident yet erroneous predictions when presented with data beyond known concepts. This challenge underscores the importance of detecting out-of-distribution (OOD) samples in the open world. In this work, we propose a novel feature-space OOD detection score that jointly reasons with both class-specific and class-agnostic information. Specifically, our approach utilizes Whitened Linear Discriminative Analysis to project features into two subspaces - the discriminative and residual subspaces - in which the ID classes are maximally separated and closely clustered, respectively. The OOD score is then determined by combining the deviation from the input data to the ID distribution in both subspaces. The efficacy of our method, named WDiscOOD, is verified on the large-scale ImageNet-1k benchmark, with six OOD datasets that covers a variety of distribution shifts. WDiscOOD demonstrates superior performance on deep classifiers with diverse backbone architectures, including CNN and vision transformer. Furthermore, we also show that our method can more effectively detect novel concepts in representation space trained with contrastive objectives, including supervised contrastive loss and multi-modality contrastive loss.",
        "creator": "Yiye Chen, Yunzhi Lin, Ruinian Xu, Patricio A. Vela"
      },
      {
        "title": "Exploring the Relevance of Data Privacy-Enhancing Technologies for AI Governance Use Cases.",
        "link": "http://arxiv.org/abs/2303.08956",
        "abstract": "The development of privacy-enhancing technologies has made immense progress in reducing trade-offs between privacy and performance in data exchange and analysis. Similar tools for structured transparency could be useful for AI governance by offering capabilities such as external scrutiny, auditing, and source verification. It is useful to view these different AI governance objectives as a system of information flows in order to avoid partial solutions and significant gaps in governance, as there may be significant overlap in the software stacks needed for the AI governance use cases mentioned in this text. When viewing the system as a whole, the importance of interoperability between these different AI governance solutions becomes clear. Therefore, it is imminently important to look at these problems in AI governance as a system, before these standards, auditing procedures, software, and norms settle into place.",
        "creator": "Emma Bluemke, Tantum Collins, Ben Garfinkel, Andrew Trask"
      },
      {
        "title": "Commonsense Knowledge Assisted Deep Learning for Resource-constrained and Fine-grained Object Detection.",
        "link": "http://arxiv.org/abs/2303.09026",
        "abstract": "In this paper, we consider fine-grained image object detection in resource-constrained cases such as edge computing. Deep learning (DL), namely learning with deep neural networks (DNNs), has become the dominating approach to object detection. To achieve accurate fine-grained detection, one needs to employ a large enough DNN model and a vast amount of data annotations, which brings a challenge for using modern DL object detectors in resource-constrained cases. To this end, we propose an approach, which leverages commonsense knowledge to assist a coarse-grained object detector to get accurate fine-grained detection results. Specifically, we introduce a commonsense knowledge inference module (CKIM) to translate coarse-grained labels given by a backbone lightweight coarse-grained DL detector to fine-grained labels. We consider both crisp-rule and fuzzy-rule based inference in our CKIM; the latter is used to handle ambiguity in the target semantic labels. We implement our method based on several modern DL detectors, namely YOLOv4, Mobilenetv3-SSD and YOLOv7-tiny. Experiment results show that our approach outperforms benchmark detectors remarkably in terms of accuracy, model size and processing latency.",
        "creator": "Pu Zhang, Bin Liu"
      },
      {
        "title": "Maximum margin learning of t-SPNs for cell classification with filtered input.",
        "link": "http://arxiv.org/abs/2303.09065",
        "abstract": "An algorithm based on a deep probabilistic architecture referred to as a tree-structured sum-product network (t-SPN) is considered for cell classification. The t-SPN is constructed such that the unnormalized probability is represented as conditional probabilities of a subset of most similar cell classes. The constructed t-SPN architecture is learned by maximizing the margin, which is the difference in the conditional probability between the true and the most competitive false label. To enhance the generalization ability of the architecture, L2-regularization (REG) is considered along with the maximum margin (MM) criterion in the learning process. To highlight cell features, this paper investigates the effectiveness of two generic high-pass filters: ideal high-pass filtering and the Laplacian of Gaussian (LOG) filtering. On both HEp-2 and Feulgen benchmark datasets, the t-SPN architecture learned based on the max-margin criterion with regularization produced the highest accuracy rate compared to other state-of-the-art algorithms that include convolutional neural network (CNN) based algorithms. The ideal high-pass filter was more effective on the HEp-2 dataset, which is based on immunofluorescence staining, while the LOG was more effective on the Feulgen dataset, which is based on Feulgen staining.",
        "creator": "Haeyong Kang, Chang D. Yoo, Yongcheon Na"
      },
      {
        "title": "Topology optimization with physics-informed neural networks: application to noninvasive detection of hidden geometries.",
        "link": "http://arxiv.org/abs/2303.09280",
        "abstract": "Detecting hidden geometrical structures from surface measurements under electromagnetic, acoustic, or mechanical loading is the goal of noninvasive imaging techniques in medical and industrial applications. Solving the inverse problem can be challenging due to the unknown topology and geometry, the sparsity of the data, and the complexity of the physical laws. Physics-informed neural networks (PINNs) have shown promise as a simple-yet-powerful tool for problem inversion, but they have yet to be applied to general problems with a priori unknown topology. Here, we introduce a topology optimization framework based on PINNs that solves geometry detection problems without prior knowledge of the number or types of shapes. We allow for arbitrary solution topology by representing the geometry using a material density field that approaches binary values thanks to a novel eikonal regularization. We validate our framework by detecting the number, locations, and shapes of hidden voids and inclusions in linear and nonlinear elastic bodies using measurements of outer surface displacement from a single mechanical loading experiment. Our methodology opens a pathway for PINNs to solve various engineering problems targeting geometry optimization.",
        "creator": "Saviz Mowlavi, Ken Kamrin"
      },
      {
        "title": "Motion Planning for Autonomous Driving: The State of the Art and Perspectives.",
        "link": "http://arxiv.org/abs/2303.09824",
        "abstract": "Thanks to the augmented convenience, safety advantages, and potential commercial value, Intelligent vehicles (IVs) have attracted wide attention throughout the world. Although a few of autonomous driving unicorns assert that IVs will be commercially deployable by 2025, their implementation is still restricted to small-scale validation due to various issues, among which precise computation of control commands or trajectories by planning methods remains a prerequisite for IVs. This paper aims to review state-of-the-art planning methods, including pipeline planning and end-to-end planning methods. In terms of pipeline methods, a survey of selecting algorithms is provided along with a discussion of the expansion and optimization mechanisms, whereas in end-to-end methods, the training approaches and verification scenarios of driving tasks are points of concern. Experimental platforms are reviewed to facilitate readers in selecting suitable training and validation methods. Finally, the current challenges and future directions are discussed. The side-by-side comparison presented in this survey not only helps to gain insights into the strengths and limitations of the reviewed methods but also assists with system-level design choices.",
        "creator": "Siyu Teng, Xuemin Hu, Peng Deng, Bai Li, Yuchen Li, Zhe Xuanyuan, Dongsheng Yang, Yunfeng Ai, Lingxi Li, Long Chen, Fenghua Zhu"
      },
      {
        "title": "Multi-modal reward for visual relationships-based image captioning.",
        "link": "http://arxiv.org/abs/2303.10766",
        "abstract": "Deep neural networks have achieved promising results in automatic image captioning due to their effective representation learning and context-based content generation capabilities. As a prominent type of deep features used in many of the recent image captioning methods, the well-known bottomup features provide a detailed representation of different objects of the image in comparison with the feature maps directly extracted from the raw image. However, the lack of high-level semantic information about the relationships between these objects is an important drawback of bottom-up features, despite their expensive and resource-demanding extraction procedure. To take advantage of visual relationships in caption generation, this paper proposes a deep neural network architecture for image captioning based on fusing the visual relationships information extracted from an image's scene graph with the spatial feature maps of the image. A multi-modal reward function is then introduced for deep reinforcement learning of the proposed network using a combination of language and vision similarities in a common embedding space. The results of extensive experimentation on the MSCOCO dataset show the effectiveness of using visual relationships in the proposed captioning method. Moreover, the results clearly indicate that the proposed multi-modal reward in deep reinforcement learning leads to better model optimization, outperforming several state-of-the-art image captioning algorithms, while using light and easy to extract image features. A detailed experimental study of the components constituting the proposed method is also presented.",
        "creator": "Ali Abedi, Hossein Karshenas, Peyman Adibi"
      },
      {
        "title": "RN-Net: Reservoir Nodes-Enabled Neuromorphic Vision Sensing Network.",
        "link": "http://arxiv.org/abs/2303.10770",
        "abstract": "Event-based cameras are inspired by the sparse and asynchronous spike representation of the biological visual system. However, processing the even data requires either using expensive feature descriptors to transform spikes into frames, or using spiking neural networks that are difficult to train. In this work, we propose a neural network architecture based on simple convolution layers integrated with dynamic temporal encoding reservoirs with low hardware and training costs. The Reservoir Nodes-enabled neuromorphic vision sensing Network (RN-Net) allows the network to efficiently process asynchronous temporal features, and achieves the highest accuracy of 99.2% for DVS128 Gesture reported to date, and one of the highest accuracy of 67.5% for DVS Lip dataset at a much smaller network size. By leveraging the internal dynamics of memristors, asynchronous temporal feature encoding can be implemented at very low hardware cost without preprocessing or dedicated memory and arithmetic units. The use of simple DNN blocks and backpropagation based training rules further reduces its implementation cost. Code will be publicly available.",
        "creator": "Sangmin Yoo, Eric Yeu-Jer Lee, Ziyu Wang, Xinxin Wang, Wei D. Lu"
      },
      {
        "title": "Rotating without Seeing: Towards In-hand Dexterity through Touch.",
        "link": "http://arxiv.org/abs/2303.10880",
        "abstract": "Tactile information plays a critical role in human dexterity. It reveals useful contact information that may not be inferred directly from vision. In fact, humans can even perform in-hand dexterous manipulation without using vision. Can we enable the same ability for the multi-finger robot hand? In this paper, we present Touch Dexterity, a new system that can perform in-hand object rotation using only touching without seeing the object. Instead of relying on precise tactile sensing in a small region, we introduce a new system design using dense binary force sensors (touch or no touch) overlaying one side of the whole robot hand (palm, finger links, fingertips). Such a design is low-cost, giving a larger coverage of the object, and minimizing the Sim2Real gap at the same time. We train an in-hand rotation policy using Reinforcement Learning on diverse objects in simulation. Relying on touch-only sensing, we can directly deploy the policy in a real robot hand and rotate novel objects that are not presented in training. Extensive ablations are performed on how tactile information help in-hand manipulation.Our project is available at https://touchdexterity.github.io.",
        "creator": "Zhao-Heng Yin, Binghao Huang, Yuzhe Qin, Qifeng Chen, Xiaolong Wang"
      }
    ]
  },
  {
    "name": "Plant Biology",
    "feed": [
      {
        "title": "Uncovering the Environmental Conditions Required for Phyllachora maydis Infection and Tar Spot Development on Corn in the United States for Use as Predictive Models for Future Epidemics",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.18.533264v1?rss=1",
        "abstract": "Phyllachora maydis is a fungal pathogen causing tar spot of corn (Zea mays L.), a new and emerging, yield-limiting disease in the United States. Since being first reported in Illinois and Indiana in 2015, P. maydis can now be found across much of the corn growing of the United States. Knowledge of the epidemiology of P. maydis is limited but could be useful in developing tar spot prediction tools. The research presented here aims to elucidate the environmental conditions necessary for the development of tar spot in the field and the creation of predictive models to anticipate future tar spot epidemics. Extended periods (30-day windowpanes) of moderate ambient temperature were most significant for explaining the development of tar spot. Shorter periods (14- to 21-day windowpanes) of moisture (relative humidity, dew point, number of hours with predicted leaf wetness) were negatively correlated with tar spot development. These weather variables were used to develop multiple logistic regression models, an ensembled model, and two machine learning models for the prediction of tar spot development. This work has improved the understanding of P. maydis epidemiology and provided the foundation for the development of a predictive tool for anticipating future tar spot epidemics.",
        "creator": "Webster, R. W., Nicolli, C., Allen, T. W., Bish, M. D., Bissonette, K., Check, J. C., Chilvers, M. I., Kleczewski, N., Mueller, B. D., Price, P. P., Paul, P., Robertson, A. E., Ross, T. J., Schmidt, C., Schmidt, R., Schmidt, T., Shim, S., Telenko, D. E. P., Wise, K., Smith, D. L."
      },
      {
        "title": "Seed Longevity is Controlled by Metacaspases",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.19.533321v1?rss=1",
        "abstract": "To survive extreme desiccation, seeds enter dormancy that can last millennia. This dormancy involves the accumulation of protective but structurally disordered storage proteins through unknown adjustments of proteolytic surveillance mechanisms. Mutation of all six types II metacaspases (MCAs)-II in the model plant Arabidopsis revealed their essential role in modulating these proteolytic mechanisms. MCA-II mutant seeds fail to properly target at the endoplasmic reticulum (ER) the AAA ATPase Cell Division Cycle 48 (CDC48) to dispose of misfolded proteins. MCA-IIs cleave a CDC48 adaptor, the ubiquitination regulatory X domain-containing (PUX) responsible for localizing CDC48 to the lipid droplets. When cleaved, CDC48-PUX is inactivated and allows a lipid droplet-to-ER shuttling of CDC48, an important step in the regulation of seeds' lifespan. In sum, we uncover antagonism between proteolytic pathways bestowing longevity.",
        "creator": "Liu, C., Hatzianestis, I. H., Pfirrmann, T., Reza, S. H., Minina, A. A., Moazzami, A., Stael, S., Gutierez-Beltran, E., Pitsili, E., Doermann, P., D Andrea, S., Gevaert, K., Romero-Campero, F., Ting, P., Nowack, M. K., Van Breusegem, F., Jones, J. D., Bozhkov, P. V., Moschou, P. N."
      },
      {
        "title": "The genetic and physiological basis of\tArabidopsis thaliana tolerance to Pseudomonas viridiflava",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.18.533268v1?rss=1",
        "abstract": "O_LIThe opportunistic pathogen Pseudomonas viridiflava colonizes more than fifty agricultural crop species and is the most common Pseudomonas in the phyllosphere of European Arabidopsis thaliana populations. Belonging to the P. syringae complex, it is genetically and phenotypically distinct from well-characterized P. syringae sensu stricto. Despite its prevalence, we lack knowledge of how A. thaliana responds to its native isolates at the molecular level. Here, we characterize the host response in an A. thaliana - P. viridiflava pathosystem. C_LIO_LIWe measured host and pathogen growth in axenic infections, and used immune mutants, transcriptomics, and metabolomics to determine defense pathways influencing susceptibility to P. viridiflava infection. C_LIO_LIInfection with P. viridiflava increased jasmonic acid (JA) levels and the expression of ethylene defense pathway marker genes. The immune response in a susceptible host accession was delayed compared to a tolerant one. Mechanical injury rescued susceptibility, consistent with an involvement of JA. C_LIO_LIThe JA/ethylene pathway is important for suppression of P. viridiflava, yet suppression capacity varies between accessions. Our results shed light on how A. thaliana can suppress the ever-present P. viridiflava, but further studies are needed to understand how P. viridiflava evades this suppression to spread broadly across A. thaliana populations. C_LI",
        "creator": "Duque-Jaramillo, A., Ulmer, N., Alseekh, S., Bezrukov, I., Fernie, A. R., Skirycz, A., Karasov, T. L., Weigel, D."
      },
      {
        "title": "A Tyrosine Phospho-switch within the Longin Domain of VAMP721 modulates SNARE functionality",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.18.533296v1?rss=1",
        "abstract": "The final step in secretion is membrane fusion facilitated by SNARE proteins that reside in opposite membranes. The formation of a trans-SNARE complex between one R and three Q coiled-coiled SNARE domains drives the final approach of the membranes providing the mechanical energy for fusion. Biological control of this mechanism is exerted by additional domains within some SNAREs. For example, the N-terminal Longin domain (LD) of R-SNAREs (also called Vesicle-associated membrane proteins, VAMPs) can fold back onto the SNARE domain blocking interaction with other cognate SNAREs. The LD may also determine the subcellular localization via interaction with other trafficking related proteins. Here, we provide cell-biological and genetic evidence that phosphorylation of the Tyrosine57 residue regulates the functionality of VAMP721. We found that an aspartate mutation mimics phosphorylation, leading to protein instability and subsequent degradation in lytic vacuoles. The mutant SNARE also fails to rescue the defects of vamp721vamp722 loss-of-function lines in spite of its wildtype-like localization within the secretory pathway and the ability to interact with cognate SNARE partners. Most importantly, it imposes a dominant negative phenotype interfering with root growth, normal secretion and cytokinesis in wildtype plants generating large aggregates that mainly contain secretory vesicles. Non-phosphorylatable VAMP721Y57F needs higher gene dosage to rescue double mutants in comparison to native VAMP721 underpinning that phosphorylation modulates SNARE function. We propose a model where a short-lived phosphorylation of Y57 serves as a regulatory step to control VAMP721 activity, favouring its open state and interaction with cognate partners to ultimately drive membrane fusion.",
        "creator": "Ricardi, M. M., Wallmeroth, N., Cermesoni, C., Mehlhorn, D. G., Richter, S., Zhang, L., Mittendorf, J., Godehardt, I., Berendzen, K. W., von Roepenack-Lahaye, E., Stierhof, Y. D., Lipka, V., Juergens, G., Grefen, C."
      },
      {
        "title": "Cell type-specific control of secondary cell wall formation by Musashi-type translational regulators in Arabidopsis",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.20.532888v1?rss=1",
        "abstract": "Deciphering the mechanism of secondary cell wall/SCW formation in plants is key to understanding their development and the molecular basis of biomass recalcitrance. Although transcriptional regulation is essential for SCW formation, little is known about the implication of post-transcriptional mechanisms in this process. Here we report that two bonafide RNA-binding proteins homologous to the animal translational regulator Musashi, MSIL2 and MSIL4, function redundantly to control SCW formation in Arabidopsis. MSIL2/4 interactomes are similar and enriched in proteins involved in mRNA binding and translational regulation. MSIL2/4 mutations alter SCW formation in the fibers, leading to a reduction in lignin deposition, and an increase of 4-O- glucuronoxylan methylation. In accordance, quantitative proteomics of stems reveal an overaccumulation of glucuronoxylan biosynthetic machinery, including GXM3, in the msil2/4 mutant stem. We showed that MSIL4 immunoprecipitates GXM mRNAs, suggesting a novel aspect of SCW regulation, linking translational control to the regulation of SCW biosynthesis genes.",
        "creator": "Kairouani, A., Pontier, D., Picart, C., Mounet, F., Martinez, Y., Le-Bot, L., Fanuel, M., Hammann, P., Belmudes, L., Merret, R., Azevedo, J., Carpentier, M.-C., Gagliardi, D., Coute, Y., Sibout, R., Bies-Etheve, N., LAGRANGE, T."
      },
      {
        "title": "Molecular understanding of anthocyanin biosynthesis activated by PAP1 in engineered red Artemisia annua cells and regulation of 2, 4-dichlorophenoxyacetic acid",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.17.533196v1?rss=1",
        "abstract": "Artemisia annua is an effective antimalarial medicinal crop. We have established anthocyanin-producing red cell cultures from this plant with the overexpression of Production of Anthocyanin Pigment 1 (PAP1) encoding a R2R3MYB transcription factor. To understand the molecular mechanism by which PAP1 activated the entire anthocyanin pathway, we mined the genomic sequences of A. annua and obtained eight promoters of the anthocyanin pathway genes. Sequence analysis identified four types of AC cis-elements from six promoters, the MYB response elements (MRE) bound by PAP1. In addition, six promoters were determined to have at least one G-Box cis-element. Eight promoters were cloned for activity analysis. Duel luciferase assays showed that PAP1 significantly enhanced the promoting activity of seven promoters, indicating that PAP1 turned on the biosynthesis of anthocyanins via the activation of these pathway gene expression. To understand how 2,4-dichlorophenoxyacetic acid (2,4-D), an auxin, regulates the PAP1-activated anthocyanin biosynthesis, five different concentrations (0, 0.05, 0.5, 2.5, and 5 M) were tested to characterize anthocyanin production and profiles. The resulting data showed that the concentrations tested decreased the fresh weight of callus growth, anthocyanin levels, and the production of anthocyanins per petri dish. HPLC-qTOF-MS/MS based profiling showed that these concentrations did not alter anthocyanin profiles. Real time RT-PCR was completed to characterize the expression PAP1 and four representative pathway genes. The results showed that the five concentrations reduced the expression levels of the constitutive PAP1 transgene and three pathway genes significantly and eliminated chalcone synthase gene in expression either significantly or slightly. These data indicate that the constitutive PAP1 expression depends on gradients added in the medium. Based on these findings, the regulation of 2,4-D is discussed for anthocyanin engineering in red cells of A. annua.  ConclusionPromoters of eight anthocyanin pathway genes were cloned. Four types of AC cis-elements were identified from six promoters and G-Box elements were also determined from six promoters. PAP1 enhanced the activity of eight promoters. 2,4-D downregulated the expression of the constitutive PAP1 transgene leading to the decrease the biosynthesis of anthocyanins.",
        "creator": "Dong, Y., Li, M., Cruz, B., Ye, E., Zhu, Y., Li, L., Xu, Z., Xie, D.-Y."
      },
      {
        "title": "The aerial epidermis is a major site of quinolizidine alkaloid biosynthesis in narrow-leafed lupin",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.20.532575v1?rss=1",
        "abstract": "Lupins are promising legume crops that accumulate toxic alkaloids in the seeds, complicating their use as high-protein crops. The alkaloids are synthesized in green organs (leaves, stems, and pods) and a subset of them is transported to the seeds during fruit development. The exact sites of biosynthesis and accumulation remain unknown, however mesophyll cells have been proposed as sources, and epidermal cells have been suggested as sinks. We examined the spatial localization of the alkaloids in biosynthetic organs of narrow-leafed lupin using mass spectrometry-based imaging (MSI). The alkaloids that accumulate in seeds (\"core\" alkaloids) were evenly distributed across tissues, however their esterified versions accumulated primarily in the epidermis. In addition, we generated a tissue-specific RNAseq dataset of biosynthetic organs using laser-capture microdissection. The dataset revealed that alkaloid biosynthetic genes are strongly expressed in the epidermis. To confirm the biosynthetic capacity of the leaf epidermis, we combined precursor feeding studies with mass spectrometry imaging, which showed that the lower epidermis is highly biosynthetic. Our work challenges the current assumptions on the precise sites of lupin alkaloid biosynthesis, with direct implications for the elucidation of the alkaloid biosynthesis pathway and the long-distance transport network from source to seed.",
        "creator": "Frick, K. M., Lorensen, M. D. B. B., Esteban, E., Pasha, A., Schulz, A., Provart, N. J., Janfelt, C., Nour-Eldin, H. H., Geu-Flores, F."
      },
      {
        "title": "Protein Phosphorylation Orchestrates Acclimations of Arabidopsis Plants to Environmental pH",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.19.533375v1?rss=1",
        "abstract": "Environment pH (pHe) is a key parameter that dictates a surfeit of conditions critical to plant survival and fitness. To elucidate the mechanisms that recalibrate cytoplasmic and apoplastic pH homeostasis, we conducted a comprehensive proteomic/phosphoproteomic inventory of plants subjected to transient exposure to acidic or alkaline pH, an approach that covered the majority of protein-coding genes of the model plant Arabidopsis thaliana. Our survey revealed a large set so far undocumented pHe-dependent and potentially pH-specific phospho-sites, indicative of extensive post-translational regulation of proteins involved in the acclimation to pHe. Changes in pHe altered both electrogenic H+ pumping via P-type ATPases and H+/anion co-transport processes, leading to massively altered net trans-plasma membrane translocation of H+ ions. In pH 7.5 plants, transport (but not the assimilation) of nitrogen via NRT2-type nitrate and AMT1- type ammonium transporters was induced, conceivably to increase the cytosolic H+ concentration. Exposure to acidic pH resulted in a marked repression of primary root elongation. No such cessation was observed in nrt2.1 mutants, suggesting a role of NRT2.1 in negatively regulating root growth in response to acidic pH. Sequestration of iron into the vacuole via phosphorylation and abundance of the vacuolar iron transporter VTL5 was inversely regulated in response to high and low pHe, presumptively in anticipation of changes in iron availability associated with alterations of pHe in the soil. A pH-dependent  phospho-switch was also observed for the ABC transporter PDR7, suggesting changes in activity and, possibly, substrate specificity. Unexpectedly, the effect of pHe was not restricted to roots and provoked pronounced changes in the leaf proteome. In both roots and shoots, the plant-specific TPLATE complex components AtEH1 and AtEH2 - essential for clathrin-mediated endocytosis - were differentially phosphorylated at multiple sites in response to pHe, indicating that the endocytic cargo protein trafficking is orchestrated by pHe.",
        "creator": "Jain, D., Schmidt, W."
      },
      {
        "title": "WALLFLOWER, a RLK, simultaneously localizes to opposite sides of root hair cells & functions to position hairs",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.16.533027v1?rss=1",
        "abstract": "Polarized cells are frequently partitioned into subdomains with unique features or functions. As plant cells are surrounded by walls, polarized cell shape and protein polarity in the plasma membrane are particularly important for normal physiology and development. We have identified WALLFLOWER (WFL), a transmembrane receptor kinase that is asymmetrically distributed at the inner face of epidermal cells and this localization is maintained independent of cell type. In epidermal hair (H) cells in the elongation and differentiation zones, WFL exhibits a dual polar localization, accumulating at the inner domain as well as at the root hair initiation domain (RHID). Furthermore, overexpression of WFL leads to a downward shift in root hair (RH) position suggesting WFL operates in a signaling pathway that functions across H cells to inform RH position. WFL asymmetric distribution and function is affected by deletion of the intracellular domains resulting in its mislocalization to the outer polar domain of H cells and exclusion from RHIDs and bulges. Thus, our results demonstrate that in epidermal H cells the WFL intracellular domains are required to direct its dual polar localization and influence RH position.  ONE SENTENCE SUMMARYA receptor kinase with dual polar localization, to the inner polar domain and root hair initiation domain, in root epidermal cells, requires its intracellular domain for localization and function.",
        "creator": "Toth, J. N., Rodriguez-Furlan, C., Van Norman, J. M."
      },
      {
        "title": "Draft genome assembly of the ancient tetraploid orphan legume marama bean (Tylosema esculentum) with PacBio HiFi data",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.16.532621v1?rss=1",
        "abstract": "Tylosema esculentum (marama bean), an underutilized orphan legume, has long been considered to have the potential to be domesticated as a crop to improve local food security due to the nutrient-rich seeds. As a plant species that grows naturally in the deserts of southern Africa, marama also serves as a good model for studying plant adaptation to extreme environments. In this study, HMW leaf DNA samples were prepared to generate 21.6 Gb PacBio HiFi data, which was assembled into to a raw tetraploid genome assembly of 1.24 Gb using Canu and into a partially phased assembly of 564.8 Mb by Hifiasm. The N50 values were 1.28 Mb and 2.75 Mb, respectively, and the BUSCO completeness were all above 99%. Repeats were found to account for 27.35% of the genome. The k-mer analysis indicated that marama was likely to be an autotetraploid plant with an estimated haplotype genome size of only 277 Mb. The current assembly was aligned with the genome of Bauhinia variegata, the closest species to marama whose genome has been sequenced, with an overall alignment rate of only 20.36% indicating a significant divergence between the two. This is the first high-quality genome assembly of marama bean, albeit unphased and still fragmented. However, some of the long contigs, which can be close to half the chromosome length, can serve as good references for studying the genes underlying the traits of interest. This will greatly facilitate the molecular breeding of the bean.",
        "creator": "Li, J., Cullis, C."
      },
      {
        "title": "A Machine Learning approach to study plant functional trait divergence",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.16.533012v1?rss=1",
        "abstract": "Premise of the studyPlant functional traits are often used to describe spectra of ecological strategies among species. Here we demonstrate a machine learning approach for identifying the traits that contribute most to interspecific phenotypic divergence in multivariate trait space.  MethodsDescriptive and predictive machine learning approaches were applied to trait data for the genus Helianthus, including Random Forest and Gradient Boosting Machine classifiers, Recursive Feature Elimination, and the Boruta algorithm. These approaches were applied at the genus level as well as within each of the three major clades within the genus to examine the variability in major axes of trait divergence in three independent species radiations.  Key ResultsMachine learning models were able to predict species identity from functional traits with high accuracy, and differences in functional trait importance were observed between the genus level and clade levels indicating different axes of phenotypic divergence.  ConclusionsApplying machine-learning approaches to identify divergent traits can provide insights into the predictability or repeatability of evolution through comparison of parallel diversification of clades within a genus. These approaches can be implemented in a range of contexts across basic and applied plant science from interspecific divergence to intraspecific variation across time, space, and environmental conditions.",
        "creator": "Majumder, S., Mason, C. M."
      },
      {
        "title": "Increased drought resistance in state transition mutants is linked to modified plastoquinone pool redox state",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.17.533090v1?rss=1",
        "abstract": "Identifying traits that exhibit improved drought resistance is highly important to cope with the challenges of predicted climate change. We investigated the response of state transition mutants to drought. Compared with the wild type, state transition mutants were less affected by drought. Photosynthetic parameters in leaves probed by chlorophyll fluorescence confirmed that mutants possess a more reduced plastoquinone (PQ) pool, as expected due to the absence of state transitions. Seedlings of the mutants showed an enhanced growth of the primary root and more lateral root formation. The photosystem II inhibitor 3-(3,4-dichlorophenyl)-1,1-dimethylurea, leading to an oxidized PQ pool, inhibited primary root growth in wild type and mutants, while the cytochrome b6f complex inhibitor 2,5-dibromo-3-methyl-6-isopropylbenzoquinone, leading to a reduced PQ pool, stimulated root growth. A more reduced state of the PQ pool was associated with a slight but significant increase in singlet oxygen production. Singlet oxygen may trigger a, yet unknown, signaling cascade promoting root growth. We propose that photosynthetic mutants with a deregulated ratio of photosystem II to photosystem I activity can provide a novel path for improving crop drought resistance.  Summary StatementArabidopsis thaliana mutants affected in state transitions are more drought resistant.",
        "creator": "LEVERNE, L., Roach, T., perreau, F., Maignan, F., Liszkay, A."
      },
      {
        "title": "NAC1 directs CEP1-CEP3 peptidase expression and decreases cell wall extensins linked to root hair growth in Arabidopsis",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.15.532802v1?rss=1",
        "abstract": "Plant genomes encode a unique group of papain-type Cysteine EndoPeptidases (CysEPs) containing a KDEL endoplasmic reticulum (ER) retention signal (KDEL-CysEPs or CEPs). CEPs process the cell-wall scaffolding EXTENSIN proteins (EXTs), which regulate de novo cell wall formation and cell expansion. Since CEPs are able to cleave EXTs and EXT-related proteins, acting as cell wall-weakening agents, they may play a role in cell elongation. Arabidopsis thaliana genome encodes three CEPs (AtCPE1-AtCEP3). Here we report that the three Arabidopsis CEPs, AtCEP1-AtCEP, are highly expressed in root-hair cell files. Single mutants have no evident root-hair phenotype, but atcep1-3 atcep3-2 and atcep1-3 atcep2-2 double mutants have longer root hairs (RHs) than wild type (Wt) plants, suggesting that expression of AtCEPs in root trichoblasts restrains polar elongation of the RH. We provide evidence that the transcription factor NAC1 activates AtCEPs expression in roots to limit RH length. Chromatin immunoprecipitation indicates that NAC1 binds the promoter of AtCEP2 and may directly regulate its expression. Indeed, Inducible NAC1 overexpression increases AtCEP1 and AtCEP2 transcript levels in roots and leads to reduced RH growth while the loss of function nac1-2 mutation reduces AtCEP1-AtCEP3 gene expression and enhances RH growth. Likewise, expression of a dominant chimeric NAC1-SRDX repressor construct leads to increased RH length. Finally, we show that RH cell walls in the atcep1-1 atcep3-2 double mutant have reduced levels of EXT secretion/insolubilization, suggesting that the defects in RH elongation are linked to alterations in EXT processing and accumulation. Taken together, our results support the involvement of the NAC1-AtCEP regulatory module in controlling RH polar growth through EXT processing and insolubilization at the cell wall.",
        "creator": "Rodriguez-Garcia, D. R., Marzol, E., Rondon Guerrero, Y. d. C., Ferrero, L. V., Rossi, A. H., Miglietta, E. A., Aptekmann, A. A., Martinez Pacheco, J., Carignani, M., Berdion Gabarain, V., Lopez, L. E., Diaz Dominguez, G., Sanchez-Serrano, J. J., Xu, L., Nadra, A. D., Ariel, F. D., Rojo, E., Estevez, J."
      },
      {
        "title": "Polygenic pathogen networks control of host and pathogen transcriptional plasticity in the Arabidopsis-Botrytis pathosystem",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.16.533032v1?rss=1",
        "abstract": "Bidirectional flow of information shapes the outcome of the host-pathogen interactions and depends on the genetics of each organism. Recent work has begun to use co-transcriptomic studies to shed light on this bidirectional flow, but it is unclear how plastic the co-transcriptome is in response to genetic variation in both the host and pathogen. To study co-transcriptome plasticity, we conducted transcriptomics using natural genetic variation in the pathogen, Botrytis cinerea, and large effect genetic variation abolishing defense signaling pathways within the host, Arabidopsis thaliana. We show that genetic variation in the pathogen has a greater influence on the co-transcriptome than mutations that abolish defense signaling pathways in the host. Genome wide association mapping using the pathogens genetic variation and both organisms transcriptomes allowed an assessment of how the pathogen modulates plasticity in response to the host. This showed that the differences in both organisms responses were linked to trans-eQTL hotspots within the pathogens genome. These hotspots control gene sets in either the host or pathogen and show differential allele sensitivity to the hosts genetic variation rather than qualitative host specificity. Interestingly, nearly all the trans-eQTL hotspots were unique to the host or pathogen transcriptomes. In this system of differential plasticity, the pathogen mediates the shift in the co-transcriptome more than the host.",
        "creator": "Krishnan, P., Caseys, C., Soltis, N., Zhang, W., Burow, M. E., Kliebenstein, D. J."
      },
      {
        "title": "Root system growth and function response to soil temperature in maize (Zea mays L.)",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.15.532822v1?rss=1",
        "abstract": "Crop adaptation to the mixture of environments that defines the target population of environments is the result from a balanced resource allocation between roots, shoots and reproductive organs. Root growth places a critical role in the determination of this balance. Root growth and function responses to temperature can determine the strength of roots as sinks but also influence the crops ability to uptake water and nutrients. Surprisingly, this behavior has not been studied in maize since the middle of the last century, and the genetic determinants are unknown. Low temperatures often recorded in deep soil layers limit root growth and soil exploration and may constitute a bottleneck towards increasing drought tolerance, nitrogen recovery, sequestration of carbon and productivity in maize. High throughput phenotyping (HTP) systems were developed to investigate these responses and to examine genetic variability therein across diverse maize germplasm. Here we show that there is: 1) genetic variation of root growth under low temperature and below 10{degrees}C, and 2) genotypic variation in water transport under low temperature. Using simulation, we demonstrate that the measured variation for both traits contribute to drought tolerance and explain important components of yield variation in the US corn-belt. The trait set examined herein and HTP platform developed for its characterization reveal a unique opportunity to remove a major bottleneck for crop improvement, and adaptation to climate change.",
        "creator": "Clark, R., Chamberlain, D., Diepenbrock, C. H., Cooper, M., Messina, C."
      },
      {
        "title": "Auxin coreceptor IAA17/AXR3 controls cell elongation in Arabidopsis thaliana root by modulation of auxin and gibberellin perception",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.15.532805v1?rss=1",
        "abstract": "The nuclear TIR1/AFB - Aux/IAA auxin pathway plays a crucial role in regulating plant growth and development. Specifically, the IAA17/AXR3 protein participates in root development, and the accumulation of its mutant variant, AXR3-1, which cannot bind auxin, leads to severe root growth phenotype and agravitropism. However, the mechanism by which AXR3 regulates cell elongation is not fully understood. Here we show that the inducible expression of AXR3-1 in the Arabidopsis thaliana root triggers excessive cell elongation that is followed by growth arrest of the root. We exploited this effect to reveal the underlying molecular mechanism of AXR3 action. We show that AXR3-1 acts exclusively in the nucleus where it interferes with the nuclear auxin transcriptional pathway, while the rapid cytoplasmic auxin root growth response is not affected. The analysis of the transcriptome of the induced AXR3-1 roots revealed changes in phytohormone perception and homeostasis. We show that the accumulation of AXR3-1 disturbs auxin homeostasis which leads to excessive auxin accumulation. At the same time, the reaction of the AXR3-1 roots to gibberellin is altered. These results show that the IAA17/AXR3 maintains an optimal cell elongation rate by controlling the auxin response, auxin homeostasis and the interplay with gibberellin signaling.",
        "creator": "Kubalova, M., Muller, K., Dobrev, P. I., Griffiths, J., Jones, A. M., Fendrych, M."
      },
      {
        "title": "Spiny but photogenic: amateur sightings complement herbarium specimens to reveal the bioregions of cacti",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.15.532806v1?rss=1",
        "abstract": "PremiseCacti are characteristic elements of the Neotropical flora and of major interest for biogeographic, evolutionary, and ecological studies. Here we test global biogeographic boundaries for Neotropical Cactaceae using specimen-based occurrences coupled with data from visual observations, including citizen science records, as a means to tackle the known collection biases in the family.  MethodsSpecies richness and record density were assessed separately for preserved specimens and human observations and a bioregional scheme tailored to Cactaceae was produced using the interactive web application Infomap Bioregions based on data from 261,272 point records cleaned through automated and manual steps.  Key ResultsWe find that areas in Mexico and southwestern USA, Eastern Brazil and along the Andean region have the greatest density of records and the highest species richness. Human observations complement information from preserved specimens substantially, especially along the Andes. We propose 24 cacti bioregions, among which the most species-rich are, in decreasing order: northern Mexico/southwestern USA, central Mexico, southern central Mexico, Central America, Mexican Pacific coast, central and southern Andes, northwestern Mexico/extreme southwestern USA, southwestern Bolivia, northeastern Brazil, Mexico/Baja California.  ConclusionsThe bioregionalization proposed shows novel or modified biogeographical boundaries specific to cacti, and can thereby aid further evolutionary, biogeographic, and ecological studies by providing a validated framework for further analyses. This classification builds upon, and is distinctive from, other expert-derived regionalization schemes for other taxa. Our results showcase how observation data, including citizen-science records, can complement traditional specimen-based data for biogeographic research, particularly for taxa with specific specimen collection and preservation challenges and those that are threatened or internationally protected.",
        "creator": "Calvente, A., Silva, A. P., Edler, D., Carvalho, F. A., Fantinati, M. R., Zizka, A., Antonelli, A."
      },
      {
        "title": "Duplicate transcription factors GT1 and VRS1 regulate branching and fertile flower number in maize and Brachypodium distachyon",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.15.532786v1?rss=1",
        "abstract": "Crop engineering and de novo domestication using genome editing are new frontiers in agriculture. However, outside of well-studied crops and model systems, prioritizing engineering targets remains challenging. Evolution can serve as our guide, revealing high-priority genes with deeply conserved roles. Indeed, GRASSY TILLERS1 (GT1), SIX-ROWED SPIKE1 (VRS1), and their homologs have repeatedly been targets of selection in domestication and evolution. This repeated selection may be because these genes have an ancient, conserved role in regulating growth repression. To test this, we determined the roles of GT1 and VRS1 homologs in maize (Zea mays) and the distantly related grass brachypodium (Brachypodium distachyon) using CRISPR-Cas9 gene editing and mutant analysis. GT1 and VRS1 have roles in floral development in maize and barley, respectively. Grass flowers are borne in branching structures called spikelets. In maize spikelets, carpels are suppressed in half of all initiated ear flowers. These spikelets can only produce single grains. We show that gt1; vrs1-like1 (vrl1) mutants have derepressed carpels in ear flowers. Importantly, these plants can produce two grains per spikelet. In brachypodium, bdgt1; bdvrl1 mutants have more branches, spikelets, and flowers than wildtype plants, indicating conserved roles for GT1 and VRS1 homologs in growth suppression. Indeed, maize GT1 can suppress growth in Arabidopsis thaliana, separated from the grasses by ca. 160 million years of evolution. Thus, GT1 and VRS1 maintain their potency as growth regulators across vast timescales and in distinct developmental contexts. Modulating the activity of these and other conserved genes may be critical in crop engineering.",
        "creator": "Gallagher, J. P., Man, J., Chiaramida, A., Rozza, I., Patterson, E. L., Powell, M. M., Schrager-Lavelle, A., Multani, D. S., Meeley, R. B., Bartlett, M. E."
      },
      {
        "title": "The Ralstonia pseudosolanacearum effector RipE1 is recognized at the plasma membrane by NbPtr1, Nicotiana benthamiana homolog of Pseudomonas tomato race 1.",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.14.532688v1?rss=1",
        "abstract": "The bacterial wilt disease caused by soil-borne bacteria of the Ralstonia solanacearum species complex (RSSC) threatens important crops worldwide. Only a few immune receptors conferring resistance to this devastating disease are known so far. Individual RSSC strains deliver around 70 different type III secretion system effectors into host cells to manipulate the plant physiology and dampen immune responses. RipE1 is an effector conserved across RSSC isolated from diverse plant species and triggers immune responses in the model Solanaceae Nicotiana benthamiana. Here, we used multiplexed virus-induced gene silencing of the nucleotide-binding and leucine-rich repeat receptor family to identify the genetic basis of RipE1 recognition in N. benthamiana. Specific silencing of the N. benthamiana homolog of Solanum lycopersicoides Pseudomonas tomato race 1 gene (NbPtr1) completely abolished RipE1-induced hypersensitive response and immunity to Ralstonia pseudosolanacearum. In Nb-ptr1 knock-out plants, expression of the native NbPtr1 coding sequence was sufficient to restore RipE1 recognition. In addition to the putative catalytic triad Cys-His-Asp, RipE1 association with the host cell plasma membrane was found necessary for NbPtr1-dependent recognition. Furthermore, we found that NbPtr1-dependent recognition of RipE1 natural variants is polymorphic suggesting the coevolutionary nature of this interaction. This work hence provides an additional evidence for the indirect mode of activation of NbPtr1 and supports NbPtr1 relevance for resistance to bacterial wilt disease in Solanaceae.",
        "creator": "Kim, B., Kim, I., Yu, W., Kim, H., Ahn, Y. J., Sohn, K. H., Macho, A. P., Segonzac, C."
      },
      {
        "title": "A laser capture microdissection transcriptome of M. truncatula  roots responding to rhizobia reveals spatiotemporal tissue expression patterns of genes involved in nodule signaling and organogenesis",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.14.532650v1?rss=1",
        "abstract": "We report a public resource for examining the spatiotemporal RNA expression of 54,893 M. truncatula genes during the first 72 hours of response to rhizobial inoculation. Using a methodology that allows synchronous inoculation and growth of over 100 plants in a single media container, we harvested the same segment of each root responding to rhizobia in the initial inoculation over a time course, collected individual tissues from these segments with laser capture microdissection, and created and sequenced RNA libraries generated from these tissues. We demonstrate the utility of the resource by examining the expression patterns of a set of genes induced very early in nodule signaling, as well as two gene families (CLE peptides and nodule specific PLAT-domain proteins) and show that despite similar whole root expression patterns, there are tissue differences in expression between the genes. Using a rhizobial response data set generated from transcriptomics on intact root segments, we also examined differential temporal expression patterns and determined that, after nodule tissue, the epidermis and cortical cells contained the most temporally patterned genes. We circumscribed gene lists for each time and tissue examined and developed an expression pattern visualization tool. Finally, we explored transcriptomic differences between the inner cortical cells that become nodules and those that do not, confirming that the expression of ACC synthases distinguishes inner cortical cells that become nodules and provide and describe potential downstream genes involved in early nodule cell division.",
        "creator": "Schnabel, E., Thomas, J., El-Hawaz, R., Gao, Y., Poehlman, W., Chavan, S., Pasha, A., Esteban, E. N., Provart, N. J., Feltus, F. A., Frugoli, J."
      },
      {
        "title": "Glycome profiling and immunohistochemistry uncover spaceflight-induced changes in non-cellulosic cell wall components in Arabidopsis thaliana seedling roots",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.14.532448v1?rss=1",
        "abstract": "A large and diverse library of glycan-directed monoclonal antibodies (mAbs) was used to determine if plant cell walls are modified by low-gravity conditions encountered during spaceflight. This method called glycome profiling (glycomics) revealed global differences in non-cellulosic cell wall epitopes in Arabidopsis thaliana root extracts recovered from RNA purification columns between seedlings grown on the International Space Station-based Vegetable Production System and paired ground (1-g) controls. Immunohistochemistry on 11-day-old seedling primary root sections showed that ten of twenty-two mAbs that exhibited spaceflight-induced increases in binding through glycomics, labeled space-grown roots more intensely than those from the ground. The ten mAbs recognized xyloglucan, xylan, and arabinogalactan epitopes. Notably, three xylem-enriched unsubstituted xylan backbone epitopes were more intensely labeled in space-grown roots than in ground-grown roots, suggesting that the spaceflight environment accelerated root secondary cell wall formation. This study highlights the feasibility of glycomics for high-throughput evaluation of cell wall glycans using only root high alkaline extracts from RNA purification columns, and subsequent validation of these results by immunohistochemistry. This approach will benefit plant space biological studies because it extends the analyses possible from the limited amounts of samples returned from spaceflight and help uncover microgravity-induced tissue-specific changes in plant cell walls.",
        "creator": "Nakashima, J., Pattathil, S., Avci, U., Chin, S., Sparks, J. A., Hahn, M. G., Gilroy, S., Blancaflor, E. B."
      },
      {
        "title": "From root to shoot; Quantifying nematode tolerance in Arabidopsis thaliana by high-throughput phenotyping of plant development",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.15.532731v1?rss=1",
        "abstract": "Nematode migration, feeding site formation, withdrawal of plant assimilates, and activation of plant defence responses have a significant impact on plant growth and development. Plants display intraspecific variation in tolerance limits for root-feeding nematodes. Although disease tolerance has been recognised as a distinct trait in biotic interactions of mainly crops, we lack mechanistic insights. Progress is hampered by difficulties in quantification and laborious screening methods. We turned to the model plant Arabidopsis thaliana, since it offers extensive resources to study the molecular and cellular mechanisms underlying nematode-plant interactions. Through imaging of tolerance-related parameters the green canopy area was identified as an accessible and robust measure for assessing damage due to cyst nematode infection. Subsequently, a high-throughput phenotyping platform simultaneously measuring the green canopy area growth of 960 A. thaliana plants was developed. This platform can accurately measure cyst- and root-knot nematode tolerance limits in A. thaliana through classical modelling of tolerance limits. Furthermore, real-time monitoring provided data for a novel view of tolerance, identifying a compensatory growth response. These findings show that our phenotyping platform will enable further studies into a mechanistic understanding of tolerance to below-ground biotic stress.  HighlightThe mechanisms of tolerance to root-parasitic nematodes remain unknown. We developed a high-throughput phenotyping system that enables unravelling the underlying mechanisms of tolerance to nematodes.",
        "creator": "Willig, J.-J., Sonneveld, D., Steenbrugge, J. J. M., Deurhof, L., van Schaik, C. C., Teklu, M. G., Goverse, A., Lozano-Torres, J. L., Smant, G., Sterken, M. G."
      },
      {
        "title": "A bi-kinase module sensitizes and potentiates plant immune signaling",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.14.532616v1?rss=1",
        "abstract": "Systemic signaling is an essential hallmark of multicellular life. Pathogen encounter occurs locally but triggers organ-scale and organismic immune responses. In plants, elicitor perception provokes systemically expanding Ca2+ and H2O2 signals conferring immunity. Here, we identify a Ca2+ sensing bi-kinase module as becoming super-activated through mutual trans-phosphorylation and imposing synergistically enhanced NADPH oxidase activation. A combined two-layer bi-kinase/substrate phospho-code allows for sensitized signaling initiation already by near-resting elevations of Ca2+ concentration at the infection site. Subsequently, it facilitates further signal wave proliferation with minimal amplitude requirement, triggering protective defense responses throughout the plant. Our study reveals how plants build and perpetuate trans-cellular immune signal proliferation while avoiding disturbance of ongoing cellular signaling along the path of response dissemination.  One sentence summaryMutual trans-activation of a Ca2+ sensing bi-kinase module potentiates NADPH oxidase activation to facilitate systemic immunity.",
        "creator": "Koester, P., He, G., Dong, Q., Hake, K., Schmitz-Thom, I., Heinkow, P., Eirich, J., Wallrad, L., Hashimoto, K., Schueltke, S., Finkemeier, I., Romeis, T., Kudla, J."
      },
      {
        "title": "Asymmetric evolution of protein domains in the leucine-rich repeat receptor-like kinase (LRR-RLK) family of plant developmental coordinators",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.13.532436v1?rss=1",
        "abstract": "The coding sequences of developmental genes are expected to be conserved over deep time, with cis-regulatory change driving the modulation of gene function. In contrast, proteins with roles in defense are expected to evolve rapidly, in molecular arms-races with pathogens. However, some gene families include both developmental and defense genes. In these families, does the tempo and mode of evolution differ between developmental and defense genes, despite shared ancestry and structure? The leucine-rich repeat receptor-like kinase (LRR-RLKs) protein family includes many members with roles in plant development and defense, thus providing an ideal system for answering this question. LRR-RLKs are receptors that traverse plasma membranes. LRR domains bind extracellular ligands, RLK domains initiate intracellular signaling cascades in response to ligand binding. In LRR-RLKs with roles in defense, LRR domains evolve faster than RLK domains. To determine whether this asymmetry extends to developmental LRR-RLKs, we assessed evolutionary rates and tested for selection acting on eleven clades of LRR-RLK proteins, using deeply sampled protein trees. To assess functional evolution, we performed heterologous complementation assays using Arabidopsis thaliana (arabidopsis) LRR-RLK mutants. We found that the LRR domains of developmental LRR-RLK proteins evolved faster than their cognate RLK domains. LRR-RLKs with roles in development and defense had strikingly similar patterns of molecular evolution. Heterologous transformation experiments revealed that the evolution of developmental LRR-RLKs likely involves multiple mechanisms, including changes to cis-regulation, coding sequence evolution, and escape from adaptive conflict. Our results indicate similar evolutionary pressures acting on developmental and defense signaling proteins, despite divergent organismal functions. In addition, deep understanding of the molecular evolution of developmental receptors can help guide targeted genome engineering in agriculture.",
        "creator": "Man, J., Harrington, T., Lally, K., Bartlett, M. E."
      },
      {
        "title": "The maize PLASTID TERMINAL OXIDASE (PTOX) gene controls the carotenoid content of kernels.",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.13.532334v1?rss=1",
        "abstract": "O_LICarotenoids perform a broad range of important functions in humans; therefore, carotenoid biofortification of maize (Zea mays L.), one of the most highly produced cereal crops worldwide, would have a global impact on human health. C_LIO_LIPLASTID TERMINAL OXIDASE (PTOX) genes play an important role in carotenoid metabolism; however, the possible function of PTOX in carotenoid biosynthesis in maize has not yet been explored. In this study, we identified the maize PTOX gene ZmPTOX1 by forward genetic screening. C_LIO_LIWhile most higher plant species possess a single copy of the PTOX gene, maize carries two tandemly duplicated copies of ZmPTOX. Characterization of Zmptox1 mutants revealed that disrupting one copy of ZmPTOX1 was enough to impair carotenoid biosynthesis, indicating that ZmPTOX1 is essential for carotenoid biosynthesis in maize kernels. Remarkably, overexpression of ZmPTOX1 significantly improved the content of carotenoids, especially {beta}-carotene (provitamin A), which was increased by ~3-fold, in maize kernels. C_LIO_LIOverall, our study shows that ZmPTOX1 plays a crucial role in carotenoid biosynthesis in maize kernels and suggests that fine-tuning the expression of this gene could improve the nutritional value of cereal grains. C_LI",
        "creator": "Nie, Y., Wang, H., Zhang, G., Ding, H., Han, B., Liu, L., Shi, J., Du, J., Li, X., Li, X., Zhao, Y., Zhang, X., Liu, C., Weng, J., Li, X., Zhang, X., Zhao, X., Pan, G., Jackson, D., Wu, Q., Zhang, Z."
      },
      {
        "title": "More than a prickly morphology: plastome variation in the prickly pear cacti (Opuntieae)",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.13.532486v1?rss=1",
        "abstract": "Plastid genomes (plastomes) have long been recognized as highly conserved in their overall structure, size, gene arrangement and content among land plants. However, recent studies have shown that some lineages present unusual variations in some of these features. Members of the cactus family are one of these lineages, with distinct plastome structures reported across disparate lineages including gene losses, inversions, boundary movements, or loss of the canonical inverted repeat (IR) region. Here, we further investigated plastome features of the tribe Opuntieae, the remarkable prickly pear cacti, which represent a diverse and important lineage of Cactaceae. We assembled the plastome of 43 species, representing a comprehensive sampling of the tribe including all seven genera. Plastomes varied considerably in length from 121 kbp to 162 kbp, with striking differences in the content and size of the IR region (contraction and expansion events), including the lack of the canonical IR in some lineages, and the pseudogenization or loss of some genes. Overall, nine different types of plastomes were reported deviating in the presence of the IR region or the genes contained in the IR. Plastomes sequences resolved phylogenetic relationships within major clades of Opuntieae but presented some contentious nodes depending on the data set analyzed (e.g., whole plastome vs. genes only). Incongruence analyses revealed that few plastome regions are supporting the most likely topology, while disputing topologies are driven by a handful of plastome markers, which may be the result of hard recalcitrant nodes in the phylogeny or by the lack of phylogenetic signal in certain markers. Our study reveals a dynamic nature of plastome evolution across closely related lineages, shedding light on peculiar features of cactus plastomes. Variation of plastome types across Opuntieae is remarkable in size, structure, and content, and can be important for the recognition of species in some major clades. Unraveling connections between the causes of plastome variation and the consequences on species biology, ecology, diversification, and adaptation, is a promising endeavor.",
        "creator": "Kohler, M., Reginato, M., Jin, J.-J., Majure, L. C."
      },
      {
        "title": "Arabidopsis cell suspension culture and RNA sequencing reveal regulatory networks underlying plant programmed cell death.",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.14.532467v1?rss=1",
        "abstract": "Programmed cell death (PCD) facilitates targeted elimination of redundant, damaged, or infected cells via genetically controlled pathways. In plants, PCD is often an essential component of normal development and can also mediate responses to abiotic and biotic stress stimuli. However, studying the transcriptional regulation of this fundamental process is hindered by difficulties in sampling small groups of cells undergoing PCD that are often buried within the bulk of living plant tissue. We addressed this challenge by using RNA sequencing (RNA-Seq) of Arabidopsis thaliana suspension cells, a system that allows precise monitoring of PCD activation and progression. The use of three PCD-inducing treatments (salicylic acid, heat and critical dilution), in combination with three cell death modulators (3- methyladenine, lanthanum chloride and conditioned medium), allowed isolation of candidate  core and stimuli-specific PCD genes, inference of underlying gene regulatory networks and identification of putative transcriptional regulators. This analysis underscored cell cycle disturbance and the repression of both pro-survival stress responses and mitochondrial retrograde signalling as key elements of the PCD-associated transcriptional signature in plants. Further, phenotyping of twenty Arabidopsis T-DNA insertion mutants in selected candidate genes confirmed a role for several in PCD and stress tolerance regulation, and validated the potential of these generated resources to identify novel genes involved in plant PCD pathways and/or stress tolerance in plants.",
        "creator": "Burke, R., McCabe, A., Ramesh Sonawane, N., Hasmukh Rathod, M., Whelan, C. V., McCabe, P. F., Kacprzyk, J."
      },
      {
        "title": "The Arabidopsis thaliana carboxylesterase AtCXE12 converts volatile (Z)-3-hexenyl acetate to (Z)-3-hexenol",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.14.532512v1?rss=1",
        "abstract": "The green leaf volatiles (Z)-3-hexenal, (Z)-3-hexenol, and (Z)-3-hexenyl acetate are produced by nearly all plants in response to wounding and insect attack, can be transferred between plants, metabolized, and act as defense cues. If and how plant leaves convert exogenous (Z)-3-hexenyl acetate to (Z)-3-hexenol is unknown. We show that Arabidopsis leaves rapidly convert exogenous (Z)-3-hexenyl acetate to (Z)-3-hexenol. Inhibitor and fractionation experiments identified the carboxylesterases AtCXE5 and AtCXE12 as likely contributors to (Z)-3-hexenyl acetate esterase activity in Arabidopsis leaves. Heterologous expression of AtCXE5 and AtCXE12 revealed that both enzymes hydrolyze (Z)-3-hexenyl acetate to (Z)-3-hexenol in vitro, and assays using T-DNA insertion mutant plants showed that AtCXE12 significantly contributes to the conversion of (Z)-3-hexenyl acetate to (Z)-3-hexenol in planta. Lastly, we found that leaves from several other plant species possess (Z)-3-hexenyl acetate esterase activity, as well as homologs of AtCXE5 and AtCXE12 from Arabidopsis. Collectively, our study provides a better understanding of green leaf volatile biosynthesis and conversion dynamics, necessary for unraveling the potential functions of these compounds.",
        "creator": "Cofer, T. M., Erb, M., Tumlinson, J. H."
      },
      {
        "title": "Single-cell transcriptional profiling in Arabidopsis root exposed to B toxicity at seedling stages",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.09.531923v1?rss=1",
        "abstract": "Cell-specific transcriptional responses to environmental stimuli are yet to be fully characterized in plants. In this study, we apply single-cell RNA sequencing to Arabidopsis thaliana roots exposed to boron (B) toxicity to characterize the transcription map at cellular resolution and thus, to understand how B toxicity can alter gene expression and development at single cell resolution. Single-cell transcriptomes from protoplasts of more than 2750 Arabidopsis thaliana root cells were obtained. Plotting the single-cell transcriptomes via t-SNE projections yielded six major cell clusters including quiescent cells (QC), endodermis, cortex, columella, trichoblast (root-hair), and root cap. The maximum number of most significantly upregulated genes were determined in columella under 1 mM B and in endodermis under 2 mM B condition. Additionally, the maximum number of most significantly upregulated genes under 3 mM B and 5 mM B conditions was determined in the root cap, implying a critical role against severe B toxicity conditions. We also showed that these upregulated genes are highly correlated with \"glutathione metabolism\" in columella and \"carbon metabolism\" in root cap. Taken together, for the first time in the literature, our study provides a gene expression map at single-cell resolution and describes the extent of heterogeneity at the molecular level among populations of different cell types in Arabidopsis root under B toxicity conditions.",
        "creator": "Yilmaz, H., kayihan, C., Unal, H. B., Yaprak, O., Aksoy, E."
      },
      {
        "title": "Alleviating the barrier of adventitious roots formation in recalcitrant mature tissue by slow release of a synthetic auxin",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.13.532257v1?rss=1",
        "abstract": "Clonal propagation of plants by induction of adventitious roots (ARs) from stem cuttings is a requisite step in breeding programs. Nevertheless, a major barrier exists for propagating valuable plants that naturally have low capacity to form ARs. Due to the central role of auxin in organogenesis, indole-3-butyric acid (IBA) is often utilized, yet many recalcitrant plants do not form ARs in response to such treatment. We describe the synthesis and screening of a focused library of synthetic auxin conjugates in Eucalyptus grandis cuttings, highlighting 4-chlorophenoxyacetic acid-L-tryptophan-OMe as a competent enhancer of adventitious rooting in a number of recalcitrant woody plants. Comprehensive metabolic and functional analyses revealed that this activity is engendered by prolonged auxin signaling due to initial fast uptake and slow release and clearance of the free auxin 4-chlorophenoxyacetic acid. This work highlights the utility of a slow-release strategy for bioactive compounds and provides an exemplar for further rational development of more effective plant-growth regulators for agriculture.",
        "creator": "Roth, O., Yechezkel, S., Serero, O., Eliyahu, A., Vints, I., Tzeela, P., Carignano, A., Janacek, D. P., Peters, V., Kessel, A., Dwivedi, V., Carmeli-Weissberg, M., Shaya, F., Faigenboim-Doron, A., Riov, J., Klavins, E., Dawid, C., Hammes, U. Z., Ben-Tal, N., Napier, R., Sadot, E., Weinstain, R."
      }
    ]
  },
  {
    "name": "Economics",
    "feed": [
      {
        "title": "A Theory of Rational Housing Bubbles with Phase Transitions.",
        "link": "http://arxiv.org/abs/2303.11365",
        "abstract": "Empirically observed rent-price ratios suggest a disconnection between fundamentals and prices. We analyze equilibrium housing prices in an overlapping generations model with perfect housing and rental markets. We prove that the economy exhibits a two-stage phase transition: as the income of home buyers rises, the equilibrium regime changes from fundamental only to coexistence of fundamental and bubbly equilibria. With even higher incomes, fundamental equilibria disappear and housing bubbles become inevitable. Expectation-driven housing booms containing a bubble and their collapse can occur. Contrary to widely-held beliefs, fundamental equilibria in the coexistence region are inefficient despite housing being a productive non-reproducible asset.",
        "creator": "Tomohiro Hirano, Alexis Akira Toda"
      },
      {
        "title": "How Much Should We Trust Instrumental Variable Estimates in Political Science? Practical Advice Based on Over 60 Replicated Studies.",
        "link": "http://arxiv.org/abs/2303.11399",
        "abstract": "Instrumental variable (IV) strategies are widely used in political science to establish causal relationships. However, the identifying assumptions required by an IV design are demanding, and it remains challenging for researchers to assess their validity. In this paper, we replicate 67 papers published in three top journals in political science during 2010-2022 and identify several troubling patterns. First, researchers often overestimate the strength of their IVs due to non-i.i.d. errors, such as a clustering structure. Second, the most commonly used t-test for the two-stage-least-squares (2SLS) estimates often severely underestimates uncertainty. Using more robust inferential methods, we find that around 19-30% of the 2SLS estimates in our sample are underpowered. Third, in the majority of the replicated studies, the 2SLS estimates are much larger than the ordinary-least-squares estimates, and their ratio is negatively correlated with the strength of the IVs in studies where the IVs are not experimentally generated, suggesting potential violations of unconfoundedness or the exclusion restriction. To help researchers avoid these pitfalls, we provide a checklist for better practice.",
        "creator": "Apoorva Lal, Mac Lockhart, Yiqing Xu, Ziwen Zu"
      },
      {
        "title": "On the Existence and Information of Orthogonal Moments For Inference.",
        "link": "http://arxiv.org/abs/2303.11418",
        "abstract": "Locally Robust (LR)/Orthogonal/Debiased moments have been proved useful with machine learning or high dimensional first steps, but their existence has not been investigated for general models and parameters. In this paper, we provide a necessary and sufficient condition, referred to as Restricted Local Non-surjectivity (RLN), for the existence of such orthogonal moments to conduct robust inference on parameters of interest in regular semiparametric models. Importantly, RLN does not require identification of the parameters of interest or identification of the nuisance parameters. Thus, orthogonal moments exist under rather general conditions. However, for orthogonal moments to be informative for inference, the efficient Fisher Information matrix for the parameter must be non-zero (though possibly singular). We use these results to characterize the existence of orthogonal moments in a class of models with Unobserved Heterogeneity (UH), and to clarify the important role played by the support of UH for such characterization. Our results deliver functional differencing moments as a special case, and they also extend them to general functionals of UH. We also investigate existence of orthogonal moments and their relevance for models defined by moment restrictions with possibly different conditioning variables, and we characterize orthogonal moments for heterogenous parameters in treatment effects, for sample selection models, and for popular models of demand of differentiated products.",
        "creator": "Facundo Arga&#xf1;araz, Juan Carlos Escanciano"
      },
      {
        "title": "Both invariant principles implied by Marx's law of value are necessary and sufficient to solve the transformation problem through Morishima's formalism.",
        "link": "http://arxiv.org/abs/2303.11471",
        "abstract": "The unit value of a commodity that Michio Morishima's method and its variations enable to determine correctly, is the sum of the value of the commodities it contains (inputs) and the quantity of labor required for its production. However, goods are sold at their market production price only when they meet a solvent social need that involves the entire economy with its interconnections between the different industrial sectors. This condition gives full meaning to Marx's fundamental equalities, which derive from the law of value and constitute invariants that apply to the economy as a whole. These equalities are necessary to determine market production prices. We demonstrate that they also enable to solve the transformation problem for a simple reproduction system without fixed capital by starting from Morishima's formalism and returning to a formalism closer to that used by Marx.",
        "creator": "Norbert Ankri, Pa&#xef;kan Marcaggi"
      },
      {
        "title": "Using Forests in Multivariate Regression Discontinuity Designs.",
        "link": "http://arxiv.org/abs/2303.11721",
        "abstract": "We discuss estimating conditional treatment effects in regression discontinuity designs with multiple scores. While local linear regressions have been popular in settings where the treatment status is completely described by one running variable, they do not easily generalize to empirical applications involving multiple treatment assignment rules. In practice, the multivariate problem is usually reduced to a univariate one where using local linear regressions is suitable. Instead, we propose a forest-based estimator that can flexibly model multivariate scores, where we build two honest forests in the sense of Wager and Athey (2018) on both sides of the treatment boundary. This estimator is asymptotically normal and sidesteps the pitfalls of running local linear regressions in higher dimensions. In simulations, we find our proposed estimator outperforms local linear regressions in multivariate designs and is competitive against the minimax-optimal estimator of Imbens and Wager (2019). The implementation of this estimator is simple, can readily accommodate any (fixed) number of running variables, and does not require estimating any nuisance parameters of the data generating process.",
        "creator": "Yiqi Liu, Yuan Qi"
      },
      {
        "title": "Quasi Maximum Likelihood Estimation of High-Dimensional Factor Models.",
        "link": "http://arxiv.org/abs/2303.11777",
        "abstract": "We review Quasi Maximum Likelihood estimation of factor models for high-dimensional panels of time series. We consider two cases: (1) estimation when no dynamic model for the factors is specified (Bai and Li, 2016); (2) estimation based on the Kalman smoother and the Expectation Maximization algorithm thus allowing to model explicitly the factor dynamics (Doz et al., 2012). Our interest is in approximate factor models, i.e., when we allow for the idiosyncratic components to be mildly cross-sectionally, as well as serially, correlated. Although such setting apparently makes estimation harder, we show, in fact, that factor models do not suffer of the curse of dimensionality problem, but instead they enjoy a blessing of dimensionality property. In particular, we show that if the cross-sectional dimension of the data, $N$, grows to infinity, then: (i) identification of the model is still possible, (ii) the mis-specification error due to the use of an exact factor model log-likelihood vanishes. Moreover, if we let also the sample size, $T$, grow to infinity, we can also consistently estimate all parameters of the model and make inference. The same is true for estimation of the latent factors which can be carried out by weighted least-squares, linear projection, or Kalman filtering/smoothing. We also compare the approaches presented with: Principal Component analysis and the classical, fixed $N$, exact Maximum Likelihood approach. We conclude with a discussion on efficiency of the considered estimators.",
        "creator": "Matteo Barigozzi"
      },
      {
        "title": "Non-Market Allocation Mechanisms: Optimal Design and Investment Incentives.",
        "link": "http://arxiv.org/abs/2303.11805",
        "abstract": "We study how to optimally design selection mechanisms, accounting for agents' investment incentives. A principal wishes to allocate a resource of homogeneous quality to a heterogeneous population of agents. The principal commits to a possibly random selection rule that depends on a one-dimensional characteristic of the agents she intrinsically values. Agents have a strict preference for being selected by the principal and may undertake a costly investment to improve their characteristic before it is revealed to the principal. We show that even if random selection rules foster agents' investments, especially at the top of the characteristic distribution, deterministic \"pass-fail\" selection rules are in fact optimal.",
        "creator": "Victor Augias, Eduardo Perez-Richet"
      },
      {
        "title": "Large-Scale Education Reform in General Equilibrium: Regression Discontinuity Evidence from India: Comment.",
        "link": "http://arxiv.org/abs/2303.11956",
        "abstract": "This paper reanalyzes Khanna (2023), which studies labor market effects of schooling in India through a regression discontinuity design. In graphical preliminaries, reversing overrides of the plotting software's defaults greatly reduces the appearance of discontinuities. Absent from the data are four districts close to the discontinuity; restoring them cuts the reduced-form impacts on schooling and log wages by 62% and 75%. Using a consistent variance estimator, and clustering it at the geographic unit of treatment, further weakens the inference of positive impact. The estimates of general equilibrium effects and elasticities of substitution are not unbiased and have effectively infinite variance.",
        "creator": "David Roodman"
      },
      {
        "title": "Characterizing Random Serial Dictatorship.",
        "link": "http://arxiv.org/abs/2303.11976",
        "abstract": "Random serial dictatorship (RSD) is a randomized assignment rule that - given a set of $n$ agents with strict preferences over $n$ houses - satisfies equal treatment of equals, ex post efficiency, and strategyproofness. For $n \\le 3$, Bogomolnaia and Moulin (2001) have shown that RSD is characterized by these three axioms. Using best first search in combination with quadratic programming, we extend this characterization to $n \\le 5$, getting closer to answering the long-standing open question whether the characterization holds for arbitrary $n$. On the way, we describe weakenings of ex post efficiency and strategyproofness that are sufficient for our characterization and identify problems when making statements for larger $n$.",
        "creator": "Felix Brandt, Matthias Greger, Ren&#xe9; Romen"
      },
      {
        "title": "Inference from Selectively Disclosed Data.",
        "link": "http://arxiv.org/abs/2204.07191",
        "abstract": "We consider the disclosure problem of a sender who wants to use hard evidence to persuade a receiver towards higher actions. When the receiver hopes to make inferences based on the distribution of the data, the sender has an incentive to drop observations to mimic the distributions observed under better states. We use a continuum model to predict optimal play when datasets are large and find that, in the big-data limit, it is optimal for senders to play an imitation strategy, under which they submit evidence imitating the natural distribution under some desirable target state. Relative to full information, the partial pooling equilibrium with voluntary disclosure generates a loss in welfare to senders who either have little data or a favorable state, who optimally disclose their full dataset, but a benefit to senders with access to large datasets, who can profitably drop observations under low states.",
        "creator": "Ying Gao"
      },
      {
        "title": "On the Convergence of Credit Risk in Current Consumer Automobile Loans.",
        "link": "http://arxiv.org/abs/2211.09176",
        "abstract": "Conditional credit risk of a current loan is understudied. Using large-sample statistics and asset-level consumer automobile asset-backed security data, we find default risk conditional on survival eventually converges for borrowers in disparate credit risk bands, a phenomenon we call credit risk convergence. We conservatively estimate that borrowers forwent $1,212 - $2,327 in savings through delayed prepayment and find the surprising result that current lower risk borrowers behave less efficiently than current higher risk borrowers. We also present visual evidence prepayments rose with used auto values and economic stimulus rather than financial acumen. Our results are robust to various sensitivity tests.",
        "creator": "Jackson P. Lautier, Vladimir Pozdnyakov, Jun Yan"
      },
      {
        "title": "Minimum Wage Pass-through to Wholesale and Retail Prices: Evidence from Cannabis Scanner Data.",
        "link": "http://arxiv.org/abs/2303.10367",
        "abstract": "A growing empirical literature finds that firms pass the cost of minimum wage hikes onto consumers via higher retail prices. Yet, little is known about minimum wage effects on wholesale prices and whether retailers face a wholesale cost shock in addition to the labor cost shock. I exploit the unique market structure of Washington state's legal recreational cannabis industry to investigate minimum wage pass-through to wholesale and retail prices. In a dynamic difference-in-differences framework, I utilize scanner data on $6 billion of transactions across the supply chain and leverage geographic variation in firms' minimum wage exposure across six minimum wage hikes between 2018 and 2021. When ignoring wholesale cost effects, I find retail pass-through elasticities consistent with existing literature--yet retail pass-through elasticities more than double once wholesale cost effects are accounted for. Retail markups do not adjust to the wholesale cost shock, indicating a full pass-through of the wholesale cost shock to retail prices. The results suggest that previous research may underestimate the impact of minimum wage increases on retail prices. This paper highlights the importance of analyzing the entire supply chain when evaluating the product market effects of minimum wage hikes.",
        "creator": "Carl Hase"
      },
      {
        "title": "Decomposability and Strategy-proofness in Multidimensional Models.",
        "link": "http://arxiv.org/abs/2303.10889",
        "abstract": "We introduce the notion of a multidimensional hybrid preference domain on a (finite) set of alternatives that is a Cartesian product of finitely many components. We study strategy-proof rules on this domain and show that every such rule can be decomposed into component-wise strategy proof rules. More importantly, we show that under a suitable ``richness'' condition, every domain of preferences that reconciles decomposability of rules with strategy-proofness must be a multidimensional hybrid domain. We finally identify an intuitive weakening of separability that explains how a multidimensional hybrid domain may arise in a public goods provision model.",
        "creator": "Shurojit Chatterji, Huaxia Zeng"
      }
    ]
  }
]
