[{"name":"Artificial Intelligence","feed":[{"id":"2309.07129","slug":"ontologies-for-increasing-the-fairness-of-plant-research-data-arxiv-2309-07129v1-cs-dl","title":"Ontologies for increasing the FAIRness of plant research data.","link":"http://arxiv.org/abs/2309.07129","abstract":"The importance of improving the FAIRness (findability, accessibility, interoperability, reusability) of research data is undeniable, especially in the face of large, complex datasets currently being produced by omics technologies. Facilitating the integration of a dataset with other types of data increases the likelihood of reuse, and the potential of answering novel research questions. Ontologies are a useful tool for semantically tagging datasets as adding relevant metadata increases the understanding of how data was produced and increases its interoperability. Ontologies provide concepts for a particular domain as well as the relationships between concepts. By tagging data with ontology terms, data becomes both human and machine interpretable, allowing for increased reuse and interoperability. However, the task of identifying ontologies relevant to a particular research domain or technology is challenging, especially within the diverse realm of fundamental plant research. In this review, we outline the ontologies most relevant to the fundamental plant sciences and how they can be used to annotate data related to plant-specific experiments within metadata frameworks, such as Investigation-Study-Assay (ISA). We also outline repositories and platforms most useful for identifying applicable ontologies or finding ontology terms.","creator":"Kathryn Dumschott, Hannah D&#xf6;rpholz, Marie-Ang&#xe9;lique Laporte, Dominik Brilhaus, Andrea Schrader, Bj&#xf6;rn Usadel, Steffen Neumann, Elizabeth Arnaud, Angela Kranz"},{"id":"2309.07136","slug":"masked-transformer-for-electrocardiogram-classification-arxiv-2309-07136v1-eess-sp","title":"Masked Transformer for Electrocardiogram Classification.","link":"http://arxiv.org/abs/2309.07136","abstract":"Electrocardiogram (ECG) is one of the most important diagnostic tools in clinical applications. With the advent of advanced algorithms, various deep learning models have been adopted for ECG tasks. However, the potential of Transformers for ECG data is not yet realized, despite their widespread success in computer vision and natural language processing. In this work, we present a useful masked Transformer method for ECG classification referred to as MTECG, which expands the application of masked autoencoders to ECG time series. We construct a dataset comprising 220,251 ECG recordings with a broad range of diagnoses annoated by medical experts to explore the properties of MTECG. Under the proposed training strategies, a lightweight model with 5.7M parameters performs stably well on a broad range of masking ratios (5%-75%). The ablation studies highlight the importance of fluctuated reconstruction targets, training schedule length, layer-wise LR decay and DropPath rate. The experiments on both private and public ECG datasets demonstrate that MTECG-T significantly outperforms the recent state-of-the-art algorithms in ECG classification.","creator":"Ya Zhou, Xiaolin Diao, Yanni Huo, Yang Liu, Xiaohan Fan, Wei Zhao"},{"id":"2309.07141","slug":"design-of-recognition-and-evaluation-system-for-table-tennis-players-motor-skills-based-on-artificial-intelligence-arxiv-2309-07141v1-eess-sp","title":"Design of Recognition and Evaluation System for Table Tennis Players' Motor Skills Based on Artificial Intelligence.","link":"http://arxiv.org/abs/2309.07141","abstract":"With the rapid development of electronic science and technology, the research on wearable devices is constantly updated, but for now, it is not comprehensive for wearable devices to recognize and analyze the movement of specific sports. Based on this, this paper improves wearable devices of table tennis sport, and realizes the pattern recognition and evaluation of table tennis players' motor skills through artificial intelligence. Firstly, a device is designed to collect the movement information of table tennis players and the actual movement data is processed. Secondly, a sliding window is made to divide the collected motion data into a characteristic database of six table tennis benchmark movements. Thirdly, motion features were constructed based on feature engineering, and motor skills were identified for different models after dimensionality reduction. Finally, the hierarchical evaluation system of motor skills is established with the loss functions of different evaluation indexes. The results show that in the recognition of table tennis players' motor skills, the feature-based BP neural network proposed in this paper has higher recognition accuracy and stronger generalization ability than the traditional convolutional neural network.","creator":"Zhuo-yong Shi, Ye-tao Jia, Ke-xin Zhang, Ding-han Wang, Long-meng Ji, Yong Wu"},{"id":"2309.07145","slug":"etp-learning-transferable-ecg-representations-via-ecg-text-pre-training-arxiv-2309-07145v1-eess-sp","title":"ETP: Learning Transferable ECG Representations via ECG-Text Pre-training.","link":"http://arxiv.org/abs/2309.07145","abstract":"In the domain of cardiovascular healthcare, the Electrocardiogram (ECG) serves as a critical, non-invasive diagnostic tool. Although recent strides in self-supervised learning (SSL) have been promising for ECG representation learning, these techniques often require annotated samples and struggle with classes not present in the fine-tuning stages. To address these limitations, we introduce ECG-Text Pre-training (ETP), an innovative framework designed to learn cross-modal representations that link ECG signals with textual reports. For the first time, this framework leverages the zero-shot classification task in the ECG domain. ETP employs an ECG encoder along with a pre-trained language model to align ECG signals with their corresponding textual reports. The proposed framework excels in both linear evaluation and zero-shot classification tasks, as demonstrated on the PTB-XL and CPSC2018 datasets, showcasing its ability for robust and generalizable cross-modal ECG feature learning.","creator":"Che Liu, Zhongwei Wan, Sibo Cheng, Mi Zhang, Rossella Arcucci"},{"id":"2309.07149","slug":"decoding-visual-brain-representations-from-electroencephalography-through-knowledge-distillation-and-latent-diffusion-models-arxiv-2309-07149v1-eess-sp","title":"Decoding visual brain representations from electroencephalography through Knowledge Distillation and latent diffusion models.","link":"http://arxiv.org/abs/2309.07149","abstract":"Decoding visual representations from human brain activity has emerged as a thriving research domain, particularly in the context of brain-computer interfaces. Our study presents an innovative method that employs to classify and reconstruct images from the ImageNet dataset using electroencephalography (EEG) data from subjects that had viewed the images themselves (i.e. \"brain decoding\"). We analyzed EEG recordings from 6 participants, each exposed to 50 images spanning 40 unique semantic categories. These EEG readings were converted into spectrograms, which were then used to train a convolutional neural network (CNN), integrated with a knowledge distillation procedure based on a pre-trained Contrastive Language-Image Pre-Training (CLIP)-based image classification teacher network. This strategy allowed our model to attain a top-5 accuracy of 80%, significantly outperforming a standard CNN and various RNN-based benchmarks. Additionally, we incorporated an image reconstruction mechanism based on pre-trained latent diffusion models, which allowed us to generate an estimate of the images which had elicited EEG activity. Therefore, our architecture not only decodes images from neural activity but also offers a credible image reconstruction from EEG only, paving the way for e.g. swift, individualized feedback experiments. Our research represents a significant step forward in connecting neural signals with visual cognition.","creator":"Matteo Ferrante, Tommaso Boccato, Stefano Bargione, Nicola Toschi"},{"id":"2309.07153","slug":"finding-influencers-in-complex-networks-an-effective-deep-reinforcement-learning-approach-arxiv-2309-07153v1-cs-si","title":"Finding Influencers in Complex Networks: An Effective Deep Reinforcement Learning Approach.","link":"http://arxiv.org/abs/2309.07153","abstract":"Maximizing influences in complex networks is a practically important but computationally challenging task for social network analysis, due to its NP- hard nature. Most current approximation or heuristic methods either require tremendous human design efforts or achieve unsatisfying balances between effectiveness and efficiency. Recent machine learning attempts only focus on speed but lack performance enhancement. In this paper, different from previous attempts, we propose an effective deep reinforcement learning model that achieves superior performances over traditional best influence maximization algorithms. Specifically, we design an end-to-end learning framework that combines graph neural network as the encoder and reinforcement learning as the decoder, named DREIM. Trough extensive training on small synthetic graphs, DREIM outperforms the state-of-the-art baseline methods on very large synthetic and real-world networks on solution quality, and we also empirically show its linear scalability with regard to the network size, which demonstrates its superiority in solving this problem.","creator":"Changan Liu, Changjun Fan, Zhongzhi Zhang"},{"id":"2309.07154","slug":"recall-driven-precision-refinement-unveiling-accurate-fall-detection-using-lstm-arxiv-2309-07154v1-eess-sp","title":"Recall-driven Precision Refinement: Unveiling Accurate Fall Detection using LSTM.","link":"http://arxiv.org/abs/2309.07154","abstract":"This paper presents an innovative approach to address the pressing concern of fall incidents among the elderly by developing an accurate fall detection system. Our proposed system combines state-of-the-art technologies, including accelerometer and gyroscope sensors, with deep learning models, specifically Long Short-Term Memory (LSTM) networks. Real-time execution capabilities are achieved through the integration of Raspberry Pi hardware. We introduce pruning techniques that strategically fine-tune the LSTM model's architecture and parameters to optimize the system's performance. We prioritize recall over precision, aiming to accurately identify falls and minimize false negatives for timely intervention. Extensive experimentation and meticulous evaluation demonstrate remarkable performance metrics, emphasizing a high recall rate while maintaining a specificity of 96\\%. Our research culminates in a state-of-the-art fall detection system that promptly sends notifications, ensuring vulnerable individuals receive timely assistance and improve their overall well-being. Applying LSTM models and incorporating pruning techniques represent a significant advancement in fall detection technology, offering an effective and reliable fall prevention and intervention solution.","creator":"Rishabh Mondal, Prasun Ghosal"},{"id":"2309.07164","slug":"hybrid-asr-for-resource-constrained-robots-hmm-deep-learning-fusion-arxiv-2309-07164v1-eess-as","title":"Hybrid ASR for Resource-Constrained Robots: HMM - Deep Learning Fusion.","link":"http://arxiv.org/abs/2309.07164","abstract":"This paper presents a novel hybrid Automatic Speech Recognition (ASR) system designed specifically for resource-constrained robots. The proposed approach combines Hidden Markov Models (HMMs) with deep learning models and leverages socket programming to distribute processing tasks effectively. In this architecture, the HMM-based processing takes place within the robot, while a separate PC handles the deep learning model. This synergy between HMMs and deep learning enhances speech recognition accuracy significantly. We conducted experiments across various robotic platforms, demonstrating real-time and precise speech recognition capabilities. Notably, the system exhibits adaptability to changing acoustic conditions and compatibility with low-power hardware, making it highly effective in environments with limited computational resources. This hybrid ASR paradigm opens up promising possibilities for seamless human-robot interaction. In conclusion, our research introduces a pioneering dimension to ASR techniques tailored for robotics. By employing socket programming to distribute processing tasks across distinct devices and strategically combining HMMs with deep learning models, our hybrid ASR system showcases its potential to enable robots to comprehend and respond to spoken language adeptly, even in environments with restricted computational resources. This paradigm sets a innovative course for enhancing human-robot interaction across a wide range of real-world scenarios.","creator":"Anshul Ranjan, Kaushik Jegadeesan"},{"id":"2309.07168","slug":"goal-space-abstraction-in-hierarchical-reinforcement-learning-via-reachability-analysis-arxiv-2309-07168v1-cs-lg","title":"Goal Space Abstraction in Hierarchical Reinforcement Learning via Reachability Analysis.","link":"http://arxiv.org/abs/2309.07168","abstract":"Open-ended learning benefits immensely from the use of symbolic methods for goal representation as they offer ways to structure knowledge for efficient and transferable learning. However, the existing Hierarchical Reinforcement Learning (HRL) approaches relying on symbolic reasoning are often limited as they require a manual goal representation. The challenge in autonomously discovering a symbolic goal representation is that it must preserve critical information, such as the environment dynamics. In this work, we propose a developmental mechanism for subgoal discovery via an emergent representation that abstracts (i.e., groups together) sets of environment states that have similar roles in the task. We create a HRL algorithm that gradually learns this representation along with the policies and evaluate it on navigation tasks to show the learned representation is interpretable and results in data efficiency.","creator":"Mehdi Zadem (LIX, U2IS), Sergio Mover (LIX), Sao Mai Nguyen (U2IS, Flowers, IMT Atlantique - INFO, Lab-STICC_RAMBO)"},{"id":"2309.07172","slug":"exploring-large-language-models-for-ontology-alignment-arxiv-2309-07172v1-cs-ai","title":"Exploring Large Language Models for Ontology Alignment.","link":"http://arxiv.org/abs/2309.07172","abstract":"This work investigates the applicability of recent generative Large Language Models (LLMs), such as the GPT series and Flan-T5, to ontology alignment for identifying concept equivalence mappings across ontologies. To test the zero-shot performance of Flan-T5-XXL and GPT-3.5-turbo, we leverage challenging subsets from two equivalence matching datasets of the OAEI Bio-ML track, taking into account concept labels and structural contexts. Preliminary findings suggest that LLMs have the potential to outperform existing ontology alignment systems like BERTMap, given careful framework and prompt design.","creator":"Yuan He, Jiaoyan Chen, Hang Dong, Ian Horrocks"},{"id":"2309.07174","slug":"hurricast-an-automatic-framework-using-machine-learning-and-statistical-modeling-for-hurricane-forecasting-arxiv-2309-07174v1-cs-lg","title":"HurriCast: An Automatic Framework Using Machine Learning and Statistical Modeling for Hurricane Forecasting.","link":"http://arxiv.org/abs/2309.07174","abstract":"Hurricanes present major challenges in the U.S. due to their devastating impacts. Mitigating these risks is important, and the insurance industry is central in this effort, using intricate statistical models for risk assessment. However, these models often neglect key temporal and spatial hurricane patterns and are limited by data scarcity. This study introduces a refined approach combining the ARIMA model and K-MEANS to better capture hurricane trends, and an Autoencoder for enhanced hurricane simulations. Our experiments show that this hybrid methodology effectively simulate historical hurricane behaviors while providing detailed projections of potential future trajectories and intensities. Moreover, by leveraging a comprehensive yet selective dataset, our simulations enrich the current understanding of hurricane patterns and offer actionable insights for risk management strategies.","creator":"Shouwei Gao, Meiyan Gao, Yuepeng Li, Wenqian Dong"},{"id":"2309.07178","slug":"cloudbrain-nmr-an-intelligent-cloud-computing-platform-for-nmr-spectroscopy-processing-reconstruction-and-analysis-arxiv-2309-07178v1-q-bio-qm","title":"CloudBrain-NMR: An Intelligent Cloud Computing Platform for NMR Spectroscopy Processing, Reconstruction and Analysis.","link":"http://arxiv.org/abs/2309.07178","abstract":"Nuclear Magnetic Resonance (NMR) spectroscopy has served as a powerful analytical tool for studying molecular structure and dynamics in chemistry and biology. However, the processing of raw data acquired from NMR spectrometers and subsequent quantitative analysis involves various specialized tools, which necessitates comprehensive knowledge in programming and NMR. Particularly, the emerging deep learning tools is hard to be widely used in NMR due to the sophisticated setup of computation. Thus, NMR processing is not an easy task for chemist and biologists. In this work, we present CloudBrain-NMR, an intelligent online cloud computing platform designed for NMR data reading, processing, reconstruction, and quantitative analysis. The platform is conveniently accessed through a web browser, eliminating the need for any program installation on the user side. CloudBrain-NMR uses parallel computing with graphics processing units and central processing units, resulting in significantly shortened computation time. Furthermore, it incorporates state-of-the-art deep learning-based algorithms offering comprehensive functionalities that allow users to complete the entire processing procedure without relying on additional software. This platform has empowered NMR applications with advanced artificial intelligence processing. CloudBrain-NMR is openly accessible for free usage at https://csrc.xmu.edu.cn/CloudBrain.html","creator":"Di Guo, Sijin Li, Jun Liu, Zhangren Tu, Tianyu Qiu, Jingjing Xu, Liubin Feng, Donghai Lin, Qing Hong, Meijin Lin, Yanqin Lin, Xiaobo Qu"},{"id":"2309.07185","slug":"a-health-monitoring-system-based-on-flexible-triboelectric-sensors-for-intelligence-medical-internet-of-things-and-its-applications-in-virtual-reality-arxiv-2309-07185v1-eess-sp","title":"A Health Monitoring System Based on Flexible Triboelectric Sensors for Intelligence Medical Internet of Things and its Applications in Virtual Reality.","link":"http://arxiv.org/abs/2309.07185","abstract":"The Internet of Medical Things (IoMT) is a platform that combines Internet of Things (IoT) technology with medical applications, enabling the realization of precision medicine, intelligent healthcare, and telemedicine in the era of digitalization and intelligence. However, the IoMT faces various challenges, including sustainable power supply, human adaptability of sensors and the intelligence of sensors. In this study, we designed a robust and intelligent IoMT system through the synergistic integration of flexible wearable triboelectric sensors and deep learning-assisted data analytics. We embedded four triboelectric sensors into a wristband to detect and analyze limb movements in patients suffering from Parkinson's Disease (PD). By further integrating deep learning-assisted data analytics, we actualized an intelligent healthcare monitoring system for the surveillance and interaction of PD patients, which includes location/trajectory tracking, heart monitoring and identity recognition. This innovative approach enabled us to accurately capture and scrutinize the subtle movements and fine motor of PD patients, thus providing insightful feedback and comprehensive assessment of the patients conditions. This monitoring system is cost-effective, easily fabricated, highly sensitive, and intelligent, consequently underscores the immense potential of human body sensing technology in a Health 4.0 society.","creator":"Junqi Mao, Puen Zhou, Xiaoyao Wang, Hongbo Yao, Liuyang Liang, Yiqiao Zhao, Jiawei Zhang, Dayan Ban, Haiwu Zheng"},{"id":"2309.07188","slug":"predicting-survival-time-of-ball-bearings-in-the-presence-of-censoring-arxiv-2309-07188v1-eess-sp","title":"Predicting Survival Time of Ball Bearings in the Presence of Censoring.","link":"http://arxiv.org/abs/2309.07188","abstract":"Ball bearings find widespread use in various manufacturing and mechanical domains, and methods based on machine learning have been widely adopted in the field to monitor wear and spot defects before they lead to failures. Few studies, however, have addressed the problem of censored data, in which failure is not observed. In this paper, we propose a novel approach to predict the time to failure in ball bearings using survival analysis. First, we analyze bearing data in the frequency domain and annotate when a bearing fails by comparing the Kullback-Leibler divergence and the standard deviation between its break-in frequency bins and its break-out frequency bins. Second, we train several survival models to estimate the time to failure based on the annotated data and covariates extracted from the time domain, such as skewness, kurtosis and entropy. The models give a probabilistic prediction of risk over time and allow us to compare the survival function between groups of bearings. We demonstrate our approach on the XJTU and PRONOSTIA datasets. On XJTU, the best result is a 0.70 concordance-index and 0.21 integrated Brier score. On PRONOSTIA, the best is a 0.76 concordance-index and 0.19 integrated Brier score. Our work motivates further work on incorporating censored data in models for predictive maintenance.","creator":"Christian Marius Lillelund, Fernando Pannullo, Morten Opprud Jakobsen, Christian Fischer Pedersen"},{"id":"2309.07196","slug":"attention-based-dynamic-graph-convolutional-recurrent-neural-network-for-traffic-flow-prediction-in-highway-transportation-arxiv-2309-07196v1-cs-lg","title":"Attention-based Dynamic Graph Convolutional Recurrent Neural Network for Traffic Flow Prediction in Highway Transportation.","link":"http://arxiv.org/abs/2309.07196","abstract":"As one of the important tools for spatial feature extraction, graph convolution has been applied in a wide range of fields such as traffic flow prediction. However, current popular works of graph convolution cannot guarantee spatio-temporal consistency in a long period. The ignorance of correlational dynamics, convolutional locality and temporal comprehensiveness would limit predictive accuracy. In this paper, a novel Attention-based Dynamic Graph Convolutional Recurrent Neural Network (ADGCRNN) is proposed to improve traffic flow prediction in highway transportation. Three temporal resolutions of data sequence are effectively integrated by self-attention to extract characteristics; multi-dynamic graphs and their weights are dynamically created to compliantly combine the varying characteristics; a dedicated gated kernel emphasizing highly relative nodes is introduced on these complete graphs to reduce overfitting for graph convolution operations. Experiments on two public datasets show our work better than state-of-the-art baselines, and case studies of a real Web system prove practical benefit in highway transportation.","creator":"Tianpu Zhang, Weilong Ding, Mengda Xing"},{"id":"2309.07200","slug":"latent-representation-and-simulation-of-markov-processes-via-time-lagged-information-bottleneck-arxiv-2309-07200v1-cs-lg","title":"Latent Representation and Simulation of Markov Processes via Time-Lagged Information Bottleneck.","link":"http://arxiv.org/abs/2309.07200","abstract":"Markov processes are widely used mathematical models for describing dynamic systems in various fields. However, accurately simulating large-scale systems at long time scales is computationally expensive due to the short time steps required for accurate integration. In this paper, we introduce an inference process that maps complex systems into a simplified representational space and models large jumps in time. To achieve this, we propose Time-lagged Information Bottleneck (T-IB), a principled objective rooted in information theory, which aims to capture relevant temporal features while discarding high-frequency information to simplify the simulation task and minimize the inference error. Our experiments demonstrate that T-IB learns information-optimal representations for accurately modeling the statistical properties and dynamics of the original process at a selected time lag, outperforming existing time-lagged dimensionality reduction methods.","creator":"Marco Federici, Patrick Forr&#xe9;, Ryota Tomioka, Bastiaan S. Veeling"},{"id":"2309.07235","slug":"autotuning-apache-tvm-based-scientific-applications-using-bayesian-optimization-arxiv-2309-07235v1-cs-lg","title":"Autotuning Apache TVM-based Scientific Applications Using Bayesian Optimization.","link":"http://arxiv.org/abs/2309.07235","abstract":"Apache TVM (Tensor Virtual Machine), an open source machine learning compiler framework designed to optimize computations across various hardware platforms, provides an opportunity to improve the performance of dense matrix factorizations such as LU (Lower Upper) decomposition and Cholesky decomposition on GPUs and AI (Artificial Intelligence) accelerators. In this paper, we propose a new TVM autotuning framework using Bayesian Optimization and use the TVM tensor expression language to implement linear algebra kernels such as LU, Cholesky, and 3mm. We use these scientific computation kernels to evaluate the effectiveness of our methods on a GPU cluster, called Swing, at Argonne National Laboratory. We compare the proposed autotuning framework with the TVM autotuning framework AutoTVM with four tuners and find that our framework outperforms AutoTVM in most cases.","creator":"Xingfu Wu, Praveen Paramasivam, Valerie Taylor"},{"id":"2309.07265","slug":"safe-and-accelerated-deep-reinforcement-learning-based-o-ran-slicing-a-hybrid-transfer-learning-approach-arxiv-2309-07265v1-cs-ni","title":"Safe and Accelerated Deep Reinforcement Learning-based O-RAN Slicing: A Hybrid Transfer Learning Approach.","link":"http://arxiv.org/abs/2309.07265","abstract":"The open radio access network (O-RAN) architecture supports intelligent network control algorithms as one of its core capabilities. Data-driven applications incorporate such algorithms to optimize radio access network (RAN) functions via RAN intelligent controllers (RICs). Deep reinforcement learning (DRL) algorithms are among the main approaches adopted in the O-RAN literature to solve dynamic radio resource management problems. However, despite the benefits introduced by the O-RAN RICs, the practical adoption of DRL algorithms in real network deployments falls behind. This is primarily due to the slow convergence and unstable performance exhibited by DRL agents upon deployment and when facing previously unseen network conditions. In this paper, we address these challenges by proposing transfer learning (TL) as a core component of the training and deployment workflows for the DRL-based closed-loop control of O-RAN functionalities. To this end, we propose and design a hybrid TL-aided approach that leverages the advantages of both policy reuse and distillation TL methods to provide safe and accelerated convergence in DRL-based O-RAN slicing. We conduct a thorough experiment that accommodates multiple services, including real VR gaming traffic to reflect practical scenarios of O-RAN slicing. We also propose and implement policy reuse and distillation-aided DRL and non-TL-aided DRL as three separate baselines. The proposed hybrid approach shows at least: 7.7% and 20.7% improvements in the average initial reward value and the percentage of converged scenarios, and a 64.6% decrease in reward variance while maintaining fast convergence and enhancing the generalizability compared with the baselines.","creator":"Ahmad M. Nagib, Hatem Abou-Zeid, Hossam S. Hassanein"},{"id":"2309.07276","slug":"language-conditioned-observation-models-for-visual-object-search-arxiv-2309-07276v1-cs-ro","title":"Language-Conditioned Observation Models for Visual Object Search.","link":"http://arxiv.org/abs/2309.07276","abstract":"Object search is a challenging task because when given complex language descriptions (e.g., \"find the white cup on the table\"), the robot must move its camera through the environment and recognize the described object. Previous works map language descriptions to a set of fixed object detectors with predetermined noise models, but these approaches are challenging to scale because new detectors need to be made for each object. In this work, we bridge the gap in realistic object search by posing the search problem as a partially observable Markov decision process (POMDP) where the object detector and visual sensor noise in the observation model is determined by a single Deep Neural Network conditioned on complex language descriptions. We incorporate the neural network's outputs into our language-conditioned observation model (LCOM) to represent dynamically changing sensor noise. With an LCOM, any language description of an object can be used to generate an appropriate object detector and noise model, and training an LCOM only requires readily available supervised image-caption datasets. We empirically evaluate our method by comparing against a state-of-the-art object search algorithm in simulation, and demonstrate that planning with our observation model yields a significantly higher average task completion rate (from 0.46 to 0.66) and more efficient and quicker object search than with a fixed-noise model. We demonstrate our method on a Boston Dynamics Spot robot, enabling it to handle complex natural language object descriptions and efficiently find objects in a room-scale environment.","creator":"Thao Nguyen, Vladislav Hrosinkov, Eric Rosen, Stefanie Tellex"},{"id":"2309.07314","slug":"audiosr-versatile-audio-super-resolution-at-scale-arxiv-2309-07314v1-cs-sd","title":"AudioSR: Versatile Audio Super-resolution at Scale.","link":"http://arxiv.org/abs/2309.07314","abstract":"Audio super-resolution is a fundamental task that predicts high-frequency components for low-resolution audio, enhancing audio quality in digital applications. Previous methods have limitations such as the limited scope of audio types (e.g., music, speech) and specific bandwidth settings they can handle (e.g., 4kHz to 8kHz). In this paper, we introduce a diffusion-based generative model, AudioSR, that is capable of performing robust audio super-resolution on versatile audio types, including sound effects, music, and speech. Specifically, AudioSR can upsample any input audio signal within the bandwidth range of 2kHz to 16kHz to a high-resolution audio signal at 24kHz bandwidth with a sampling rate of 48kHz. Extensive objective evaluation on various audio super-resolution benchmarks demonstrates the strong result achieved by the proposed model. In addition, our subjective evaluation shows that AudioSR can acts as a plug-and-play module to enhance the generation quality of a wide range of audio generative models, including AudioLDM, Fastspeech2, and MusicGen. Our code and demo are available at https://audioldm.github.io/audiosr.","creator":"Haohe Liu, Ke Chen, Qiao Tian, Wenwu Wang, Mark D. Plumbley"},{"id":"2309.07315","slug":"traveling-words-a-geometric-interpretation-of-transformers-arxiv-2309-07315v1-cs-cl","title":"Traveling Words: A Geometric Interpretation of Transformers.","link":"http://arxiv.org/abs/2309.07315","abstract":"Transformers have significantly advanced the field of natural language processing, but comprehending their internal mechanisms remains a challenge. In this paper, we introduce a novel geometric perspective that elucidates the inner mechanisms of transformer operations. Our primary contribution is illustrating how layer normalization confines the latent features to a hyper-sphere, subsequently enabling attention to mold the semantic representation of words on this surface. This geometric viewpoint seamlessly connects established properties such as iterative refinement and contextual embeddings. We validate our insights by probing a pre-trained 124M parameter GPT-2 model. Our findings reveal clear query-key attention patterns in early layers and build upon prior observations regarding the subject-specific nature of attention heads at deeper layers. Harnessing these geometric insights, we present an intuitive understanding of transformers, depicting them as processes that model the trajectory of word particles along the hyper-sphere.","creator":"Raul Molina"},{"id":"2309.07332","slug":"reliability-based-cleaning-of-noisy-training-labels-with-inductive-conformal-prediction-in-multi-modal-biomedical-data-mining-arxiv-2309-07332v1-cs-lg","title":"Reliability-based cleaning of noisy training labels with inductive conformal prediction in multi-modal biomedical data mining.","link":"http://arxiv.org/abs/2309.07332","abstract":"Accurately labeling biomedical data presents a challenge. Traditional semi-supervised learning methods often under-utilize available unlabeled data. To address this, we propose a novel reliability-based training data cleaning method employing inductive conformal prediction (ICP). This method capitalizes on a small set of accurately labeled training data and leverages ICP-calculated reliability metrics to rectify mislabeled data and outliers within vast quantities of noisy training data. The efficacy of the method is validated across three classification tasks within distinct modalities: filtering drug-induced-liver-injury (DILI) literature with title and abstract, predicting ICU admission of COVID-19 patients through CT radiomics and electronic health records, and subtyping breast cancer using RNA-sequencing data. Varying levels of noise to the training labels were introduced through label permutation. Results show significant enhancements in classification performance: accuracy enhancement in 86 out of 96 DILI experiments (up to 11.4%), AUROC and AUPRC enhancements in all 48 COVID-19 experiments (up to 23.8% and 69.8%), and accuracy and macro-average F1 score improvements in 47 out of 48 RNA-sequencing experiments (up to 74.6% and 89.0%). Our method offers the potential to substantially boost classification performance in multi-modal biomedical machine learning tasks. Importantly, it accomplishes this without necessitating an excessive volume of meticulously curated training data.","creator":"Xianghao Zhan, Qinmei Xu, Yuanning Zheng, Guangming Lu, Olivier Gevaert"},{"id":"2309.07334","slug":"learning-from-auxiliary-sources-in-argumentative-revision-classification-arxiv-2309-07334v1-cs-cl","title":"Learning from Auxiliary Sources in Argumentative Revision Classification.","link":"http://arxiv.org/abs/2309.07334","abstract":"We develop models to classify desirable reasoning revisions in argumentative writing. We explore two approaches -- multi-task learning and transfer learning -- to take advantage of auxiliary sources of revision data for similar tasks. Results of intrinsic and extrinsic evaluations show that both approaches can indeed improve classifier performance over baselines. While multi-task learning shows that training on different sources of data at the same time may improve performance, transfer-learning better represents the relationship between the data.","creator":"Tazin Afrin, Diane Litman"},{"id":"2309.07339","slug":"efficient-quantum-recurrent-reinforcement-learning-via-quantum-reservoir-computing-arxiv-2309-07339v1-quant-ph","title":"Efficient quantum recurrent reinforcement learning via quantum reservoir computing.","link":"http://arxiv.org/abs/2309.07339","abstract":"Quantum reinforcement learning (QRL) has emerged as a framework to solve sequential decision-making tasks, showcasing empirical quantum advantages. A notable development is through quantum recurrent neural networks (QRNNs) for memory-intensive tasks such as partially observable environments. However, QRL models incorporating QRNN encounter challenges such as inefficient training of QRL with QRNN, given that the computation of gradients in QRNN is both computationally expensive and time-consuming. This work presents a novel approach to address this challenge by constructing QRL agents utilizing QRNN-based reservoirs, specifically employing quantum long short-term memory (QLSTM). QLSTM parameters are randomly initialized and fixed without training. The model is trained using the asynchronous advantage actor-aritic (A3C) algorithm. Through numerical simulations, we validate the efficacy of our QLSTM-Reservoir RL framework. Its performance is assessed on standard benchmarks, demonstrating comparable results to a fully trained QLSTM RL model with identical architecture and training settings.","creator":"Samuel Yen-Chi Chen"},{"id":"2309.07364","slug":"hodge-aware-contrastive-learning-arxiv-2309-07364v1-cs-lg","title":"Hodge-Aware Contrastive Learning.","link":"http://arxiv.org/abs/2309.07364","abstract":"Simplicial complexes prove effective in modeling data with multiway dependencies, such as data defined along the edges of networks or within other higher-order structures. Their spectrum can be decomposed into three interpretable subspaces via the Hodge decomposition, resulting foundational in numerous applications. We leverage this decomposition to develop a contrastive self-supervised learning approach for processing simplicial data and generating embeddings that encapsulate specific spectral information.Specifically, we encode the pertinent data invariances through simplicial neural networks and devise augmentations that yield positive contrastive examples with suitable spectral properties for downstream tasks. Additionally, we reweight the significance of negative examples in the contrastive loss, considering the similarity of their Hodge components to the anchor. By encouraging a stronger separation among less similar instances, we obtain an embedding space that reflects the spectral properties of the data. The numerical results on two standard edge flow classification tasks show a superior performance even when compared to supervised learning techniques. Our findings underscore the importance of adopting a spectral perspective for contrastive learning with higher-order data.","creator":"Alexander M&#xf6;llers, Alexander Immer, Vincent Fortuin, Elvin Isufi"},{"id":"2309.07367","slug":"the-kernel-balanced-equation-for-deep-neural-networks-arxiv-2309-07367v1-cond-mat-dis-nn","title":"The kernel-balanced equation for deep neural networks.","link":"http://arxiv.org/abs/2309.07367","abstract":"Deep neural networks have shown many fruitful applications in this decade. A network can get the generalized function through training with a finite dataset. The degree of generalization is a realization of the proximity scale in the data space. Specifically, the scale is not clear if the dataset is complicated. Here we consider a network for the distribution estimation of the dataset. We show the estimation is unstable and the instability depends on the data density and training duration. We derive the kernel-balanced equation, which gives a short phenomenological description of the solution. The equation tells us the reason for the instability and the mechanism of the scale. The network outputs a local average of the dataset as a prediction and the scale of averaging is determined along the equation. The scale gradually decreases along training and finally results in instability in our case.","creator":"Kenichi Nakazato"},{"id":"2309.07390","slug":"unleashing-the-power-of-depth-and-pose-estimation-neural-networks-by-designing-compatible-endoscopic-images-arxiv-2309-07390v1-cs-cv","title":"Unleashing the Power of Depth and Pose Estimation Neural Networks by Designing Compatible Endoscopic Images.","link":"http://arxiv.org/abs/2309.07390","abstract":"Deep learning models have witnessed depth and pose estimation framework on unannotated datasets as a effective pathway to succeed in endoscopic navigation. Most current techniques are dedicated to developing more advanced neural networks to improve the accuracy. However, existing methods ignore the special properties of endoscopic images, resulting in an inability to fully unleash the power of neural networks. In this study, we conduct a detail analysis of the properties of endoscopic images and improve the compatibility of images and neural networks, to unleash the power of current neural networks. First, we introcude the Mask Image Modelling (MIM) module, which inputs partial image information instead of complete image information, allowing the network to recover global information from partial pixel information. This enhances the network' s ability to perceive global information and alleviates the phenomenon of local overfitting in convolutional neural networks due to local artifacts. Second, we propose a lightweight neural network to enhance the endoscopic images, to explicitly improve the compatibility between images and neural networks. Extensive experiments are conducted on the three public datasets and one inhouse dataset, and the proposed modules improve baselines by a large margin. Furthermore, the enhanced images we proposed, which have higher network compatibility, can serve as an effective data augmentation method and they are able to extract more stable feature points in traditional feature point matching tasks and achieve outstanding performance.","creator":"Junyang Wu, Yun Gu"},{"id":"2309.07396","slug":"debcse-rethinking-unsupervised-contrastive-sentence-embedding-learning-in-the-debiasing-perspective-arxiv-2309-07396v1-cs-cl","title":"DebCSE: Rethinking Unsupervised Contrastive Sentence Embedding Learning in the Debiasing Perspective.","link":"http://arxiv.org/abs/2309.07396","abstract":"Several prior studies have suggested that word frequency biases can cause the Bert model to learn indistinguishable sentence embeddings. Contrastive learning schemes such as SimCSE and ConSERT have already been adopted successfully in unsupervised sentence embedding to improve the quality of embeddings by reducing this bias. However, these methods still introduce new biases such as sentence length bias and false negative sample bias, that hinders model's ability to learn more fine-grained semantics. In this paper, we reexamine the challenges of contrastive sentence embedding learning from a debiasing perspective and argue that effectively eliminating the influence of various biases is crucial for learning high-quality sentence embeddings. We think all those biases are introduced by simple rules for constructing training data in contrastive learning and the key for contrastive learning sentence embedding is to mimic the distribution of training data in supervised machine learning in unsupervised way. We propose a novel contrastive framework for sentence embedding, termed DebCSE, which can eliminate the impact of these biases by an inverse propensity weighted sampling method to select high-quality positive and negative pairs according to both the surface and semantic similarity between sentences. Extensive experiments on semantic textual similarity (STS) benchmarks reveal that DebCSE significantly outperforms the latest state-of-the-art models with an average Spearman's correlation coefficient of 80.33% on BERTbase.","creator":"Pu Miao, Zeyao Du, Junlin Zhang"},{"id":"2309.07398","slug":"semantic-adversarial-attacks-via-diffusion-models-arxiv-2309-07398v1-cs-cv","title":"Semantic Adversarial Attacks via Diffusion Models.","link":"http://arxiv.org/abs/2309.07398","abstract":"Traditional adversarial attacks concentrate on manipulating clean examples in the pixel space by adding adversarial perturbations. By contrast, semantic adversarial attacks focus on changing semantic attributes of clean examples, such as color, context, and features, which are more feasible in the real world. In this paper, we propose a framework to quickly generate a semantic adversarial attack by leveraging recent diffusion models since semantic information is included in the latent space of well-trained diffusion models. Then there are two variants of this framework: 1) the Semantic Transformation (ST) approach fine-tunes the latent space of the generated image and/or the diffusion model itself; 2) the Latent Masking (LM) approach masks the latent space with another target image and local backpropagation-based interpretation methods. Additionally, the ST approach can be applied in either white-box or black-box settings. Extensive experiments are conducted on CelebA-HQ and AFHQ datasets, and our framework demonstrates great fidelity, generalizability, and transferability compared to other baselines. Our approaches achieve approximately 100% attack success rate in multiple settings with the best FID as 36.61. Code is available at https://github.com/steven202/semantic_adv_via_dm.","creator":"Chenan Wang, Jinhao Duan, Chaowei Xiao, Edward Kim, Matthew Stamm, Kaidi Xu"},{"id":"2309.07401","slug":"multi-grade-deep-learning-for-partial-differential-equations-with-applications-to-the-burgers-equation-arxiv-2309-07401v1-math-na","title":"Multi-Grade Deep Learning for Partial Differential Equations with Applications to the Burgers Equation.","link":"http://arxiv.org/abs/2309.07401","abstract":"We develop in this paper a multi-grade deep learning method for solving nonlinear partial differential equations (PDEs). Deep neural networks (DNNs) have received super performance in solving PDEs in addition to their outstanding success in areas such as natural language processing, computer vision, and robotics. However, training a very deep network is often a challenging task. As the number of layers of a DNN increases, solving a large-scale non-convex optimization problem that results in the DNN solution of PDEs becomes more and more difficult, which may lead to a decrease rather than an increase in predictive accuracy. To overcome this challenge, we propose a two-stage multi-grade deep learning (TS-MGDL) method that breaks down the task of learning a DNN into several neural networks stacked on top of each other in a staircase-like manner. This approach allows us to mitigate the complexity of solving the non-convex optimization problem with large number of parameters and learn residual components left over from previous grades efficiently. We prove that each grade/stage of the proposed TS-MGDL method can reduce the value of the loss function and further validate this fact through numerical experiments. Although the proposed method is applicable to general PDEs, implementation in this paper focuses only on the 1D, 2D, and 3D viscous Burgers equations. Experimental results show that the proposed two-stage multi-grade deep learning method enables efficient learning of solutions of the equations and outperforms existing single-grade deep learning methods in predictive accuracy. Specifically, the predictive errors of the single-grade deep learning are larger than those of the TS-MGDL method in 26-60, 4-31 and 3-12 times, for the 1D, 2D, and 3D equations, respectively.","creator":"Yuesheng Xu, Taishan Zeng"},{"id":"2309.07405","slug":"funcodec-a-fundamental-reproducible-and-integrable-open-source-toolkit-for-neural-speech-codec-arxiv-2309-07405v1-cs-sd","title":"FunCodec: A Fundamental, Reproducible and Integrable Open-source Toolkit for Neural Speech Codec.","link":"http://arxiv.org/abs/2309.07405","abstract":"This paper presents FunCodec, a fundamental neural speech codec toolkit, which is an extension of the open-source speech processing toolkit FunASR. FunCodec provides reproducible training recipes and inference scripts for the latest neural speech codec models, such as SoundStream and Encodec. Thanks to the unified design with FunASR, FunCodec can be easily integrated into downstream tasks, such as speech recognition. Along with FunCodec, pre-trained models are also provided, which can be used for academic or generalized purposes. Based on the toolkit, we further propose the frequency-domain codec models, FreqCodec, which can achieve comparable speech quality with much lower computation and parameter complexity. Experimental results show that, under the same compression ratio, FunCodec can achieve better reconstruction quality compared with other toolkits and released models. We also demonstrate that the pre-trained models are suitable for downstream tasks, including automatic speech recognition and personalized text-to-speech synthesis. This toolkit is publicly available at https://github.com/alibaba-damo-academy/FunCodec.","creator":"Zhihao Du, Shiliang Zhang, Kai Hu, Siqi Zheng"},{"id":"2309.07415","slug":"client-side-gradient-inversion-against-federated-learning-from-poisoning-arxiv-2309-07415v1-cs-cr","title":"Client-side Gradient Inversion Against Federated Learning from Poisoning.","link":"http://arxiv.org/abs/2309.07415","abstract":"Federated Learning (FL) enables distributed participants (e.g., mobile devices) to train a global model without sharing data directly to a central server. Recent studies have revealed that FL is vulnerable to gradient inversion attack (GIA), which aims to reconstruct the original training samples and poses high risk against the privacy of clients in FL. However, most existing GIAs necessitate control over the server and rely on strong prior knowledge including batch normalization and data distribution information. In this work, we propose Client-side poisoning Gradient Inversion (CGI), which is a novel attack method that can be launched from clients. For the first time, we show the feasibility of a client-side adversary with limited knowledge being able to recover the training samples from the aggregated global model. We take a distinct approach in which the adversary utilizes a malicious model that amplifies the loss of a specific targeted class of interest. When honest clients employ the poisoned global model, the gradients of samples belonging to the targeted class are magnified, making them the dominant factor in the aggregated update. This enables the adversary to effectively reconstruct the private input belonging to other clients using the aggregated update. In addition, our CGI also features its ability to remain stealthy against Byzantine-robust aggregation rules (AGRs). By optimizing malicious updates and blending benign updates with a malicious replacement vector, our method remains undetected by these defense mechanisms. To evaluate the performance of CGI, we conduct experiments on various benchmark datasets, considering representative Byzantine-robust AGRs, and exploring diverse FL settings with different levels of adversary knowledge about the data. Our results demonstrate that CGI consistently and successfully extracts training input in all tested scenarios.","creator":"Jiaheng Wei, Yanjun Zhang, Leo Yu Zhang, Chao Chen, Shirui Pan, Kok-Leong Ong, Jun Zhang, Yang Xiang"},{"id":"2309.07425","slug":"jsmnet-improving-indoor-point-cloud-semantic-and-instance-segmentation-through-self-attention-and-multiscale-arxiv-2309-07425v1-cs-cv","title":"JSMNet Improving Indoor Point Cloud Semantic and Instance Segmentation through Self-Attention and Multiscale.","link":"http://arxiv.org/abs/2309.07425","abstract":"The semantic understanding of indoor 3D point cloud data is crucial for a range of subsequent applications, including indoor service robots, navigation systems, and digital twin engineering. Global features are crucial for achieving high-quality semantic and instance segmentation of indoor point clouds, as they provide essential long-range context information. To this end, we propose JSMNet, which combines a multi-layer network with a global feature self-attention module to jointly segment three-dimensional point cloud semantics and instances. To better express the characteristics of indoor targets, we have designed a multi-resolution feature adaptive fusion module that takes into account the differences in point cloud density caused by varying scanner distances from the target. Additionally, we propose a framework for joint semantic and instance segmentation by integrating semantic and instance features to achieve superior results. We conduct experiments on S3DIS, which is a large three-dimensional indoor point cloud dataset. Our proposed method is compared against other methods, and the results show that it outperforms existing methods in semantic and instance segmentation and provides better results in target local area segmentation. Specifically, our proposed method outperforms PointNet (Qi et al., 2017a) by 16.0% and 26.3% in terms of semantic segmentation mIoU in S3DIS (Area 5) and instance segmentation mPre, respectively. Additionally, it surpasses ASIS (Wang et al., 2019) by 6.0% and 4.6%, respectively, as well as JSPNet (Chen et al., 2022) by a margin of 3.3% for semantic segmentation mIoU and a slight improvement of 0.3% for instance segmentation mPre.","creator":"Shuochen Xu, Zhenxin Zhang"},{"id":"2309.07429","slug":"semantic-parsing-in-limited-resource-conditions-arxiv-2309-07429v1-cs-cl","title":"Semantic Parsing in Limited Resource Conditions.","link":"http://arxiv.org/abs/2309.07429","abstract":"This thesis explores challenges in semantic parsing, specifically focusing on scenarios with limited data and computational resources. It offers solutions using techniques like automatic data curation, knowledge transfer, active learning, and continual learning.  For tasks with no parallel training data, the thesis proposes generating synthetic training examples from structured database schemas. When there is abundant data in a source domain but limited parallel data in a target domain, knowledge from the source is leveraged to improve parsing in the target domain.  For multilingual situations with limited data in the target languages, the thesis introduces a method to adapt parsers using a limited human translation budget. Active learning is applied to select source-language samples for manual translation, maximizing parser performance in the target language. In addition, an alternative method is also proposed to utilize machine translation services, supplemented by human-translated data, to train a more effective parser.  When computational resources are limited, a continual learning approach is introduced to minimize training time and computational memory. This maintains the parser's efficiency in previously learned tasks while adapting it to new tasks, mitigating the problem of catastrophic forgetting.  Overall, the thesis provides a comprehensive set of methods to improve semantic parsing in resource-constrained conditions.","creator":"Zhuang Li"},{"id":"2309.07438","slug":"towards-artificial-general-intelligence-agi-in-the-internet-of-things-iot-opportunities-and-challenges-arxiv-2309-07438v1-cs-ai","title":"Towards Artificial General Intelligence (AGI) in the Internet of Things (IoT): Opportunities and Challenges.","link":"http://arxiv.org/abs/2309.07438","abstract":"Artificial General Intelligence (AGI), possessing the capacity to comprehend, learn, and execute tasks with human cognitive abilities, engenders significant anticipation and intrigue across scientific, commercial, and societal arenas. This fascination extends particularly to the Internet of Things (IoT), a landscape characterized by the interconnection of countless devices, sensors, and systems, collectively gathering and sharing data to enable intelligent decision-making and automation. This research embarks on an exploration of the opportunities and challenges towards achieving AGI in the context of the IoT. Specifically, it starts by outlining the fundamental principles of IoT and the critical role of Artificial Intelligence (AI) in IoT systems. Subsequently, it delves into AGI fundamentals, culminating in the formulation of a conceptual framework for AGI's seamless integration within IoT. The application spectrum for AGI-infused IoT is broad, encompassing domains ranging from smart grids, residential environments, manufacturing, and transportation to environmental monitoring, agriculture, healthcare, and education. However, adapting AGI to resource-constrained IoT settings necessitates dedicated research efforts. Furthermore, the paper addresses constraints imposed by limited computing resources, intricacies associated with large-scale IoT communication, as well as the critical concerns pertaining to security and privacy.","creator":"Fei Dou, Jin Ye, Geng Yuan, Qin Lu, Wei Niu, Haijian Sun, Le Guan, Guoyu Lu, Gengchen Mai, Ninghao Liu, Jin Lu, Zhengliang Liu, Zihao Wu, Chenjiao Tan, Shaochen Xu, Xianqiao Wang, Guoming Li, Lilong Chai, Sheng Li, Jin Sun, Hongyue Sun, Yunli Shao, Changying Li, Tianming Liu, Wenzhan Song"},{"id":"2309.07461","slug":"detecting-unknown-attacks-in-iot-environments-an-open-set-classifier-for-enhanced-network-intrusion-detection-arxiv-2309-07461v1-cs-cr","title":"Detecting Unknown Attacks in IoT Environments: An Open Set Classifier for Enhanced Network Intrusion Detection.","link":"http://arxiv.org/abs/2309.07461","abstract":"The widespread integration of Internet of Things (IoT) devices across all facets of life has ushered in an era of interconnectedness, creating new avenues for cybersecurity challenges and underscoring the need for robust intrusion detection systems. However, traditional security systems are designed with a closed-world perspective and often face challenges in dealing with the ever-evolving threat landscape, where new and unfamiliar attacks are constantly emerging. In this paper, we introduce a framework aimed at mitigating the open set recognition (OSR) problem in the realm of Network Intrusion Detection Systems (NIDS) tailored for IoT environments. Our framework capitalizes on image-based representations of packet-level data, extracting spatial and temporal patterns from network traffic. Additionally, we integrate stacking and sub-clustering techniques, enabling the identification of unknown attacks by effectively modeling the complex and diverse nature of benign behavior. The empirical results prominently underscore the framework's efficacy, boasting an impressive 88\\% detection rate for previously unseen attacks when compared against existing approaches and recent advancements. Future work will perform extensive experimentation across various openness levels and attack scenarios, further strengthening the adaptability and performance of our proposed solution in safeguarding IoT environments.","creator":"Yasir Ali Farrukh, Syed Wali, Irfan Khan, Nathaniel D. Bastian"},{"id":"2309.07473","slug":"where2explore-few-shot-affordance-learning-for-unseen-novel-categories-of-articulated-objects-arxiv-2309-07473v1-cs-ro","title":"Where2Explore: Few-shot Affordance Learning for Unseen Novel Categories of Articulated Objects.","link":"http://arxiv.org/abs/2309.07473","abstract":"Articulated object manipulation is a fundamental yet challenging task in robotics. Due to significant geometric and semantic variations across object categories, previous manipulation models struggle to generalize to novel categories. Few-shot learning is a promising solution for alleviating this issue by allowing robots to perform a few interactions with unseen objects. However, extant approaches often necessitate costly and inefficient test-time interactions with each unseen instance. Recognizing this limitation, we observe that despite their distinct shapes, different categories often share similar local geometries essential for manipulation, such as pullable handles and graspable edges - a factor typically underutilized in previous few-shot learning works. To harness this commonality, we introduce 'Where2Explore', an affordance learning framework that effectively explores novel categories with minimal interactions on a limited number of instances. Our framework explicitly estimates the geometric similarity across different categories, identifying local areas that differ from shapes in the training categories for efficient exploration while concurrently transferring affordance knowledge to similar parts of the objects. Extensive experiments in simulated and real-world environments demonstrate our framework's capacity for efficient few-shot exploration and generalization.","creator":"Chuanruo Ning, Ruihai Wu, Haoran Lu, Kaichun Mo, Hao Dong"},{"id":"2309.07495","slug":"hdtr-net-a-real-time-high-definition-teeth-restoration-network-for-arbitrary-talking-face-generation-methods-arxiv-2309-07495v1-cs-cv","title":"HDTR-Net: A Real-Time High-Definition Teeth Restoration Network for Arbitrary Talking Face Generation Methods.","link":"http://arxiv.org/abs/2309.07495","abstract":"Talking Face Generation (TFG) aims to reconstruct facial movements to achieve high natural lip movements from audio and facial features that are under potential connections. Existing TFG methods have made significant advancements to produce natural and realistic images. However, most work rarely takes visual quality into consideration. It is challenging to ensure lip synchronization while avoiding visual quality degradation in cross-modal generation methods. To address this issue, we propose a universal High-Definition Teeth Restoration Network, dubbed HDTR-Net, for arbitrary TFG methods. HDTR-Net can enhance teeth regions at an extremely fast speed while maintaining synchronization, and temporal consistency. In particular, we propose a Fine-Grained Feature Fusion (FGFF) module to effectively capture fine texture feature information around teeth and surrounding regions, and use these features to fine-grain the feature map to enhance the clarity of teeth. Extensive experiments show that our method can be adapted to arbitrary TFG methods without suffering from lip synchronization and frame coherence. Another advantage of HDTR-Net is its real-time generation ability. Also under the condition of high-definition restoration of talking face video synthesis, its inference speed is $300\\%$ faster than the current state-of-the-art face restoration based on super-resolution.","creator":"Yongyuan Li, Xiuyuan Qin, Chao Liang, Mingqiang Wei"},{"id":"2309.07504","slug":"connected-autonomous-vehicle-motion-planning-with-video-predictions-from-smart-self-supervised-infrastructure-arxiv-2309-07504v1-cs-ro","title":"Connected Autonomous Vehicle Motion Planning with Video Predictions from Smart, Self-Supervised Infrastructure.","link":"http://arxiv.org/abs/2309.07504","abstract":"Connected autonomous vehicles (CAVs) promise to enhance safety, efficiency, and sustainability in urban transportation. However, this is contingent upon a CAV correctly predicting the motion of surrounding agents and planning its own motion safely. Doing so is challenging in complex urban environments due to frequent occlusions and interactions among many agents. One solution is to leverage smart infrastructure to augment a CAV's situational awareness; the present work leverages a recently proposed \"Self-Supervised Traffic Advisor\" (SSTA) framework of smart sensors that teach themselves to generate and broadcast useful video predictions of road users. In this work, SSTA predictions are modified to predict future occupancy instead of raw video, which reduces the data footprint of broadcast predictions. The resulting predictions are used within a planning framework, demonstrating that this design can effectively aid CAV motion planning. A variety of numerical experiments study the key factors that make SSTA outputs useful for practical CAV planning in crowded urban environments.","creator":"Jiankai Sun, Shreyas Kousik, David Fridovich-Keil, Mac Schwager"},{"id":"2309.07510","slug":"learning-environment-aware-affordance-for-3d-articulated-object-manipulation-under-occlusions-arxiv-2309-07510v1-cs-ro","title":"Learning Environment-Aware Affordance for 3D Articulated Object Manipulation under Occlusions.","link":"http://arxiv.org/abs/2309.07510","abstract":"Perceiving and manipulating 3D articulated objects in diverse environments is essential for home-assistant robots. Recent studies have shown that point-level affordance provides actionable priors for downstream manipulation tasks. However, existing works primarily focus on single-object scenarios with homogeneous agents, overlooking the realistic constraints imposed by the environment and the agent's morphology, e.g., occlusions and physical limitations. In this paper, we propose an environment-aware affordance framework that incorporates both object-level actionable priors and environment constraints. Unlike object-centric affordance approaches, learning environment-aware affordance faces the challenge of combinatorial explosion due to the complexity of various occlusions, characterized by their quantities, geometries, positions and poses. To address this and enhance data efficiency, we introduce a novel contrastive affordance learning framework capable of training on scenes containing a single occluder and generalizing to scenes with complex occluder combinations. Experiments demonstrate the effectiveness of our proposed approach in learning affordance considering environment constraints.","creator":"Kai Cheng, Ruihai Wu, Yan Shen, Chuanruo Ning, Guanqi Zhan, Hao Dong"},{"id":"2309.07525","slug":"singfake-singing-voice-deepfake-detection-arxiv-2309-07525v1-cs-sd","title":"SingFake: Singing Voice Deepfake Detection.","link":"http://arxiv.org/abs/2309.07525","abstract":"The rise of singing voice synthesis presents critical challenges to artists and industry stakeholders over unauthorized voice usage. Unlike synthesized speech, synthesized singing voices are typically released in songs containing strong background music that may hide synthesis artifacts. Additionally, singing voices present different acoustic and linguistic characteristics from speech utterances. These unique properties make singing voice deepfake detection a relevant but significantly different problem from synthetic speech detection. In this work, we propose the singing voice deepfake detection task. We first present SingFake, the first curated in-the-wild dataset consisting of 28.93 hours of bonafide and 29.40 hours of deepfake song clips in five languages from 40 singers. We provide a train/val/test split where the test sets include various scenarios. We then use SingFake to evaluate four state-of-the-art speech countermeasure systems trained on speech utterances. We find these systems lag significantly behind their performance on speech test data. When trained on SingFake, either using separated vocal tracks or song mixtures, these systems show substantial improvement. However, our evaluations also identify challenges associated with unseen singers, communication codecs, languages, and musical contexts, calling for dedicated research into singing voice deepfake detection. The SingFake dataset and related resources are available online.","creator":"Yongyi Zang, You Zhang, Mojtaba Heydari, Zhiyao Duan"},{"id":"2309.07566","slug":"speech-to-speech-translation-with-discrete-unit-based-style-transfer-arxiv-2309-07566v1-cs-sd","title":"Speech-to-Speech Translation with Discrete-Unit-Based Style Transfer.","link":"http://arxiv.org/abs/2309.07566","abstract":"Direct speech-to-speech translation (S2ST) with discrete self-supervised representations has achieved remarkable accuracy, but is unable to preserve the speaker timbre of the source speech during translation. Meanwhile, the scarcity of high-quality speaker-parallel data poses a challenge for learning style transfer between source and target speech. We propose an S2ST framework with an acoustic language model based on discrete units from a self-supervised model and a neural codec for style transfer. The acoustic language model leverages self-supervised in-context learning, acquiring the ability for style transfer without relying on any speaker-parallel data, thereby overcoming the issue of data scarcity. By using extensive training data, our model achieves zero-shot cross-lingual style transfer on previously unseen source languages. Experiments show that our model generates translated speeches with high fidelity and style similarity. Audio samples are available at this http URL .","creator":"Yongqi Wang, Jionghao Bai, Rongjie Huang, Ruiqi Li, Zhiqing Hong, Zhou Zhao"},{"id":"2309.07578","slug":"equivariant-data-augmentation-for-generalization-in-offline-reinforcement-learning-arxiv-2309-07578v1-cs-lg","title":"Equivariant Data Augmentation for Generalization in Offline Reinforcement Learning.","link":"http://arxiv.org/abs/2309.07578","abstract":"We present a novel approach to address the challenge of generalization in offline reinforcement learning (RL), where the agent learns from a fixed dataset without any additional interaction with the environment. Specifically, we aim to improve the agent's ability to generalize to out-of-distribution goals. To achieve this, we propose to learn a dynamics model and check if it is equivariant with respect to a fixed type of transformation, namely translations in the state space. We then use an entropy regularizer to increase the equivariant set and augment the dataset with the resulting transformed samples. Finally, we learn a new policy offline based on the augmented dataset, with an off-the-shelf offline RL algorithm. Our experimental results demonstrate that our approach can greatly improve the test performance of the policy on the considered environments.","creator":"Cristina Pinneri, Sarah Bechtle, Markus Wulfmeier, Arunkumar Byravan, Jingwei Zhang, William F. Whitney, Martin Riedmiller"},{"id":"2309.07593","slug":"statistically-valid-variable-importance-assessment-through-conditional-permutations-arxiv-2309-07593v1-cs-lg","title":"Statistically Valid Variable Importance Assessment through Conditional Permutations.","link":"http://arxiv.org/abs/2309.07593","abstract":"Variable importance assessment has become a crucial step in machine-learning applications when using complex learners, such as deep neural networks, on large-scale data. Removal-based importance assessment is currently the reference approach, particularly when statistical guarantees are sought to justify variable inclusion. It is often implemented with variable permutation schemes. On the flip side, these approaches risk misidentifying unimportant variables as important in the presence of correlations among covariates. Here we develop a systematic approach for studying Conditional Permutation Importance (CPI) that is model agnostic and computationally lean, as well as reusable benchmarks of state-of-the-art variable importance estimators. We show theoretically and empirically that $\\textit{CPI}$ overcomes the limitations of standard permutation importance by providing accurate type-I error control. When used with a deep neural network, $\\textit{CPI}$ consistently showed top accuracy across benchmarks. An empirical benchmark on real-world data analysis in a large-scale medical dataset showed that $\\textit{CPI}$ provides a more parsimonious selection of statistically significant variables. Our results suggest that $\\textit{CPI}$ can be readily used as drop-in replacement for permutation-based methods.","creator":"Ahmad Chamma (1 and 2 and 3), Denis A. Engemann (4), Bertrand Thirion (1 and 2 and 3) ((1) Inria, (2) Universite Paris Saclay, (3) CEA, (4) Roche Pharma Research and Early Development, Neuroscience and Rare Diseases, Roche Innovation Center Basel, F. Hoffmann-La Roche Ltd., Basel, Switzerland)"},{"id":"2309.07594","slug":"neuro-symbolic-recommendation-model-based-on-logic-query-arxiv-2309-07594v1-cs-ai","title":"Neuro-Symbolic Recommendation Model based on Logic Query.","link":"http://arxiv.org/abs/2309.07594","abstract":"A recommendation system assists users in finding items that are relevant to them. Existing recommendation models are primarily based on predicting relationships between users and items and use complex matching models or incorporate extensive external information to capture association patterns in data. However, recommendation is not only a problem of inductive statistics using data; it is also a cognitive task of reasoning decisions based on knowledge extracted from information. Hence, a logic system could naturally be incorporated for the reasoning in a recommendation task. However, although hard-rule approaches based on logic systems can provide powerful reasoning ability, they struggle to cope with inconsistent and incomplete knowledge in real-world tasks, especially for complex tasks such as recommendation. Therefore, in this paper, we propose a neuro-symbolic recommendation model, which transforms the user history interactions into a logic expression and then transforms the recommendation prediction into a query task based on this logic expression. The logic expressions are then computed based on the modular logic operations of the neural network. We also construct an implicit logic encoder to reasonably reduce the complexity of the logic computation. Finally, a user's interest items can be queried in the vector space based on the computation results. Experiments on three well-known datasets verified that our method performs better compared to state of the art shallow, deep, session, and reasoning models.","creator":"Maonian Wu, Bang Chen, Shaojun Zhu, Bo Zheng, Wei Peng, Mingyi Zhang"},{"id":"2309.07597","slug":"c-pack-packaged-resources-to-advance-general-chinese-embedding-arxiv-2309-07597v1-cs-cl","title":"C-Pack: Packaged Resources To Advance General Chinese Embedding.","link":"http://arxiv.org/abs/2309.07597","abstract":"We introduce C-Pack, a package of resources that significantly advance the field of general Chinese embeddings. C-Pack includes three critical resources. 1) C-MTEB is a comprehensive benchmark for Chinese text embeddings covering 6 tasks and 35 datasets. 2) C-MTP is a massive text embedding dataset curated from labeled and unlabeled Chinese corpora for training embedding models. 3) C-TEM is a family of embedding models covering multiple sizes. Our models outperform all prior Chinese text embeddings on C-MTEB by up to +10% upon the time of the release. We also integrate and optimize the entire suite of training methods for C-TEM. Along with our resources on general Chinese embedding, we release our data and models for English text embeddings. The English models achieve state-of-the-art performance on MTEB benchmark; meanwhile, our released English data is 2 times larger than the Chinese data. All these resources are made publicly available at https://github.com/FlagOpen/FlagEmbedding.","creator":"Shitao Xiao, Zheng Liu, Peitian Zhang, Niklas Muennighof"},{"id":"2309.07601","slug":"detecting-misinformation-with-llm-predicted-credibility-signals-and-weak-supervision-arxiv-2309-07601v1-cs-cl","title":"Detecting Misinformation with LLM-Predicted Credibility Signals and Weak Supervision.","link":"http://arxiv.org/abs/2309.07601","abstract":"Credibility signals represent a wide range of heuristics that are typically used by journalists and fact-checkers to assess the veracity of online content. Automating the task of credibility signal extraction, however, is very challenging as it requires high-accuracy signal-specific extractors to be trained, while there are currently no sufficiently large datasets annotated with all credibility signals. This paper investigates whether large language models (LLMs) can be prompted effectively with a set of 18 credibility signals to produce weak labels for each signal. We then aggregate these potentially noisy labels using weak supervision in order to predict content veracity. We demonstrate that our approach, which combines zero-shot LLM credibility signal labeling and weak supervision, outperforms state-of-the-art classifiers on two misinformation datasets without using any ground-truth labels for training. We also analyse the contribution of the individual credibility signals towards predicting content veracity, which provides new valuable insights into their role in misinformation detection.","creator":"Jo&#xe3;o A. Leite, Olesya Razuvayevskaya, Kalina Bontcheva, Carolina Scarton"},{"id":"2309.07602","slug":"turning-dross-into-gold-loss-is-bert4rec-really-better-than-sasrec-arxiv-2309-07602v1-cs-ir","title":"Turning Dross Into Gold Loss: is BERT4Rec really better than SASRec?.","link":"http://arxiv.org/abs/2309.07602","abstract":"Recently sequential recommendations and next-item prediction task has become increasingly popular in the field of recommender systems. Currently, two state-of-the-art baselines are Transformer-based models SASRec and BERT4Rec. Over the past few years, there have been quite a few publications comparing these two algorithms and proposing new state-of-the-art models. In most of the publications, BERT4Rec achieves better performance than SASRec. But BERT4Rec uses cross-entropy over softmax for all items, while SASRec uses negative sampling and calculates binary cross-entropy loss for one positive and one negative item. In our work, we show that if both models are trained with the same loss, which is used by BERT4Rec, then SASRec will significantly outperform BERT4Rec both in terms of quality and training speed. In addition, we show that SASRec could be effectively trained with negative sampling and still outperform BERT4Rec, but the number of negative examples should be much larger than one.","creator":"Anton Klenitskiy, Alexey Vasilev"},{"id":"2309.07610","slug":"feature-engineering-in-learning-to-rank-for-community-question-answering-task-arxiv-2309-07610v1-cs-lg","title":"Feature Engineering in Learning-to-Rank for Community Question Answering Task.","link":"http://arxiv.org/abs/2309.07610","abstract":"Community question answering (CQA) forums are Internet-based platforms where users ask questions about a topic and other expert users try to provide solutions. Many CQA forums such as Quora, Stackoverflow, Yahoo!Answer, StackExchange exist with a lot of user-generated data. These data are leveraged in automated CQA ranking systems where similar questions (and answers) are presented in response to the query of the user. In this work, we empirically investigate a few aspects of this domain. Firstly, in addition to traditional features like TF-IDF, BM25 etc., we introduce a BERT-based feature that captures the semantic similarity between the question and answer. Secondly, most of the existing research works have focused on features extracted only from the question part; features extracted from answers have not been explored extensively. We combine both types of features in a linear fashion. Thirdly, using our proposed concepts, we conduct an empirical investigation with different rank-learning algorithms, some of which have not been used so far in CQA domain. On three standard CQA datasets, our proposed framework achieves state-of-the-art performance. We also analyze importance of the features we use in our investigation. This work is expected to guide the practitioners to select a better set of features for the CQA retrieval task.","creator":"Nafis Sajid, Md Rashidul Hasan, Muhammad Ibrahim"},{"id":"2309.07666","slug":"multi-source-domain-adaptation-meets-dataset-distillation-through-dataset-dictionary-learning-arxiv-2309-07666v1-cs-lg","title":"Multi-Source Domain Adaptation meets Dataset Distillation through Dataset Dictionary Learning.","link":"http://arxiv.org/abs/2309.07666","abstract":"In this paper, we consider the intersection of two problems in machine learning: Multi-Source Domain Adaptation (MSDA) and Dataset Distillation (DD). On the one hand, the first considers adapting multiple heterogeneous labeled source domains to an unlabeled target domain. On the other hand, the second attacks the problem of synthesizing a small summary containing all the information about the datasets. We thus consider a new problem called MSDA-DD. To solve it, we adapt previous works in the MSDA literature, such as Wasserstein Barycenter Transport and Dataset Dictionary Learning, as well as DD method Distribution Matching. We thoroughly experiment with this novel problem on four benchmarks (Caltech-Office 10, Tennessee-Eastman Process, Continuous Stirred Tank Reactor, and Case Western Reserve University), where we show that, even with as little as 1 sample per class, one achieves state-of-the-art adaptation performance.","creator":"Eduardo Fernandes Montesuma, Fred Ngol&#xe8; Mboula, Antoine Souloumiac"},{"id":"2309.07670","slug":"federated-dataset-dictionary-learning-for-multi-source-domain-adaptation-arxiv-2309-07670v1-cs-lg","title":"Federated Dataset Dictionary Learning for Multi-Source Domain Adaptation.","link":"http://arxiv.org/abs/2309.07670","abstract":"In this article, we propose an approach for federated domain adaptation, a setting where distributional shift exists among clients and some have unlabeled data. The proposed framework, FedDaDiL, tackles the resulting challenge through dictionary learning of empirical distributions. In our setting, clients' distributions represent particular domains, and FedDaDiL collectively trains a federated dictionary of empirical distributions. In particular, we build upon the Dataset Dictionary Learning framework by designing collaborative communication protocols and aggregation operations. The chosen protocols keep clients' data private, thus enhancing overall privacy compared to its centralized counterpart. We empirically demonstrate that our approach successfully generates labeled data on the target domain with extensive experiments on (i) Caltech-Office, (ii) TEP, and (iii) CWRU benchmarks. Furthermore, we compare our method to its centralized counterpart and other benchmarks in federated domain adaptation.","creator":"Fabiola Espinosa Castellon, Eduardo Fernandes Montesuma, Fred Ngol&#xe8; Mboula, Aur&#xe9;lien Mayoue, Antoine Souloumiac, C&#xe9;dric Gouy-Pallier"},{"id":"2309.07683","slug":"assessing-the-nature-of-large-language-models-a-caution-against-anthropocentrism-arxiv-2309-07683v1-cs-ai","title":"Assessing the nature of large language models: A caution against anthropocentrism.","link":"http://arxiv.org/abs/2309.07683","abstract":"Generative AI models garnered a large amount of public attention and speculation with the release of OpenAIs chatbot, ChatGPT. At least two opinion camps exist: one excited about possibilities these models offer for fundamental changes to human tasks, and another highly concerned about power these models seem to have. To address these concerns, we assessed GPT3.5 using standard, normed, and validated cognitive and personality measures. For this seedling project, we developed a battery of tests that allowed us to estimate the boundaries of some of these models capabilities, how stable those capabilities are over a short period of time, and how they compare to humans.  Our results indicate that GPT 3.5 is unlikely to have developed sentience, although its ability to respond to personality inventories is interesting. It did display large variability in both cognitive and personality measures over repeated observations, which is not expected if it had a human-like personality. Variability notwithstanding, GPT3.5 displays what in a human would be considered poor mental health, including low self-esteem and marked dissociation from reality despite upbeat and helpful responses.","creator":"Ann Speed"},{"id":"2309.07684","slug":"deepfdenet-a-novel-neural-network-architecture-for-solving-fractional-differential-equations-arxiv-2309-07684v1-cs-lg","title":"deepFDEnet: A Novel Neural Network Architecture for Solving Fractional Differential Equations.","link":"http://arxiv.org/abs/2309.07684","abstract":"The primary goal of this research is to propose a novel architecture for a deep neural network that can solve fractional differential equations accurately. A Gaussian integration rule and a $L_1$ discretization technique are used in the proposed design. In each equation, a deep neural network is used to approximate the unknown function. Three forms of fractional differential equations have been examined to highlight the method's versatility: a fractional ordinary differential equation, a fractional order integrodifferential equation, and a fractional order partial differential equation. The results show that the proposed architecture solves different forms of fractional differential equations with excellent precision.","creator":"Ali Nosrati Firoozsalari, Hassan Dana Mazraeh, Alireza Afzal Aghaei, Kourosh Parand"},{"id":"2309.07689","slug":"detecting-chatgpt-a-survey-of-the-state-of-detecting-chatgpt-generated-text-arxiv-2309-07689v1-cs-cl","title":"Detecting ChatGPT: A Survey of the State of Detecting ChatGPT-Generated Text.","link":"http://arxiv.org/abs/2309.07689","abstract":"While recent advancements in the capabilities and widespread accessibility of generative language models, such as ChatGPT (OpenAI, 2022), have brought about various benefits by generating fluent human-like text, the task of distinguishing between human- and large language model (LLM) generated text has emerged as a crucial problem. These models can potentially deceive by generating artificial text that appears to be human-generated. This issue is particularly significant in domains such as law, education, and science, where ensuring the integrity of text is of the utmost importance. This survey provides an overview of the current approaches employed to differentiate between texts generated by humans and ChatGPT. We present an account of the different datasets constructed for detecting ChatGPT-generated text, the various methods utilized, what qualitative analyses into the characteristics of human versus ChatGPT-generated text have been performed, and finally, summarize our findings into general insights","creator":"Mahdi Dhaini, Wessel Poelman, Ege Erdogan"},{"id":"2309.07694","slug":"tree-of-uncertain-thoughts-reasoning-for-large-language-models-arxiv-2309-07694v1-cs-cl","title":"Tree of Uncertain Thoughts Reasoning for Large Language Models.","link":"http://arxiv.org/abs/2309.07694","abstract":"While the recently introduced Tree of Thoughts (ToT) has heralded advancements in allowing Large Language Models (LLMs) to reason through foresight and backtracking for global decision-making, it has overlooked the inherent local uncertainties in intermediate decision points or \"thoughts\". These local uncertainties, intrinsic to LLMs given their potential for diverse responses, remain a significant concern in the reasoning process. Addressing this pivotal gap, we introduce the Tree of Uncertain Thoughts (TouT) - a reasoning framework tailored for LLMs. Our TouT effectively leverages Monte Carlo Dropout to quantify uncertainty scores associated with LLMs' diverse local responses at these intermediate steps. By marrying this local uncertainty quantification with global search algorithms, TouT enhances the model's precision in response generation. We substantiate our approach with rigorous experiments on two demanding planning tasks: Game of 24 and Mini Crosswords. The empirical evidence underscores TouT's superiority over both ToT and chain-of-thought prompting methods.","creator":"Shentong Mo, Miao Xin"},{"id":"2309.07704","slug":"nutritionverse-empirical-study-of-various-dietary-intake-estimation-approaches-arxiv-2309-07704v1-cs-cv","title":"NutritionVerse: Empirical Study of Various Dietary Intake Estimation Approaches.","link":"http://arxiv.org/abs/2309.07704","abstract":"Accurate dietary intake estimation is critical for informing policies and programs to support healthy eating, as malnutrition has been directly linked to decreased quality of life. However self-reporting methods such as food diaries suffer from substantial bias. Other conventional dietary assessment techniques and emerging alternative approaches such as mobile applications incur high time costs and may necessitate trained personnel. Recent work has focused on using computer vision and machine learning to automatically estimate dietary intake from food images, but the lack of comprehensive datasets with diverse viewpoints, modalities and food annotations hinders the accuracy and realism of such methods. To address this limitation, we introduce NutritionVerse-Synth, the first large-scale dataset of 84,984 photorealistic synthetic 2D food images with associated dietary information and multimodal annotations (including depth images, instance masks, and semantic masks). Additionally, we collect a real image dataset, NutritionVerse-Real, containing 889 images of 251 dishes to evaluate realism. Leveraging these novel datasets, we develop and benchmark NutritionVerse, an empirical study of various dietary intake estimation approaches, including indirect segmentation-based and direct prediction networks. We further fine-tune models pretrained on synthetic data with real images to provide insights into the fusion of synthetic and real data. Finally, we release both datasets (NutritionVerse-Synth, NutritionVerse-Real) on https://www.kaggle.com/nutritionverse/datasets as part of an open initiative to accelerate machine learning for dietary sensing.","creator":"Chi-en Amy Tai, Matthew Keller, Saeejith Nair, Yuhao Chen, Yifan Wu, Olivia Markham, Krish Parmar, Pengcheng Xi, Heather Keller, Sharon Kirkpatrick, Alexander Wong"},{"id":"2309.07730","slug":"aidps-adaptive-intrusion-detection-and-prevention-system-for-underwater-acoustic-sensor-networks-arxiv-2309-07730v1-cs-cr","title":"AIDPS:Adaptive Intrusion Detection and Prevention System for Underwater Acoustic Sensor Networks.","link":"http://arxiv.org/abs/2309.07730","abstract":"Underwater Acoustic Sensor Networks (UW-ASNs) are predominantly used for underwater environments and find applications in many areas. However, a lack of security considerations, the unstable and challenging nature of the underwater environment, and the resource-constrained nature of the sensor nodes used for UW-ASNs (which makes them incapable of adopting security primitives) make the UW-ASN prone to vulnerabilities. This paper proposes an Adaptive decentralised Intrusion Detection and Prevention System called AIDPS for UW-ASNs. The proposed AIDPS can improve the security of the UW-ASNs so that they can efficiently detect underwater-related attacks (e.g., blackhole, grayhole and flooding attacks). To determine the most effective configuration of the proposed construction, we conduct a number of experiments using several state-of-the-art machine learning algorithms (e.g., Adaptive Random Forest (ARF), light gradient-boosting machine, and K-nearest neighbours) and concept drift detection algorithms (e.g., ADWIN, kdqTree, and Page-Hinkley). Our experimental results show that incremental ARF using ADWIN provides optimal performance when implemented with One-class support vector machine (SVM) anomaly-based detectors. Furthermore, our extensive evaluation results also show that the proposed scheme outperforms state-of-the-art bench-marking methods while providing a wider range of desirable features such as scalability and complexity.","creator":"Soumadeep Das, Aryan Mohammadi Pasikhani, Prosanta Gope, John A. Clark, Chintan Patel, Biplab Sikdar"},{"id":"2309.07755","slug":"generative-ai-text-classification-using-ensemble-llm-approaches-arxiv-2309-07755v1-cs-cl","title":"Generative AI Text Classification using Ensemble LLM Approaches.","link":"http://arxiv.org/abs/2309.07755","abstract":"Large Language Models (LLMs) have shown impressive performance across a variety of Artificial Intelligence (AI) and natural language processing tasks, such as content creation, report generation, etc. However, unregulated malign application of these models can create undesirable consequences such as generation of fake news, plagiarism, etc. As a result, accurate detection of AI-generated language can be crucial in responsible usage of LLMs. In this work, we explore 1) whether a certain body of text is AI generated or written by human, and 2) attribution of a specific language model in generating a body of text. Texts in both English and Spanish are considered. The datasets used in this study are provided as part of the Automated Text Identification (AuTexTification) shared task. For each of the research objectives stated above, we propose an ensemble neural model that generates probabilities from different pre-trained LLMs which are used as features to a Traditional Machine Learning (TML) classifier following it. For the first task of distinguishing between AI and human generated text, our model ranked in fifth and thirteenth place (with macro $F1$ scores of 0.733 and 0.649) for English and Spanish texts, respectively. For the second task on model attribution, our model ranked in first place with macro $F1$ scores of 0.625 and 0.653 for English and Spanish texts, respectively.","creator":"Harika Abburi, Michael Suesserman, Nirmala Pudota, Balaji Veeramani, Edward Bowen, Sanmitra Bhattacharya"},{"id":"2309.07760","slug":"pre-vision-language-prompt-learning-with-reparameterization-encoder-arxiv-2309-07760v1-cs-cv","title":"PRE: Vision-Language Prompt Learning with Reparameterization Encoder.","link":"http://arxiv.org/abs/2309.07760","abstract":"Large pre-trained vision-language models such as CLIP have demonstrated great potential in zero-shot transferability to downstream tasks. However, to attain optimal performance, the manual selection of prompts is necessary to improve alignment between the downstream image distribution and the textual class descriptions. This manual prompt engineering is the major challenge for deploying such models in practice since it requires domain expertise and is extremely time-consuming. To avoid non-trivial prompt engineering, recent work Context Optimization (CoOp) introduced the concept of prompt learning to the vision domain using learnable textual tokens. While CoOp can achieve substantial improvements over manual prompts, its learned context is worse generalizable to wider unseen classes within the same dataset. In this work, we present Prompt Learning with Reparameterization Encoder (PRE) - a simple and efficient method that enhances the generalization ability of the learnable prompt to unseen classes while maintaining the capacity to learn Base classes. Instead of directly optimizing the prompts, PRE employs a prompt encoder to reparameterize the input prompt embeddings, enhancing the exploration of task-specific knowledge from few-shot samples. Experiments and extensive ablation studies on 8 benchmarks demonstrate that our approach is an efficient method for prompt learning. Specifically, PRE achieves a notable enhancement of 5.60% in average accuracy on New classes and 3% in Harmonic mean compared to CoOp in the 16-shot setting, all achieved within a good training time.","creator":"Anh Pham Thi Minh"},{"id":"2309.07770","slug":"variational-quantum-linear-solver-enhanced-quantum-support-vector-machine-arxiv-2309-07770v1-quant-ph","title":"Variational Quantum Linear Solver enhanced Quantum Support Vector Machine.","link":"http://arxiv.org/abs/2309.07770","abstract":"Quantum Support Vector Machines (QSVM) play a vital role in using quantum resources for supervised machine learning tasks, such as classification. However, current methods are strongly limited in terms of scalability on Noisy Intermediate Scale Quantum (NISQ) devices. In this work, we propose a novel approach called the Variational Quantum Linear Solver (VQLS) enhanced QSVM. This is built upon our idea of utilizing the variational quantum linear solver to solve system of linear equations of a least squares-SVM on a NISQ device. The implementation of our approach is evaluated by an extensive series of numerical experiments with the Iris dataset, which consists of three distinct iris plant species. Based on this, we explore the practicality and effectiveness of our algorithm by constructing a classifier capable of classification in a feature space ranging from one to seven dimensions. Furthermore, by strategically exploiting both classical and quantum computing for various subroutines of our algorithm, we effectively mitigate practical challenges associated with the implementation. These include significant improvement in the trainability of the variational ansatz and notable reductions in run-time for cost calculations. Based on the numerical experiments, our approach exhibits the capability of identifying a separating hyperplane in an 8-dimensional feature space. Moreover, it consistently demonstrated strong performance across various instances with the same dataset.","creator":"Jianming Yi, Kalyani Suresh, Ali Moghiseh, Norbert Wehn"},{"id":"2309.07808","slug":"what-matters-to-enhance-traffic-rule-compliance-of-imitation-learning-for-automated-driving-arxiv-2309-07808v1-cs-cv","title":"What Matters to Enhance Traffic Rule Compliance of Imitation Learning for Automated Driving.","link":"http://arxiv.org/abs/2309.07808","abstract":"More research attention has recently been given to end-to-end autonomous driving technologies where the entire driving pipeline is replaced with a single neural network because of its simpler structure and faster inference time. Despite this appealing approach largely reducing the components in driving pipeline, its simplicity also leads to interpretability problems and safety issues arXiv:2003.06404. The trained policy is not always compliant with the traffic rules and it is also hard to discover the reason for the misbehavior because of the lack of intermediate outputs. Meanwhile, Sensors are also critical to autonomous driving's security and feasibility to perceive the surrounding environment under complex driving scenarios. In this paper, we proposed P-CSG, a novel penalty-based imitation learning approach with cross semantics generation sensor fusion technologies to increase the overall performance of End-to-End Autonomous Driving. We conducted an assessment of our model's performance using the Town 05 Long benchmark, achieving an impressive driving score improvement of over 15%. Furthermore, we conducted robustness evaluations against adversarial attacks like FGSM and Dot attacks, revealing a substantial increase in robustness compared to baseline models.More detailed information, such as code-based resources, ablation studies and videos can be found at https://hk-zh.github.io/p-csg-plus.","creator":"Hongkuan Zhou, Aifen Sui, Wei Cao, Letian Shi"},{"id":"2309.07823","slug":"large-scale-weakly-supervised-learning-for-road-extraction-from-satellite-imagery-arxiv-2309-07823v1-cs-cv","title":"Large-scale Weakly Supervised Learning for Road Extraction from Satellite Imagery.","link":"http://arxiv.org/abs/2309.07823","abstract":"Automatic road extraction from satellite imagery using deep learning is a viable alternative to traditional manual mapping. Therefore it has received considerable attention recently. However, most of the existing methods are supervised and require pixel-level labeling, which is tedious and error-prone. To make matters worse, the earth has a diverse range of terrain, vegetation, and man-made objects. It is well known that models trained in one area generalize poorly to other areas. Various shooting conditions such as light and angel, as well as different image processing techniques further complicate the issue. It is impractical to develop training data to cover all image styles. This paper proposes to leverage OpenStreetMap road data as weak labels and large scale satellite imagery to pre-train semantic segmentation models. Our extensive experimental results show that the prediction accuracy increases with the amount of the weakly labeled data, as well as the road density in the areas chosen for training. Using as much as 100 times more data than the widely used DeepGlobe road dataset, our model with the D-LinkNet architecture and the ResNet-50 backbone exceeds the top performer of the current DeepGlobe leaderboard. Furthermore, due to large-scale pre-training, our model generalizes much better than those trained with only the curated datasets, implying great application potential.","creator":"Shiqiao Meng, Zonglin Di, Siwei Yang, Yin Wang"},{"id":"2309.07832","slug":"vapor-holonomic-legged-robot-navigation-in-outdoor-vegetation-using-offline-reinforcement-learning-arxiv-2309-07832v1-cs-ro","title":"VAPOR: Holonomic Legged Robot Navigation in Outdoor Vegetation Using Offline Reinforcement Learning.","link":"http://arxiv.org/abs/2309.07832","abstract":"We present VAPOR, a novel method for autonomous legged robot navigation in unstructured, densely vegetated outdoor environments using Offline Reinforcement Learning (RL). Our method trains a novel RL policy from unlabeled data collected in real outdoor vegetation. This policy uses height and intensity-based cost maps derived from 3D LiDAR point clouds, a goal cost map, and processed proprioception data as state inputs, and learns the physical and geometric properties of the surrounding vegetation such as height, density, and solidity/stiffness for navigation. Instead of using end-to-end policy actions, the fully-trained RL policy's Q network is used to evaluate dynamically feasible robot actions generated from a novel adaptive planner capable of navigating through dense narrow passages and preventing entrapment in vegetation such as tall grass and bushes. We demonstrate our method's capabilities on a legged robot in complex outdoor vegetation. We observe an improvement in success rates, a decrease in average power consumption, and decrease in normalized trajectory length compared to both existing end-to-end offline RL and outdoor navigation methods.","creator":"Kasun Weerakoon, Adarsh Jagan Sathyamoorthy, Mohamed Elnoor, Dinesh Manocha"},{"id":"2309.07841","slug":"two-timin-repairing-smart-contracts-with-a-two-layered-approach-arxiv-2309-07841v1-cs-cr","title":"Two Timin': Repairing Smart Contracts With A Two-Layered Approach.","link":"http://arxiv.org/abs/2309.07841","abstract":"Due to the modern relevance of blockchain technology, smart contracts present both substantial risks and benefits. Vulnerabilities within them can trigger a cascade of consequences, resulting in significant losses. Many current papers primarily focus on classifying smart contracts for malicious intent, often relying on limited contract characteristics, such as bytecode or opcode. This paper proposes a novel, two-layered framework: 1) classifying and 2) directly repairing malicious contracts. Slither's vulnerability report is combined with source code and passed through a pre-trained RandomForestClassifier (RFC) and Large Language Models (LLMs), classifying and repairing each suggested vulnerability. Experiments demonstrate the effectiveness of fine-tuned and prompt-engineered LLMs. The smart contract repair models, built from pre-trained GPT-3.5-Turbo and fine-tuned Llama-2-7B models, reduced the overall vulnerability count by 97.5% and 96.7% respectively. A manual inspection of repaired contracts shows that all retain functionality, indicating that the proposed method is appropriate for automatic batch classification and repair of vulnerabilities in smart contracts.","creator":"Abhinav Jain, Ehan Masud, Michelle Han, Rohan Dhillon, Sumukh Rao, Arya Joshi, Salar Cheema, Saurav Kumar"},{"id":"2309.07843","slug":"applying-deep-learning-to-calibrate-stochastic-volatility-models-arxiv-2309-07843v1-q-fin-cp","title":"Applying Deep Learning to Calibrate Stochastic Volatility Models.","link":"http://arxiv.org/abs/2309.07843","abstract":"Stochastic volatility models, where the volatility is a stochastic process, can capture most of the essential stylized facts of implied volatility surfaces and give more realistic dynamics of the volatility smile or skew. However, they come with the significant issue that they take too long to calibrate.  Alternative calibration methods based on Deep Learning (DL) techniques have been recently used to build fast and accurate solutions to the calibration problem. Huge and Savine developed a Differential Deep Learning (DDL) approach, where Machine Learning models are trained on samples of not only features and labels but also differentials of labels to features. The present work aims to apply the DDL technique to price vanilla European options (i.e. the calibration instruments), more specifically, puts when the underlying asset follows a Heston model and then calibrate the model on the trained network. DDL allows for fast training and accurate pricing. The trained neural network dramatically reduces Heston calibration's computation time.  In this work, we also introduce different regularisation techniques, and we apply them notably in the case of the DDL. We compare their performance in reducing overfitting and improving the generalisation error. The DDL performance is also compared to the classical DL (without differentiation) one in the case of Feed-Forward Neural Networks. We show that the DDL outperforms the DL.","creator":"Abir Sridi, Paul Bilokon"},{"id":"2309.07852","slug":"expertqa-expert-curated-questions-and-attributed-answers-arxiv-2309-07852v1-cs-cl","title":"ExpertQA: Expert-Curated Questions and Attributed Answers.","link":"http://arxiv.org/abs/2309.07852","abstract":"As language models are adapted by a more sophisticated and diverse set of users, the importance of guaranteeing that they provide factually correct information supported by verifiable sources is critical across fields of study &amp; professions. This is especially the case for high-stakes fields, such as medicine and law, where the risk of propagating false information is high and can lead to undesirable societal consequences. Previous work studying factuality and attribution has not focused on analyzing these characteristics of language model outputs in domain-specific scenarios. In this work, we present an evaluation study analyzing various axes of factuality and attribution provided in responses from a few systems, by bringing domain experts in the loop. Specifically, we first collect expert-curated questions from 484 participants across 32 fields of study, and then ask the same experts to evaluate generated responses to their own questions. We also ask experts to revise answers produced by language models, which leads to ExpertQA, a high-quality long-form QA dataset with 2177 questions spanning 32 fields, along with verified answers and attributions for claims in the answers.","creator":"Chaitanya Malaviya, Subin Lee, Sihao Chen, Elizabeth Sieber, Mark Yatskar, Dan Roth"},{"id":"2309.07861","slug":"ciwagan-articulatory-information-exchange-arxiv-2309-07861v1-cs-sd","title":"CiwaGAN: Articulatory information exchange.","link":"http://arxiv.org/abs/2309.07861","abstract":"Humans encode information into sounds by controlling articulators and decode information from sounds using the auditory apparatus. This paper introduces CiwaGAN, a model of human spoken language acquisition that combines unsupervised articulatory modeling with an unsupervised model of information exchange through the auditory modality. While prior research includes unsupervised articulatory modeling and information exchange separately, our model is the first to combine the two components. The paper also proposes an improved articulatory model with more interpretable internal representations. The proposed CiwaGAN model is the most realistic approximation of human spoken language acquisition using deep learning. As such, it is useful for cognitively plausible simulations of the human speech act.","creator":"Ga&#x161;per Begu&#x161;, Thomas Lu, Alan Zhou, Peter Wu, Gopala K. Anumanchipalli"},{"id":"2309.07864","slug":"the-rise-and-potential-of-large-language-model-based-agents-a-survey-arxiv-2309-07864v1-cs-ai","title":"The Rise and Potential of Large Language Model Based Agents: A Survey.","link":"http://arxiv.org/abs/2309.07864","abstract":"For a long time, humanity has pursued artificial intelligence (AI) equivalent to or surpassing the human level, with AI agents considered a promising vehicle for this pursuit. AI agents are artificial entities that sense their environment, make decisions, and take actions. Many efforts have been made to develop intelligent AI agents since the mid-20th century. However, these efforts have mainly focused on advancement in algorithms or training strategies to enhance specific capabilities or performance on particular tasks. Actually, what the community lacks is a sufficiently general and powerful model to serve as a starting point for designing AI agents that can adapt to diverse scenarios. Due to the versatile and remarkable capabilities they demonstrate, large language models (LLMs) are regarded as potential sparks for Artificial General Intelligence (AGI), offering hope for building general AI agents. Many research efforts have leveraged LLMs as the foundation to build AI agents and have achieved significant progress. We start by tracing the concept of agents from its philosophical origins to its development in AI, and explain why LLMs are suitable foundations for AI agents. Building upon this, we present a conceptual framework for LLM-based agents, comprising three main components: brain, perception, and action, and the framework can be tailored to suit different applications. Subsequently, we explore the extensive applications of LLM-based agents in three aspects: single-agent scenarios, multi-agent scenarios, and human-agent cooperation. Following this, we delve into agent societies, exploring the behavior and personality of LLM-based agents, the social phenomena that emerge when they form societies, and the insights they offer for human society. Finally, we discuss a range of key topics and open problems within the field.","creator":"Zhiheng Xi, Wenxiang Chen, Xin Guo, Wei He, Yiwen Ding, Boyang Hong, Ming Zhang, Junzhe Wang, Senjie Jin, Enyu Zhou, Rui Zheng, Xiaoran Fan, Xiao Wang, Limao Xiong, Qin Liu, Yuhao Zhou, Weiran Wang, Changhao Jiang, Yicheng Zou, Xiangyang Liu, Zhangyue Yin, Shihan Dou, Rongxiang Weng, Wensen Cheng, Qi Zhang, Wenjuan Qin, Yongyan Zheng, Xipeng Qiu, Xuanjing Huan, Tao Gui"},{"id":"2309.07867","slug":"beta-diffusion-arxiv-2309-07867v1-cs-lg","title":"Beta Diffusion.","link":"http://arxiv.org/abs/2309.07867","abstract":"We introduce beta diffusion, a novel generative modeling method that integrates demasking and denoising to generate data within bounded ranges. Using scaled and shifted beta distributions, beta diffusion utilizes multiplicative transitions over time to create both forward and reverse diffusion processes, maintaining beta distributions in both the forward marginals and the reverse conditionals, given the data at any point in time. Unlike traditional diffusion-based generative models relying on additive Gaussian noise and reweighted evidence lower bounds (ELBOs), beta diffusion is multiplicative and optimized with KL-divergence upper bounds (KLUBs) derived from the convexity of the KL divergence. We demonstrate that the proposed KLUBs are more effective for optimizing beta diffusion compared to negative ELBOs, which can also be derived as the KLUBs of the same KL divergence with its two arguments swapped. The loss function of beta diffusion, expressed in terms of Bregman divergence, further supports the efficacy of KLUBs for optimization. Experimental results on both synthetic data and natural images demonstrate the unique capabilities of beta diffusion in generative modeling of range-bounded data and validate the effectiveness of KLUBs in optimizing diffusion models, thereby making them valuable additions to the family of diffusion-based generative models and the optimization techniques used to train them.","creator":"Mingyuan Zhou, Tianqi Chen, Zhendong Wang, Huangjie Zheng"},{"id":"2309.07915","slug":"mmicl-empowering-vision-language-model-with-multi-modal-in-context-learning-arxiv-2309-07915v1-cs-cl","title":"MMICL: Empowering Vision-language Model with Multi-Modal In-Context Learning.","link":"http://arxiv.org/abs/2309.07915","abstract":"Starting from the resurgence of deep learning, vision-language models (VLMs) benefiting from large language models (LLMs) have never been so popular. However, while LLMs can utilize extensive background knowledge and task information with in-context learning, most VLMs still struggle with understanding complex multi-modal prompts with multiple images. The issue can traced back to the architectural design of VLMs or pre-training data. Specifically, the current VLMs primarily emphasize utilizing multi-modal data with a single image some, rather than multi-modal prompts with interleaved multiple images and text. Even though some newly proposed VLMs could handle user prompts with multiple images, pre-training data does not provide more sophisticated multi-modal prompts than interleaved image and text crawled from the web. We propose MMICL to address the issue by considering both the model and data perspectives. We introduce a well-designed architecture capable of seamlessly integrating visual and textual context in an interleaved manner and MIC dataset to reduce the gap between the training data and the complex user prompts in real-world applications, including: 1) multi-modal context with interleaved images and text, 2) textual references for each image, and 3) multi-image data with spatial, logical, or temporal relationships. Our experiments confirm that MMICL achieves new stat-of-the-art zero-shot and few-shot performance on a wide range of general vision-language tasks, especially for complex reasoning benchmarks including MME and MMBench. Our analysis demonstrates that MMICL effectively deals with the challenge of complex multi-modal prompt understanding. The experiments on ScienceQA-IMG also show that MMICL successfully alleviates the issue of language bias in VLMs, which we believe is the reason behind the advanced performance of MMICL.","creator":"Haozhe Zhao, Zefan Cai, Shuzheng Si, Xiaojian Ma, Kaikai An, Liang Chen, Zixuan Liu, Sheng Wang, Wenjuan Han, Baobao Chang"},{"id":"2112.07611","slug":"speeding-up-learning-quantum-states-through-group-equivariant-convolutional-quantum-ans-atze-arxiv-2112-07611v3-quant-ph-updated","title":"Speeding up Learning Quantum States through Group Equivariant Convolutional Quantum Ans\\\"atze.","link":"http://arxiv.org/abs/2112.07611","abstract":"We develop a theoretical framework for $S_n$-equivariant convolutional quantum circuits with SU$(d)$-symmetry, building on and significantly generalizing Jordan's Permutational Quantum Computing (PQC) formalism based on Schur-Weyl duality connecting both SU$(d)$ and $S_n$ actions on qudits. In particular, we utilize the Okounkov-Vershik approach to prove Harrow's statement (Ph.D. Thesis 2005 p.160) on the equivalence between $\\operatorname{SU}(d)$ and $S_n$ irrep bases and to establish the $S_n$-equivariant Convolutional Quantum Alternating Ans\\\"atze ($S_n$-CQA) using Young-Jucys-Murphy (YJM) elements. We prove that $S_n$-CQA is able to generate any unitary in any given $S_n$ irrep sector, which may serve as a universal model for a wide array of quantum machine learning problems with the presence of SU($d$) symmetry. Our method provides another way to prove the universality of Quantum Approximate Optimization Algorithm (QAOA) and verifies that 4-local SU($d$) symmetric unitaries are sufficient to build generic SU($d$) symmetric quantum circuits up to relative phase factors. We present numerical simulations to showcase the effectiveness of the ans\\\"atze to find the ground state energy of the $J_1$--$J_2$ antiferromagnetic Heisenberg model on the rectangular and Kagome lattices. Our work provides the first application of the celebrated Okounkov-Vershik's $S_n$ representation theory to quantum physics and machine learning, from which to propose quantum variational ans\\\"atze that strongly suggests to be classically intractable tailored towards a specific optimization problem.","creator":"Han Zheng, Zimu Li, Junyu Liu, Sergii Strelchuk, Risi Kondor"},{"id":"2202.03609","slug":"policycleanse-backdoor-detection-and-mitigation-in-reinforcement-learning-arxiv-2202-03609v5-cs-lg-updated","title":"PolicyCleanse: Backdoor Detection and Mitigation in Reinforcement Learning.","link":"http://arxiv.org/abs/2202.03609","abstract":"While real-world applications of reinforcement learning are becoming popular, the security and robustness of RL systems are worthy of more attention and exploration. In particular, recent works have revealed that, in a multi-agent RL environment, backdoor trigger actions can be injected into a victim agent (a.k.a. Trojan agent), which can result in a catastrophic failure as soon as it sees the backdoor trigger action. To ensure the security of RL agents against malicious backdoors, in this work, we propose the problem of Backdoor Detection in a multi-agent competitive reinforcement learning system, with the objective of detecting Trojan agents as well as the corresponding potential trigger actions, and further trying to mitigate their Trojan behavior. In order to solve this problem, we propose PolicyCleanse that is based on the property that the activated Trojan agents accumulated rewards degrade noticeably after several timesteps. Along with PolicyCleanse, we also design a machine unlearning-based approach that can effectively mitigate the detected backdoor. Extensive experiments demonstrate that the proposed methods can accurately detect Trojan agents, and outperform existing backdoor mitigation baseline approaches by at least 3% in winning rate across various types of agents and environments.","creator":"Junfeng Guo, Ang Li, Cong Liu"},{"id":"2202.10629","slug":"model-reprogramming-resource-efficient-cross-domain-machine-learning-arxiv-2202-10629v3-cs-lg-updated","title":"Model Reprogramming: Resource-Efficient Cross-Domain Machine Learning.","link":"http://arxiv.org/abs/2202.10629","abstract":"In data-rich domains such as vision, language, and speech, deep learning prevails to deliver high-performance task-specific models and can even learn general task-agnostic representations for efficient finetuning to downstream tasks. However, deep learning in resource-limited domains still faces multiple challenges including (i) limited data, (ii) constrained model development cost, and (iii) lack of adequate pre-trained models for effective finetuning. This paper provides an overview of model reprogramming to bridge this gap. Model reprogramming enables resource-efficient cross-domain machine learning by repurposing and reusing a well-developed pre-trained model from a source domain to solve tasks in a target domain without model finetuning, where the source and target domains can be vastly different. In many applications, model reprogramming outperforms transfer learning and training from scratch. This paper elucidates the methodology of model reprogramming, summarizes existing use cases, provides a theoretical explanation of the success of model reprogramming, and concludes with a discussion on open-ended research questions and opportunities. A list of model reprogramming studies is actively maintained and updated at https://github.com/IBM/model-reprogramming.","creator":"Pin-Yu Chen"},{"id":"2205.11110","slug":"meta-learning-regrasping-strategies-for-physical-agnostic-objects-arxiv-2205-11110v2-cs-ro-updated","title":"Meta-Learning Regrasping Strategies for Physical-Agnostic Objects.","link":"http://arxiv.org/abs/2205.11110","abstract":"Grasping inhomogeneous objects in real-world applications remains a challenging task due to the unknown physical properties such as mass distribution and coefficient of friction. In this study, we propose a meta-learning algorithm called ConDex, which incorporates Conditional Neural Processes (CNP) with DexNet-2.0 to autonomously discern the underlying physical properties of objects using depth images. ConDex efficiently acquires physical embeddings from limited trials, enabling precise grasping point estimation. Furthermore, ConDex is capable of updating the predicted grasping quality iteratively from new trials in an online fashion. To the best of our knowledge, we are the first who generate two object datasets focusing on inhomogeneous physical properties with varying mass distributions and friction coefficients. Extensive evaluations in simulation demonstrate ConDex's superior performance over DexNet-2.0 and existing meta-learning-based grasping pipelines. Furthermore, ConDex shows robust generalization to previously unseen real-world objects despite training solely in the simulation. The synthetic and real-world datasets will be published as well.","creator":"Ning Gao, Jingyu Zhang, Ruijie Chen, Ngo Anh Vien, Hanna Ziesche, Gerhard Neumann"},{"id":"2206.03420","slug":"an-adaptive-federated-relevance-framework-for-spatial-temporal-graph-learning-arxiv-2206-03420v3-cs-lg-updated","title":"An Adaptive Federated Relevance Framework for Spatial Temporal Graph Learning.","link":"http://arxiv.org/abs/2206.03420","abstract":"Spatial-temporal data contains rich information and has been widely studied in recent years due to the rapid development of relevant applications in many fields. For instance, medical institutions often use electrodes attached to different parts of a patient to analyse the electorencephal data rich with spatial and temporal features for health assessment and disease diagnosis. Existing research has mainly used deep learning techniques such as convolutional neural network (CNN) or recurrent neural network (RNN) to extract hidden spatial-temporal features. Yet, it is challenging to incorporate both inter-dependencies spatial information and dynamic temporal changes simultaneously. In reality, for a model that leverages these spatial-temporal features to fulfil complex prediction tasks, it often requires a colossal amount of training data in order to obtain satisfactory model performance. Considering the above-mentioned challenges, we propose an adaptive federated relevance framework, namely FedRel, for spatial-temporal graph learning in this paper. After transforming the raw spatial-temporal data into high quality features, the core Dynamic Inter-Intra Graph (DIIG) module in the framework is able to use these features to generate the spatial-temporal graphs capable of capturing the hidden topological and long-term temporal correlation information in these graphs. To improve the model generalization ability and performance while preserving the local data privacy, we also design a relevance-driven federated learning module in our framework to leverage diverse data distributions from different participants with attentive aggregations of their models.","creator":"Tiehua Zhang, Yuze Liu, Zhishu Shen, Rui Xu, Xin Chen, Xiaowei Huang, Xi Zheng"},{"id":"2208.00085","slug":"machine-learning-and-computer-vision-techniques-in-continuous-beehive-monitoring-applications-a-survey-arxiv-2208-00085v3-cs-cv-updated","title":"Machine Learning and Computer Vision Techniques in Continuous Beehive Monitoring Applications: A survey.","link":"http://arxiv.org/abs/2208.00085","abstract":"Wide use and availability of the machine learning and computer vision techniques allows development of relatively complex monitoring systems in many domains. Besides the traditional industrial domain, new application appears also in biology and agriculture, where we could speak about the detection of infections, parasites and weeds, but also about automated monitoring and early warning systems. This is also connected with the introduction of the easily accessible hardware and development kits such as Arduino, or RaspberryPi family. In this paper, we survey 50 existing papers focusing on the methods of automated beehive monitoring methods using the computer vision techniques, particularly on the pollen and Varroa mite detection together with the bee traffic monitoring. Such systems could also be used for the monitoring of the honeybee colonies and for the inspection of their health state, which could identify potentially dangerous states before the situation is critical, or to better plan periodic bee colony inspections and therefore save significant costs. Later, we also include analysis of the research trends in this application field and we outline the possible direction of the new explorations. Our paper is aimed also at veterinary and apidology professionals and experts, who might not be familiar with machine learning to introduce them to its possibilities, therefore each family of applications is opened by a brief theoretical introduction and motivation related to its base method. We hope that this paper will inspire other scientists to use machine learning techniques for other applications in beehive monitoring.","creator":"Simon Bilik, Tomas Zemcik, Lukas Kratochvila, Dominik Ricanek, Milos Richter, Sebastian Zambanini, Karel Horak"},{"id":"2210.00305","slug":"lambdakg-a-library-for-pre-trained-language-model-based-knowledge-graph-embeddings-arxiv-2210-00305v3-cs-cl-updated","title":"LambdaKG: A Library for Pre-trained Language Model-Based Knowledge Graph Embeddings.","link":"http://arxiv.org/abs/2210.00305","abstract":"Knowledge Graphs (KGs) often have two characteristics: heterogeneous graph structure and text-rich entity/relation information. Text-based KG embeddings can represent entities by encoding descriptions with pre-trained language models, but no open-sourced library is specifically designed for KGs with PLMs at present. In this paper, we present LambdaKG, a library for KGE that equips with many pre-trained language models (e.g., BERT, BART, T5, GPT-3), and supports various tasks (e.g., knowledge graph completion, question answering, recommendation, and knowledge probing). LambdaKG is publicly open-sourced at https://github.com/zjunlp/PromptKG/tree/main/lambdaKG, with a demo video at this http URL and long-term maintenance.","creator":"Xin Xie, Zhoubo Li, Xiaohan Wang, Zekun Xi, Ningyu Zhang"},{"id":"2210.04688","slug":"baffle-backdoor-attack-in-offline-reinforcement-learning-arxiv-2210-04688v2-cs-lg-updated","title":"BAFFLE: Backdoor Attack in Offline Reinforcement Learning.","link":"http://arxiv.org/abs/2210.04688","abstract":"A growing body of research has focused on the Reinforcement Learning (RL) methods which allow the agent to learn from trial-and-error experiences gathered during the interaction with the environment. Recently, offline RL becomes a popular RL paradigm because it saves the interactions with environments. In offline RL, data providers share large pre-collected datasets, and others can train high-quality agents without interacting with the environments. This paradigm has demonstrated effectiveness in critical tasks like robot control, autonomous driving, etc. However, less attention is paid to investigating the security threats to the offline RL system. This paper focuses on backdoor attacks, where some perturbations are added to the data (observations) such that given normal observations, the agent takes high-rewards actions, and low-reward actions on observations injected with triggers. In this paper, we propose Baffle (Backdoor Attack for Offline Reinforcement Learning), an approach that automatically implants backdoors to RL agents by poisoning the offline RL dataset, and evaluate how different offline RL algorithms react to this attack. Our experiments conducted on four tasks and four offline RL algorithms expose a disquieting fact: none of the existing offline RL algorithms is immune to such a backdoor attack. Baffle modifies $10\\%$ of the datasets for four tasks. Agents trained on the poisoned datasets perform well in normal settings. However, when triggers are presented, the agents' performance decreases drastically by $63.2\\%$, $53.9\\%$, $64.7\\%$, and $47.4\\%$ in the four tasks on average. The backdoor still persists after fine-tuning poisoned agents on clean datasets. We further show that the inserted backdoor is also hard to be detected by a popular defensive method. This paper calls attention to developing more effective protection for the open-source offline RL dataset.","creator":"Chen Gong, Zhou Yang, Yunpeng Bai, Junda He, Jieke Shi, Kecen Li, Arunesh Sinha, Bowen Xu, Xinwen Hou, David Lo, Tianhao Wang"},{"id":"2210.05845","slug":"conspec-honing-in-on-critical-steps-for-rapid-learning-and-generalization-in-rl-arxiv-2210-05845v5-cs-lg-updated","title":"ConSpec: honing in on critical steps for rapid learning and generalization in RL.","link":"http://arxiv.org/abs/2210.05845","abstract":"In real life, success is often contingent upon multiple critical steps that are distant in time from each other and from the final reward. These critical steps are challenging to identify with traditional reinforcement learning (RL) methods that rely on the Bellman equation for credit assignment. Here, we present a new RL algorithm that uses offline contrastive learning to hone in on critical steps. This algorithm, which we call contrastive introspection (ConSpec), can be added to any existing RL algorithm. ConSpec learns a set of prototypes for the critical steps in a task by a novel contrastive loss and delivers an intrinsic reward when the current state matches one of these prototypes. The prototypes in ConSpec provide two key benefits for credit assignment: (1) They enable rapid identification of all the critical steps. (2) They do so in a readily interpretable manner, enabling out-of-distribution generalization when sensory features are altered. Distinct from other contemporary RL approaches to credit assignment, ConSpec takes advantage of the fact that it is easier to retrospectively identify the small set of steps that success is contingent upon than it is to prospectively predict reward at every step taken in the environment. Altogether, ConSpec improves learning in a diverse set of RL tasks, including both those with explicit, discrete critical steps and those with complex, continuous critical steps.","creator":"Chen Sun, Wannan Yang, Thomas Jiralerspong, Dane Malenfant, Benjamin Alsbury-Nealy, Yoshua Bengio, Blake Richards"},{"id":"2210.16591","slug":"disenpoi-disentangling-sequential-and-geographical-influence-for-point-of-interest-recommendation-arxiv-2210-16591v2-cs-ir-updated","title":"DisenPOI: Disentangling Sequential and Geographical Influence for Point-of-Interest Recommendation.","link":"http://arxiv.org/abs/2210.16591","abstract":"Point-of-Interest (POI) recommendation plays a vital role in various location-aware services. It has been observed that POI recommendation is driven by both sequential and geographical influences. However, since there is no annotated label of the dominant influence during recommendation, existing methods tend to entangle these two influences, which may lead to sub-optimal recommendation performance and poor interpretability. In this paper, we address the above challenge by proposing DisenPOI, a novel Disentangled dual-graph framework for POI recommendation, which jointly utilizes sequential and geographical relationships on two separate graphs and disentangles the two influences with self-supervision. The key novelty of our model compared with existing approaches is to extract disentangled representations of both sequential and geographical influences with contrastive learning. To be specific, we construct a geographical graph and a sequential graph based on the check-in sequence of a user. We tailor their propagation schemes to become sequence-/geo-aware to better capture the corresponding influences. Preference proxies are extracted from check-in sequence as pseudo labels for the two influences, which supervise the disentanglement via a contrastive loss. Extensive experiments on three datasets demonstrate the superiority of the proposed model.","creator":"Yifang Qin, Yifan Wang, Fang Sun, Wei Ju, Xuyang Hou, Zhe Wang, Jia Cheng, Jun Lei, Ming Zhang"},{"id":"2211.10851","slug":"reward-is-not-necessary-how-to-create-a-compositional-self-preserving-agent-for-life-long-learning-arxiv-2211-10851v3-cs-ai-updated","title":"Reward is not Necessary: How to Create a Compositional Self-Preserving Agent for Life-Long Learning.","link":"http://arxiv.org/abs/2211.10851","abstract":"Reinforcement Learning views the maximization of rewards and avoidance of punishments as central to explaining goal-directed behavior. However, over a life, organisms will need to learn about many different aspects of the world's structure: the states of the world and state-vector transition dynamics. The number of combinations of states grows exponentially as an agent incorporates new knowledge, and there is no obvious weighted combination of pre-existing rewards or costs defined for a given combination of states, as such a weighting would need to encode information about good and bad combinations prior to an agent's experience in the world. Therefore, we must develop more naturalistic accounts of behavior and motivation in large state-spaces. We show that it is possible to use only the intrinsic motivation metric of empowerment, which measures the agent's capacity to realize many possible futures under a transition operator. We propose to scale empowerment to hierarchical state-spaces by using Operator Bellman Equations. These equations produce state-time feasibility functions, which are compositional hierarchical state-time transition operators that map an initial state and time when an agent begins a policy to the final states and times of completing a goal. Because these functions are hierarchical operators we can define hierarchical empowerment measures on them. An agent can then optimize plans to distant states and times to maximize its hierarchical empowerment-gain, allowing it to discover goals that bring about a more favorable coupling of its internal structure (physiological states) to its external environment (world structure &amp; spatial state). Life-long agents could therefore be primarily animated by principles of compositionality and empowerment, exhibiting self-concern for the growth &amp; maintenance of their own structural integrity without recourse to reward-maximization.","creator":"Thomas J. Ringstrom"},{"id":"2212.04953","slug":"targetcall-eliminating-the-wasted-computation-in-basecalling-via-pre-basecalling-filtering-arxiv-2212-04953v2-q-bio-gn-updated","title":"TargetCall: Eliminating the Wasted Computation in Basecalling via Pre-Basecalling Filtering.","link":"http://arxiv.org/abs/2212.04953","abstract":"Basecalling is an essential step in nanopore sequencing analysis where the raw signals of nanopore sequencers are converted into nucleotide sequences, i.e., reads. State-of-the-art basecallers employ complex deep learning models to achieve high basecalling accuracy. This makes basecalling computationally-inefficient and memory-hungry; bottlenecking the entire genome analysis pipeline. However, for many applications, the majority of reads do no match the reference genome of interest (i.e., target reference) and thus are discarded in later steps in the genomics pipeline, wasting the basecalling computation. To overcome this issue, we propose TargetCall, the first pre-basecalling filter to eliminate the wasted computation in basecalling. TargetCall's key idea is to discard reads that will not match the target reference (i.e., off-target reads) prior to basecalling. TargetCall consists of two main components: (1) LightCall, a lightweight neural network basecaller that produces noisy reads; and (2) Similarity Check, which labels each of these noisy reads as on-target or off-target by matching them to the target reference. TargetCall aims to filter out all off-target reads before basecalling. The highly-accurate but slow basecalling is performed only on the raw signals whose noisy reads are labeled as on-target. Our thorough experimental evaluations using both real and simulated data show that TargetCall 1) improves the end-to-end basecalling performance while maintaining high sensitivity in keeping on-target reads, 2) maintains high accuracy in downstream analysis, 3) precisely filters out up to 94.71% of off-target reads, and 4) achieves better performance, throughput, sensitivity, precision, and generality compared to prior works. We open-source TargetCall at https://github.com/CMU-SAFARI/TargetCall","creator":"Meryem Banu Cavlak, Gagandeep Singh, Mohammed Alser, Can Firtina, Jo&#xeb;l Lindegger, Mohammad Sadrosadati, Nika Mansouri Ghiasi, Can Alkan, Onur Mutlu"},{"id":"2212.09597","slug":"reasoning-with-language-model-prompting-a-survey-arxiv-2212-09597v7-cs-cl-updated","title":"Reasoning with Language Model Prompting: A Survey.","link":"http://arxiv.org/abs/2212.09597","abstract":"Reasoning, as an essential ability for complex problem-solving, can provide back-end support for various real-world applications, such as medical diagnosis, negotiation, etc. This paper provides a comprehensive survey of cutting-edge research on reasoning with language model prompting. We introduce research works with comparisons and summaries and provide systematic resources to help beginners. We also discuss the potential reasons for emerging such reasoning abilities and highlight future research directions. Resources are available at https://github.com/zjunlp/Prompt4ReasoningPapers (updated periodically).","creator":"Shuofei Qiao, Yixin Ou, Ningyu Zhang, Xiang Chen, Yunzhi Yao, Shumin Deng, Chuanqi Tan, Fei Huang, Huajun Chen"},{"id":"2302.07260","slug":"scalable-bayesian-optimization-with-high-dimensional-outputs-using-randomized-prior-networks-arxiv-2302-07260v5-cs-lg-updated","title":"Scalable Bayesian optimization with high-dimensional outputs using randomized prior networks.","link":"http://arxiv.org/abs/2302.07260","abstract":"Several fundamental problems in science and engineering consist of global optimization tasks involving unknown high-dimensional (black-box) functions that map a set of controllable variables to the outcomes of an expensive experiment. Bayesian Optimization (BO) techniques are known to be effective in tackling global optimization problems using a relatively small number objective function evaluations, but their performance suffers when dealing with high-dimensional outputs. To overcome the major challenge of dimensionality, here we propose a deep learning framework for BO and sequential decision making based on bootstrapped ensembles of neural architectures with randomized priors. Using appropriate architecture choices, we show that the proposed framework can approximate functional relationships between design variables and quantities of interest, even in cases where the latter take values in high-dimensional vector spaces or even infinite-dimensional function spaces. In the context of BO, we augmented the proposed probabilistic surrogates with re-parameterized Monte Carlo approximations of multiple-point (parallel) acquisition functions, as well as methodological extensions for accommodating black-box constraints and multi-fidelity information sources. We test the proposed framework against state-of-the-art methods for BO and demonstrate superior performance across several challenging tasks with high-dimensional outputs, including a constrained multi-fidelity optimization task involving shape optimization of rotor blades in turbo-machinery.","creator":"Mohamed Aziz Bhouri, Michael Joly, Robert Yu, Soumalya Sarkar, Paris Perdikaris"},{"id":"2302.10848","slug":"deep-reinforced-learning-heuristic-tested-on-spin-glass-ground-states-the-larger-picture-arxiv-2302-10848v2-cond-mat-dis-nn-updated","title":"Deep reinforced learning heuristic tested on spin-glass ground states: The larger picture.","link":"http://arxiv.org/abs/2302.10848","abstract":"In Changjun Fan et al. [Nature Communications https://doi.org/10.1038/s41467-023-36363-w (2023)], the authors present a deep reinforced learning approach to augment combinatorial optimization heuristics. In particular, they present results for several spin glass ground state problems, for which instances on non-planar networks are generally NP-hard, in comparison with several Monte Carlo based methods, such as simulated annealing (SA) or parallel tempering (PT). Indeed, those results demonstrate that the reinforced learning improves the results over those obtained with SA or PT, or at least allows for reduced runtimes for the heuristics before results of comparable quality have been obtained relative to those other methods. To facilitate the conclusion that their method is ''superior'', the authors pursue two basic strategies: (1) A commercial GUROBI solver is called on to procure a sample of exact ground states as a testbed to compare with, and (2) a head-to-head comparison between the heuristics is given for a sample of larger instances where exact ground states are hard to ascertain. Here, we put these studies into a larger context, showing that the claimed superiority is at best marginal for smaller samples and becomes essentially irrelevant with respect to any sensible approximation of true ground states in the larger samples. For example, this method becomes irrelevant as a means to determine stiffness exponents $\\theta$ in $d&gt;2$, as mentioned by the authors, where the problem is not only NP-hard but requires the subtraction of two almost equal ground-state energies and systemic errors in each of $\\approx 1\\%$ found here are unacceptable. This larger picture on the method arises from a straightforward finite-size corrections study over the spin glass ensembles the authors employ, using data that has been available for decades.","creator":"Stefan Boettcher (Emory U)"},{"id":"2304.09960","slug":"a-latent-space-theory-for-emergent-abilities-in-large-language-models-arxiv-2304-09960v3-cs-cl-updated","title":"A Latent Space Theory for Emergent Abilities in Large Language Models.","link":"http://arxiv.org/abs/2304.09960","abstract":"Languages are not created randomly but rather to communicate information. There is a strong association between languages and their underlying meanings, resulting in a sparse joint distribution that is heavily peaked according to their correlations. Moreover, these peak values happen to match with the marginal distribution of languages due to the sparsity. With the advent of LLMs trained on big data and large models, we can now precisely assess the marginal distribution of languages, providing a convenient means of exploring the sparse structures in the joint distribution for effective inferences. In this paper, we categorize languages as either unambiguous or {\\epsilon}-ambiguous and present quantitative results to demonstrate that the emergent abilities of LLMs, such as language understanding, in-context learning, chain-of-thought prompting, and effective instruction fine-tuning, can all be attributed to Bayesian inference on the sparse joint distribution of languages.","creator":"Hui Jiang"},{"id":"2304.10520","slug":"contrastive-tuning-a-little-help-to-make-masked-autoencoders-forget-arxiv-2304-10520v2-cs-cv-updated","title":"Contrastive Tuning: A Little Help to Make Masked Autoencoders Forget.","link":"http://arxiv.org/abs/2304.10520","abstract":"Masked Image Modeling (MIM) methods, like Masked Autoencoders (MAE), efficiently learn a rich representation of the input. However, for adapting to downstream tasks, they require a sufficient amount of labeled data since their rich features code not only objects but also less relevant image background. In contrast, Instance Discrimination (ID) methods focus on objects. In this work, we study how to combine the efficiency and scalability of MIM with the ability of ID to perform downstream classification in the absence of large amounts of labeled data. To this end, we introduce Masked Autoencoder Contrastive Tuning (MAE-CT), a sequential approach that utilizes the implicit clustering of the Nearest Neighbor Contrastive Learning (NNCLR) objective to induce abstraction in the topmost layers of a pre-trained MAE. MAE-CT tunes the rich features such that they form semantic clusters of objects without using any labels. Notably, MAE-CT does not rely on hand-crafted augmentations and frequently achieves its best performances while using only minimal augmentations (crop &amp; flip). Further, MAE-CT is compute efficient as it requires at most 10% overhead compared to MAE re-training. Applied to large and huge Vision Transformer (ViT) models, MAE-CT excels over previous self-supervised methods trained on ImageNet in linear probing, k-NN and low-shot classification accuracy as well as in unsupervised clustering accuracy. With ViT-H/16 MAE-CT achieves a new state-of-the-art in linear probing of 82.2%.","creator":"Johannes Lehner, Benedikt Alkin, Andreas F&#xfc;rst, Elisabeth Rumetshofer, Lukas Miklautz, Sepp Hochreiter"},{"id":"2304.12241","slug":"positive-ai-key-challenges-for-designing-wellbeing-aligned-artificial-intelligence-arxiv-2304-12241v3-cs-cy-updated","title":"Positive AI: Key Challenges for Designing Wellbeing-aligned Artificial Intelligence.","link":"http://arxiv.org/abs/2304.12241","abstract":"Artificial Intelligence (AI) is rapidly transforming society, creating an urgent need to ensure its positive impact. In this article, we take a positive design approach towards this issue, viewing it as a matter of designing AI systems that actively support human wellbeing. However, designing wellbeing-aligned AI systems is difficult. This article adopts a cybernetic perspective to identify twelve key challenges across two categories: lack of knowledge and lack of motivation. Knowledge barriers include challenges in conceptualizing, measuring, and optimizing for wellbeing, then designing appropriate AI actions. Motivation barriers include misaligned incentives, financial and publicity risks, and a lack of data access preventing (third-party) research on wellbeing. To address these challenges we have captured our key takeaways in a research agenda related to 1) advancing the scientific understanding of the impact of AI systems on wellbeing, and 2) guiding design actions on how AI systems might be intentionally designed to promote and sustain wellbeing.","creator":"Willem van der Maden, Derek Lomas, Malak Sadek, Paul Hekkert"},{"id":"2304.13522","slug":"sequential-decomposition-of-propositional-logic-programs-arxiv-2304-13522v2-cs-lo-updated","title":"Sequential decomposition of propositional logic programs.","link":"http://arxiv.org/abs/2304.13522","abstract":"The sequential composition of propositional logic programs has been recently introduced. This paper studies the sequential {\\em decomposition} of programs by studying Green's relations $\\mathcal{L,R,J}$ -- well-known in semigroup theory -- between programs. In a broader sense, this paper is a further step towards an algebraic theory of logic programming.","creator":"Christian Anti&#x107;"},{"id":"2305.10403","slug":"palm-2-technical-report-arxiv-2305-10403v3-cs-cl-updated","title":"PaLM 2 Technical Report.","link":"http://arxiv.org/abs/2305.10403","abstract":"We introduce PaLM 2, a new state-of-the-art language model that has better multilingual and reasoning capabilities and is more compute-efficient than its predecessor PaLM. PaLM 2 is a Transformer-based model trained using a mixture of objectives. Through extensive evaluations on English and multilingual language, and reasoning tasks, we demonstrate that PaLM 2 has significantly improved quality on downstream tasks across different model sizes, while simultaneously exhibiting faster and more efficient inference compared to PaLM. This improved efficiency enables broader deployment while also allowing the model to respond faster, for a more natural pace of interaction. PaLM 2 demonstrates robust reasoning capabilities exemplified by large improvements over PaLM on BIG-Bench and other reasoning tasks. PaLM 2 exhibits stable performance on a suite of responsible AI evaluations, and enables inference-time control over toxicity without additional overhead or impact on other capabilities. Overall, PaLM 2 achieves state-of-the-art performance across a diverse set of tasks and capabilities.  When discussing the PaLM 2 family, it is important to distinguish between pre-trained models (of various sizes), fine-tuned variants of these models, and the user-facing products that use these models. In particular, user-facing products typically include additional pre- and post-processing steps. Additionally, the underlying models may evolve over time. Therefore, one should not expect the performance of user-facing products to exactly match the results reported in this report.","creator":"Rohan Anil, Andrew M. Dai, Orhan Firat, Melvin Johnson, Dmitry Lepikhin, Alexandre Passos, Siamak Shakeri, Emanuel Taropa, Paige Bailey, Zhifeng Chen, Eric Chu, Jonathan H. Clark, Laurent El Shafey, Yanping Huang, Kathy Meier-Hellstern, Gaurav Mishra, Erica Moreira, Mark Omernick, Kevin Robinson, Sebastian Ruder, Yi Tay, Kefan Xiao, Yuanzhong Xu, Yujing Zhang, Gustavo Hernandez Abrego, Junwhan Ahn, Jacob Austin, Paul Barham, Jan Botha, James Bradbury, Siddhartha Brahma, Kevin Brooks, Michele Catasta, Yong Cheng, Colin Cherry, Christopher A. Choquette-Choo, Aakanksha Chowdhery, Cl&#xe9;ment Crepy, Shachi Dave, Mostafa Dehghani, Sunipa Dev, Jacob Devlin, Mark D&#xed;az, Nan Du, Ethan Dyer, Vlad Feinberg, Fangxiaoyu Feng, Vlad Fienber, Markus Freitag, Xavier Garcia, Sebastian Gehrmann, Lucas Gonzalez, et al. (76 additional authors not shown)"},{"id":"2305.11322","slug":"spikecp-delay-adaptive-reliable-spiking-neural-networks-via-conformal-prediction-arxiv-2305-11322v3-cs-ne-updated","title":"SpikeCP: Delay-Adaptive Reliable Spiking Neural Networks via Conformal Prediction.","link":"http://arxiv.org/abs/2305.11322","abstract":"Spiking neural networks (SNNs) process time-series data via internal event-driven neural dynamics whose energy consumption depends on the number of spikes exchanged between neurons over the course of the input presentation. In typical implementations of an SNN classifier, decisions are produced after the entire input sequence has been processed, resulting in latency and energy consumption levels that are fairly uniform across inputs. Recently introduced delay-adaptive SNNs tailor the inference latency -- and, with it, the energy consumption -- to the difficulty of each example, by producing an early decision when the SNN model is sufficiently ``confident''. In this paper, we start by observing that, as an SNN processes input samples, its classification decisions tend to be first under-confident and then over-confident with respect to the decision's ground-truth, unknown, test accuracy. This makes it difficult to determine a stopping time that ensures a desired level of accuracy. To address this problem, we introduce a novel delay-adaptive SNN-based inference methodology that, wrapping around any pre-trained SNN classifier, provides guaranteed reliability for the decisions produced at input-dependent stopping times. The approach entails minimal added complexity as compared to the underlying SNN, requiring only thresholding and counting operations at run time, and it leverages tools from conformal prediction (CP).","creator":"Jiechen Chen, Sangwoo Park, Osvaldo Simeone"},{"id":"2305.15021","slug":"embodiedgpt-vision-language-pre-training-via-embodied-chain-of-thought-arxiv-2305-15021v2-cs-ro-updated","title":"EmbodiedGPT: Vision-Language Pre-Training via Embodied Chain of Thought.","link":"http://arxiv.org/abs/2305.15021","abstract":"Embodied AI is a crucial frontier in robotics, capable of planning and executing action sequences for robots to accomplish long-horizon tasks in physical environments. In this work, we introduce EmbodiedGPT, an end-to-end multi-modal foundation model for embodied AI, empowering embodied agents with multi-modal understanding and execution capabilities. To achieve this, we have made the following efforts: (i) We craft a large-scale embodied planning dataset, termed EgoCOT. The dataset consists of carefully selected videos from the Ego4D dataset, along with corresponding high-quality language instructions. Specifically, we generate a sequence of sub-goals with the \"Chain of Thoughts\" mode for effective embodied planning. (ii) We introduce an efficient training approach to EmbodiedGPT for high-quality plan generation, by adapting a 7B large language model (LLM) to the EgoCOT dataset via prefix tuning. (iii) We introduce a paradigm for extracting task-related features from LLM-generated planning queries to form a closed loop between high-level planning and low-level control. Extensive experiments show the effectiveness of EmbodiedGPT on embodied tasks, including embodied planning, embodied control, visual captioning, and visual question answering. Notably, EmbodiedGPT significantly enhances the success rate of the embodied control task by extracting more effective features. It has achieved a remarkable 1.6 times increase in success rate on the Franka Kitchen benchmark and a 1.3 times increase on the Meta-World benchmark, compared to the BLIP-2 baseline fine-tuned with the Ego4D dataset.","creator":"Yao Mu, Qinglong Zhang, Mengkang Hu, Wenhai Wang, Mingyu Ding, Jun Jin, Bin Wang, Jifeng Dai, Yu Qiao, Ping Luo"},{"id":"2306.05064","slug":"k2-a-foundation-language-model-for-geoscience-knowledge-understanding-and-utilization-arxiv-2306-05064v2-cs-cl-updated","title":"K2: A Foundation Language Model for Geoscience Knowledge Understanding and Utilization.","link":"http://arxiv.org/abs/2306.05064","abstract":"Large language models (LLMs) have achieved great success in general domains of natural language processing. In this paper, we bring LLMs to the realm of geoscience with the objective of advancing research and applications in this field. To this end, we present the first-ever LLM in geoscience, K2, alongside a suite of resources developed to further promote LLM research within geoscience. For instance, we have curated the first geoscience instruction tuning dataset, GeoSignal, which aims to align LLM responses to geoscience-related user queries. Additionally, we have established the first geoscience benchmark, GeoBench, to evaluate LLMs in the context of geoscience. In this work, we experiment with a complete recipe to adapt a pre-trained general-domain LLM to the geoscience domain. Specifically, we further train the LLaMA-7B model on 5.5B tokens of geoscience text corpus, including over 1 million pieces of geoscience literature, and utilize GeoSignal's supervised data to fine-tune the model. Moreover, we share a protocol that can efficiently gather domain-specific data and construct domain-supervised data, even in situations where manpower is scarce. Meanwhile, we equip K2 with the abilities of using tools to be a naive geoscience aide. Experiments conducted on the GeoBench demonstrate the effectiveness of our approach and datasets on geoscience knowledge understanding and utilization.We open-source all the training data and K2 model checkpoints at https://github.com/davendw49/k2.","creator":"Cheng Deng, Tianhang Zhang, Zhongmou He, Yi Xu, Qiyuan Chen, Yuanyuan Shi, Luoyi Fu, Weinan Zhang, Xinbing Wang, Chenghu Zhou, Zhouhan Lin, Junxian He"},{"id":"2306.05659","slug":"cover-a-heuristic-greedy-adversarial-attack-on-prompt-based-learning-in-language-models-arxiv-2306-05659v3-cs-cl-updated","title":"COVER: A Heuristic Greedy Adversarial Attack on Prompt-based Learning in Language Models.","link":"http://arxiv.org/abs/2306.05659","abstract":"Prompt-based learning has been proved to be an effective way in pre-trained language models (PLMs), especially in low-resource scenarios like few-shot settings. However, the trustworthiness of PLMs is of paramount significance and potential vulnerabilities have been shown in prompt-based templates that could mislead the predictions of language models, causing serious security concerns. In this paper, we will shed light on some vulnerabilities of PLMs, by proposing a prompt-based adversarial attack on manual templates in black box scenarios. First of all, we design character-level and word-level heuristic approaches to break manual templates separately. Then we present a greedy algorithm for the attack based on the above heuristic destructive approaches. Finally, we evaluate our approach with the classification tasks on three variants of BERT series models and eight datasets. And comprehensive experimental results justify the effectiveness of our approach in terms of attack success rate and attack speed.","creator":"Zihao Tan, Qingliang Chen, Wenbin Zhu, Yongjian Huang"},{"id":"2306.14565","slug":"mitigating-hallucination-in-large-multi-modal-models-via-robust-instruction-tuning-arxiv-2306-14565v2-cs-cv-updated","title":"Mitigating Hallucination in Large Multi-Modal Models via Robust Instruction Tuning.","link":"http://arxiv.org/abs/2306.14565","abstract":"Despite the promising progress in multi-modal tasks, current large multi-modal models (LMM) are prone to hallucinating inconsistent descriptions with respect to the associated image and human instructions. This paper addresses this issue by introducing the first large and diverse visual instruction tuning dataset, named Large-scale Robust Visual (LRV)-Instruction. Our dataset consists of 120k visual instructions generated by GPT4, covering 16 vision-and-language tasks with open-ended instructions and answers. Unlike existing studies that primarily focus on positive instruction samples, we design LRV-Instruction to include both positive and negative instructions for more robust visual instruction tuning. Our negative instructions are designed at two semantic levels: (i) Nonexistent Element Manipulation and (ii) Existent Element Manipulation. To efficiently measure the hallucination generated by LMMs, we propose GPT4-Assisted Visual Instruction Evaluation (GAVIE), a novel approach to evaluate visual instruction tuning without the need for human-annotated groundtruth answers and can adapt to diverse instruction formats. We conduct comprehensive experiments to investigate the hallucination of LMMs. Our results demonstrate that existing LMMs exhibit significant hallucination when presented with our negative instructions, particularly with Existent Element Manipulation instructions. Moreover, by finetuning MiniGPT4 on LRV-Instruction, we successfully mitigate hallucination while improving performance on public datasets using less training data compared to state-of-the-art methods. Additionally, we observed that a balanced ratio of positive and negative instances in the training data leads to a more robust model. Updates of our project are available at https://fuxiaoliu.github.io/LRV/.","creator":"Fuxiao Liu, Kevin Lin, Linjie Li, Jianfeng Wang, Yaser Yacoob, Lijuan Wang"},{"id":"2307.00184","slug":"personality-traits-in-large-language-models-arxiv-2307-00184v2-cs-cl-updated","title":"Personality Traits in Large Language Models.","link":"http://arxiv.org/abs/2307.00184","abstract":"The advent of large language models (LLMs) has revolutionized natural language processing, enabling the generation of coherent and contextually relevant human-like text. As LLMs increasingly power conversational agents used by the general public world-wide, the synthetic personality embedded in these models, by virtue of training on large amounts of human data, is becoming increasingly important. Since personality is a key factor determining the effectiveness of communication, we present a comprehensive method for administering and validating personality tests on widely-used LLMs, as well as for shaping personality in the generated text of such LLMs. Applying this method, we found: 1) personality measurements in the outputs of some LLMs under specific prompting configurations are reliable and valid; 2) evidence of reliability and validity of synthetic LLM personality is stronger for larger and instruction fine-tuned models; and 3) personality in LLM outputs can be shaped along desired dimensions to mimic specific human personality profiles. We discuss application and ethical implications of the measurement and shaping method, in particular regarding responsible AI.","creator":"Greg Serapio-Garc&#xed;a, Mustafa Safdari, Cl&#xe9;ment Crepy, Luning Sun, Stephen Fitz, Peter Romero, Marwa Abdulhai, Aleksandra Faust, Maja Matari&#x107;"},{"id":"2307.10932","slug":"identical-and-fraternal-twins-fine-grained-semantic-contrastive-learning-of-sentence-representations-arxiv-2307-10932v2-cs-cl-updated","title":"Identical and Fraternal Twins: Fine-Grained Semantic Contrastive Learning of Sentence Representations.","link":"http://arxiv.org/abs/2307.10932","abstract":"The enhancement of unsupervised learning of sentence representations has been significantly achieved by the utility of contrastive learning. This approach clusters the augmented positive instance with the anchor instance to create a desired embedding space. However, relying solely on the contrastive objective can result in sub-optimal outcomes due to its inability to differentiate subtle semantic variations between positive pairs. Specifically, common data augmentation techniques frequently introduce semantic distortion, leading to a semantic margin between the positive pair. While the InfoNCE loss function overlooks the semantic margin and prioritizes similarity maximization between positive pairs during training, leading to the insensitive semantic comprehension ability of the trained model. In this paper, we introduce a novel Identical and Fraternal Twins of Contrastive Learning (named IFTCL) framework, capable of simultaneously adapting to various positive pairs generated by different augmentation techniques. We propose a \\textit{Twins Loss} to preserve the innate margin during training and promote the potential of data enhancement in order to overcome the sub-optimal issue. We also present proof-of-concept experiments combined with the contrastive objective to prove the validity of the proposed Twins Loss. Furthermore, we propose a hippocampus queue mechanism to restore and reuse the negative instances without additional calculation, which further enhances the efficiency and performance of the IFCL. We verify the IFCL framework on nine semantic textual similarity tasks with both English and Chinese datasets, and the experimental results show that IFCL outperforms state-of-the-art methods.","creator":"Qingfa Xiao, Shuangyin Li, Lei Chen"},{"id":"2307.14799","slug":"hybrid-asp-based-multi-objective-scheduling-of-semiconductor-manufacturing-processes-extended-version-arxiv-2307-14799v3-cs-ai-updated","title":"Hybrid ASP-based multi-objective scheduling of semiconductor manufacturing processes (Extended version).","link":"http://arxiv.org/abs/2307.14799","abstract":"Modern semiconductor manufacturing involves intricate production processes consisting of hundreds of operations, which can take several months from lot release to completion. The high-tech machines used in these processes are diverse, operate on individual wafers, lots, or batches in multiple stages, and necessitate product-specific setups and specialized maintenance procedures. This situation is different from traditional job-shop scheduling scenarios, which have less complex production processes and machines, and mainly focus on solving highly combinatorial but abstract scheduling problems. In this work, we address the scheduling of realistic semiconductor manufacturing processes by modeling their specific requirements using hybrid Answer Set Programming with difference logic, incorporating flexible machine processing, setup, batching and maintenance operations. Unlike existing methods that schedule semiconductor manufacturing processes locally with greedy heuristics or by independently optimizing specific machine group allocations, we examine the potentials of large-scale scheduling subject to multiple optimization objectives.","creator":"Mohammed M. S. El-Kholany, Ramsha Ali, Martin Gebser"},{"id":"2307.16834","slug":"benchmarking-jetson-edge-devices-with-an-end-to-end-video-based-anomaly-detection-system-arxiv-2307-16834v3-cs-cv-updated","title":"Benchmarking Jetson Edge Devices with an End-to-end Video-based Anomaly Detection System.","link":"http://arxiv.org/abs/2307.16834","abstract":"Innovative enhancement in embedded system platforms, specifically hardware accelerations, significantly influence the application of deep learning in real-world scenarios. These innovations translate human labor efforts into automated intelligent systems employed in various areas such as autonomous driving, robotics, Internet-of-Things (IoT), and numerous other impactful applications. NVIDIA's Jetson platform is one of the pioneers in offering optimal performance regarding energy efficiency and throughput in the execution of deep learning algorithms. Previously, most benchmarking analysis was based on 2D images with a single deep learning model for each comparison result. In this paper, we implement an end-to-end video-based crime-scene anomaly detection system inputting from surveillance videos and the system is deployed and completely operates on multiple Jetson edge devices (Nano, AGX Xavier, Orin Nano). The comparison analysis includes the integration of Torch-TensorRT as a software developer kit from NVIDIA for the model performance optimisation. The system is built based on the PySlowfast open-source project from Facebook as the coding template. The end-to-end system process comprises the videos from camera, data preprocessing pipeline, feature extractor and the anomaly detection. We provide the experience of an AI-based system deployment on various Jetson Edge devices with Docker technology. Regarding anomaly detectors, a weakly supervised video-based deep learning model called Robust Temporal Feature Magnitude Learning (RTFM) is applied in the system. The approach system reaches 47.56 frames per second (FPS) inference speed on a Jetson edge device with only 3.11 GB RAM usage total. We also discover the promising Jetson device that the AI system achieves 15% better performance than the previous version of Jetson devices while consuming 50% less energy power.","creator":"Hoang Viet Pham, Thinh Gia Tran, Chuong Dinh Le, An Dinh Le, Hien Bich Vo"},{"id":"2308.01921","slug":"transferable-graph-neural-fingerprint-models-for-quick-response-to-future-bio-threats-arxiv-2308-01921v2-q-bio-bm-updated","title":"Transferable Graph Neural Fingerprint Models for Quick Response to Future Bio-Threats.","link":"http://arxiv.org/abs/2308.01921","abstract":"Fast screening of drug molecules based on the ligand binding affinity is an important step in the drug discovery pipeline. Graph neural fingerprint is a promising method for developing molecular docking surrogates with high throughput and great fidelity. In this study, we built a COVID-19 drug docking dataset of about 300,000 drug candidates on 23 coronavirus protein targets. With this dataset, we trained graph neural fingerprint docking models for high-throughput virtual COVID-19 drug screening. The graph neural fingerprint models yield high prediction accuracy on docking scores with the mean squared error lower than $0.21$ kcal/mol for most of the docking targets, showing significant improvement over conventional circular fingerprint methods. To make the neural fingerprints transferable for unknown targets, we also propose a transferable graph neural fingerprint method trained on multiple targets. With comparable accuracy to target-specific graph neural fingerprint models, the transferable model exhibits superb training and data efficiency. We highlight that the impact of this study extends beyond COVID-19 dataset, as our approach for fast virtual ligand screening can be easily adapted and integrated into a general machine learning-accelerated pipeline to battle future bio-threats.","creator":"Wei Chen, Yihui Ren, Ai Kagawa, Matthew R. Carbone, Samuel Yen-Chi Chen, Xiaohui Qu, Shinjae Yoo, Austin Clyde, Arvind Ramanathan, Rick L. Stevens, Hubertus J. J. van Dam, Deyu Liu"},{"id":"2308.03527","slug":"exploring-chatgpt-s-empathic-abilities-arxiv-2308-03527v2-cs-ai-updated","title":"Exploring ChatGPT's Empathic Abilities.","link":"http://arxiv.org/abs/2308.03527","abstract":"Empathy is often understood as the ability to share and understand another individual's state of mind or emotion. With the increasing use of chatbots in various domains, e.g., children seeking help with homework, individuals looking for medical advice, and people using the chatbot as a daily source of everyday companionship, the importance of empathy in human-computer interaction has become more apparent. Therefore, our study investigates the extent to which ChatGPT based on GPT-3.5 can exhibit empathetic responses and emotional expressions. We analyzed the following three aspects: (1) understanding and expressing emotions, (2) parallel emotional response, and (3) empathic personality. Thus, we not only evaluate ChatGPT on various empathy aspects and compare it with human behavior but also show a possible way to analyze the empathy of chatbots in general. Our results show, that in 91.7% of the cases, ChatGPT was able to correctly identify emotions and produces appropriate answers. In conversations, ChatGPT reacted with a parallel emotion in 70.7% of cases. The empathic capabilities of ChatGPT were evaluated using a set of five questionnaires covering different aspects of empathy. Even though the results indicate that the empathic abilities of ChatGPT are still below the average of healthy humans, the scores are better than those of people who have been diagnosed with Asperger syndrome / high-functioning autism.","creator":"Kristina Schaaff, Caroline Reinig, Tim Schlippe"},{"id":"2308.07200","slug":"neural-categorical-priors-for-physics-based-character-control-arxiv-2308-07200v2-cs-gr-updated","title":"Neural Categorical Priors for Physics-Based Character Control.","link":"http://arxiv.org/abs/2308.07200","abstract":"Recent advances in learning reusable motion priors have demonstrated their effectiveness in generating naturalistic behaviors. In this paper, we propose a new learning framework in this paradigm for controlling physics-based characters with significantly improved motion quality and diversity over existing state-of-the-art methods. The proposed method uses reinforcement learning (RL) to initially track and imitate life-like movements from unstructured motion clips using the discrete information bottleneck, as adopted in the Vector Quantized Variational AutoEncoder (VQ-VAE). This structure compresses the most relevant information from the motion clips into a compact yet informative latent space, i.e., a discrete space over vector quantized codes. By sampling codes in the space from a trained categorical prior distribution, high-quality life-like behaviors can be generated, similar to the usage of VQ-VAE in computer vision. Although this prior distribution can be trained with the supervision of the encoder's output, it follows the original motion clip distribution in the dataset and could lead to imbalanced behaviors in our setting. To address the issue, we further propose a technique named prior shifting to adjust the prior distribution using curiosity-driven RL. The outcome distribution is demonstrated to offer sufficient behavioral diversity and significantly facilitates upper-level policy learning for downstream tasks. We conduct comprehensive experiments using humanoid characters on two challenging downstream tasks, sword-shield striking and two-player boxing game. Our results demonstrate that the proposed framework is capable of controlling the character to perform considerably high-quality movements in terms of behavioral strategies, diversity, and realism. Videos, codes, and data are available at https://tencent-roboticsx.github.io/NCP/.","creator":"Qingxu Zhu, He Zhang, Mengting Lan, Lei Han"},{"id":"2308.08518","slug":"exploiting-point-wise-attention-in-6d-object-pose-estimation-based-on-bidirectional-prediction-arxiv-2308-08518v3-cs-cv-updated","title":"Exploiting Point-Wise Attention in 6D Object Pose Estimation Based on Bidirectional Prediction.","link":"http://arxiv.org/abs/2308.08518","abstract":"Traditional geometric registration based estimation methods only exploit the CAD model implicitly, which leads to their dependence on observation quality and deficiency to occlusion. To address the problem,the paper proposes a bidirectional correspondence prediction network with a point-wise attention-aware mechanism. This network not only requires the model points to predict the correspondence but also explicitly models the geometric similarities between observations and the model prior. Our key insight is that the correlations between each model point and scene point provide essential information for learning point-pair matches. To further tackle the correlation noises brought by feature distribution divergence, we design a simple but effective pseudo-siamese network to improve feature homogeneity. Experimental results on the public datasets of LineMOD, YCB-Video, and Occ-LineMOD show that the proposed method achieves better performance than other state-of-the-art methods under the same evaluation criteria. Its robustness in estimating poses is greatly improved, especially in an environment with severe occlusions.","creator":"Yuhao Yang, Jun Wu, Yue Wang, Guangjian Zhang, Rong Xiong"},{"id":"2308.11764","slug":"halo-estimation-and-reduction-of-hallucinations-in-open-source-weak-large-language-models-arxiv-2308-11764v4-cs-cl-updated","title":"Halo: Estimation and Reduction of Hallucinations in Open-Source Weak Large Language Models.","link":"http://arxiv.org/abs/2308.11764","abstract":"Large Language Models (LLMs) have revolutionized Natural Language Processing (NLP). Although convenient for research and practical applications, open-source LLMs with fewer parameters often suffer from severe hallucinations compared to their larger counterparts. This paper focuses on measuring and reducing hallucinations in BLOOM 7B, a representative of such weaker open-source LLMs that are publicly available for research and commercial applications. We introduce HaloCheck, a lightweight BlackBox knowledge-free framework designed to quantify the severity of hallucinations in LLMs. Additionally, we explore techniques like knowledge injection and teacher-student approaches to alleviate hallucinations in low-parameter LLMs. Our experiments effectively demonstrate the reduction of hallucinations in challenging domains for these LLMs.","creator":"Mohamed Elaraby, Mengyin Lu, Jacob Dunn, Xueying Zhang, Yu Wang, Shizhu Liu, Pingchuan Tian, Yuping Wang, Yuxuan Wang"},{"id":"2309.00917","slug":"knowledge-graph-embeddings-for-multi-lingual-structured-representations-of-radiology-reports-arxiv-2309-00917v2-cs-cl-updated","title":"Knowledge Graph Embeddings for Multi-Lingual Structured Representations of Radiology Reports.","link":"http://arxiv.org/abs/2309.00917","abstract":"The way we analyse clinical texts has undergone major changes over the last years. The introduction of language models such as BERT led to adaptations for the (bio)medical domain like PubMedBERT and ClinicalBERT. These models rely on large databases of archived medical documents. While performing well in terms of accuracy, both the lack of interpretability and limitations to transfer across languages limit their use in clinical setting. We introduce a novel light-weight graph-based embedding method specifically catering radiology reports. It takes into account the structure and composition of the report, while also connecting medical terms in the report through the multi-lingual SNOMED Clinical Terms knowledge base. The resulting graph embedding uncovers the underlying relationships among clinical terms, achieving a representation that is better understandable for clinicians and clinically more accurate, without reliance on large pre-training datasets. We show the use of this embedding on two tasks namely disease classification of X-ray reports and image classification. For disease classification our model is competitive with its BERT-based counterparts, while being magnitudes smaller in size and training data requirements. For image classification, we show the effectiveness of the graph embedding leveraging cross-modal knowledge transfer and show how this method is usable across different languages.","creator":"Tom van Sonsbeek, Xiantong Zhen, Marcel Worring"},{"id":"2309.00964","slug":"edkm-an-efficient-and-accurate-train-time-weight-clustering-for-large-language-models-arxiv-2309-00964v2-cs-lg-updated","title":"eDKM: An Efficient and Accurate Train-time Weight Clustering for Large Language Models.","link":"http://arxiv.org/abs/2309.00964","abstract":"Since Large Language Models or LLMs have demonstrated high-quality performance on many complex language tasks, there is a great interest in bringing these LLMs to mobile devices for faster responses and better privacy protection. However, the size of LLMs (i.e., billions of parameters) requires highly effective compression to fit into storage-limited devices. Among many compression techniques, weight-clustering, a form of non-linear quantization, is one of the leading candidates for LLM compression, and supported by modern smartphones. Yet, its training overhead is prohibitively significant for LLM fine-tuning. Especially, Differentiable KMeans Clustering, or DKM, has shown the state-of-the-art trade-off between compression ratio and accuracy regression, but its large memory complexity makes it nearly impossible to apply to train-time LLM compression. In this paper, we propose a memory-efficient DKM implementation, eDKM powered by novel techniques to reduce the memory footprint of DKM by orders of magnitudes. For a given tensor to be saved on CPU for the backward pass of DKM, we compressed the tensor by applying uniquification and sharding after checking if there is no duplicated tensor previously copied to CPU. Our experimental results demonstrate that \\prjname can fine-tune and compress a pretrained LLaMA 7B model from 12.6 GB to 2.5 GB (3bit/weight) with the Alpaca dataset by reducing the train-time memory footprint of a decoder layer by 130$\\times$, while delivering good accuracy on broader LLM benchmarks (i.e., 77.7% for PIQA, 66.1% for Winograde, and so on).","creator":"Minsik Cho, Keivan A. Vahid, Qichen Fu, Saurabh Adya, Carlo C Del Mundo, Mohammad Rastegari, Devang Naik, Peter Zatloukal"},{"id":"2309.01955","slug":"a-survey-on-interpretable-cross-modal-reasoning-arxiv-2309-01955v2-cs-ai-updated","title":"A Survey on Interpretable Cross-modal Reasoning.","link":"http://arxiv.org/abs/2309.01955","abstract":"In recent years, cross-modal reasoning (CMR), the process of understanding and reasoning across different modalities, has emerged as a pivotal area with applications spanning from multimedia analysis to healthcare diagnostics. As the deployment of AI systems becomes more ubiquitous, the demand for transparency and comprehensibility in these systems' decision-making processes has intensified. This survey delves into the realm of interpretable cross-modal reasoning (I-CMR), where the objective is not only to achieve high predictive performance but also to provide human-understandable explanations for the results. This survey presents a comprehensive overview of the typical methods with a three-level taxonomy for I-CMR. Furthermore, this survey reviews the existing CMR datasets with annotations for explanations. Finally, this survey summarizes the challenges for I-CMR and discusses potential future directions. In conclusion, this survey aims to catalyze the progress of this emerging research area by providing researchers with a panoramic and comprehensive perspective, illuminating the state of the art and discerning the opportunities. The summarized methods, datasets, and other resources are available at https://github.com/ZuyiZhou/Awesome-Interpretable-Cross-modal-Reasoning.","creator":"Dizhan Xue, Shengsheng Qian, Zuyi Zhou, Changsheng Xu"},{"id":"2309.02561","slug":"physically-grounded-vision-language-models-for-robotic-manipulation-arxiv-2309-02561v2-cs-ro-updated","title":"Physically Grounded Vision-Language Models for Robotic Manipulation.","link":"http://arxiv.org/abs/2309.02561","abstract":"Recent advances in vision-language models (VLMs) have led to improved performance on tasks such as visual question answering and image captioning. Consequently, these models are now well-positioned to reason about the physical world, particularly within domains such as robotic manipulation. However, current VLMs are limited in their understanding of the physical concepts (e.g., material, fragility) of common objects, which restricts their usefulness for robotic manipulation tasks that involve interaction and physical reasoning about such objects. To address this limitation, we propose PhysObjects, an object-centric dataset of 39.6K crowd-sourced and 417K automated physical concept annotations of common household objects. We demonstrate that fine-tuning a VLM on PhysObjects improves its understanding of physical object concepts, including generalization to held-out concepts, by capturing human priors of these concepts from visual appearance. We incorporate this physically-grounded VLM in an interactive framework with a large language model-based robotic planner, and show improved planning performance on tasks that require reasoning about physical object concepts, compared to baselines that do not leverage physically-grounded VLMs. We additionally illustrate the benefits of our physically-grounded VLM on a real robot, where it improves task success rates. We release our dataset and provide further details and visualizations of our results at https://iliad.stanford.edu/pg-vlm/.","creator":"Jensen Gao, Bidipta Sarkar, Fei Xia, Ted Xiao, Jiajun Wu, Brian Ichter, Anirudha Majumdar, Dorsa Sadigh"},{"id":"2309.04802","slug":"cpmr-context-aware-incremental-sequential-recommendation-with-pseudo-multi-task-learning-arxiv-2309-04802v2-cs-ir-updated","title":"CPMR: Context-Aware Incremental Sequential Recommendation with Pseudo-Multi-Task Learning.","link":"http://arxiv.org/abs/2309.04802","abstract":"The motivations of users to make interactions can be divided into static preference and dynamic interest. To accurately model user representations over time, recent studies in sequential recommendation utilize information propagation and evolution to mine from batches of arriving interactions. However, they ignore the fact that people are easily influenced by the recent actions of other users in the contextual scenario, and applying evolution across all historical interactions dilutes the importance of recent ones, thus failing to model the evolution of dynamic interest accurately. To address this issue, we propose a Context-Aware Pseudo-Multi-Task Recommender System (CPMR) to model the evolution in both historical and contextual scenarios by creating three representations for each user and item under different dynamics: static embedding, historical temporal states, and contextual temporal states. To dually improve the performance of temporal states evolution and incremental recommendation, we design a Pseudo-Multi-Task Learning (PMTL) paradigm by stacking the incremental single-target recommendations into one multi-target task for joint optimization. Within the PMTL paradigm, CPMR employs a shared-bottom network to conduct the evolution of temporal states across historical and contextual scenarios, as well as the fusion of them at the user-item level. In addition, CPMR incorporates one real tower for incremental predictions, and two pseudo towers dedicated to updating the respective temporal states based on new batches of interactions. Experimental results on four benchmark recommendation datasets show that CPMR consistently outperforms state-of-the-art baselines and achieves significant gains on three of them. The code is available at: https://github.com/DiMarzioBian/CPMR.","creator":"Qingtian Bian, Jiaxing Xu, Hui Fang, Yiping Ke"},{"id":"2309.05680","slug":"evaluating-chatbots-to-promote-users-trust-practices-and-open-problems-arxiv-2309-05680v2-cs-hc-updated","title":"Evaluating Chatbots to Promote Users' Trust -- Practices and Open Problems.","link":"http://arxiv.org/abs/2309.05680","abstract":"Chatbots, the common moniker for collaborative assistants, are Artificial Intelligence (AI) software that enables people to naturally interact with them to get tasks done. Although chatbots have been studied since the dawn of AI, they have particularly caught the imagination of the public and businesses since the launch of easy-to-use and general-purpose Large Language Model-based chatbots like ChatGPT. As businesses look towards chatbots as a potential technology to engage users, who may be end customers, suppliers, or even their own employees, proper testing of chatbots is important to address and mitigate issues of trust related to service or product performance, user satisfaction and long-term unintended consequences for society. This paper reviews current practices for chatbot testing, identifies gaps as open problems in pursuit of user trust, and outlines a path forward.","creator":"Biplav Srivastava, Kausik Lakkaraju, Tarmo Koppel, Vignesh Narayanan, Ashish Kundu, Sachindra Joshi"},{"id":"2309.05918","slug":"stochastic-llms-do-not-understand-language-towards-symbolic-explainable-and-ontologically-based-llms-arxiv-2309-05918v3-cs-cl-updated","title":"Stochastic LLMs do not Understand Language: Towards Symbolic, Explainable and Ontologically Based LLMs.","link":"http://arxiv.org/abs/2309.05918","abstract":"In our opinion the exuberance surrounding the relative success of data-driven large language models (LLMs) is slightly misguided and for several reasons (i) LLMs cannot be relied upon for factual information since for LLMs all ingested text (factual or non-factual) was created equal; (ii) due to their subsymbolic na-ture, whatever 'knowledge' these models acquire about language will always be buried in billions of microfeatures (weights), none of which is meaningful on its own; and (iii) LLMs will often fail to make the correct inferences in several linguistic contexts (e.g., nominal compounds, copredication, quantifier scope ambi-guities, intensional contexts. Since we believe the relative success of data-driven large language models (LLMs) is not a reflection on the symbolic vs. subsymbol-ic debate but a reflection on applying the successful strategy of a bottom-up reverse engineering of language at scale, we suggest in this paper applying the effective bottom-up strategy in a symbolic setting resulting in symbolic, explainable, and ontologically grounded language models.","creator":"Walid S. Saba"},{"id":"2309.06604","slug":"hybrid-algorithm-selection-and-hyperparameter-tuning-on-distributed-machine-learning-resources-a-hierarchical-agent-based-approach-arxiv-2309-06604v2-cs-lg-updated","title":"Hybrid Algorithm Selection and Hyperparameter Tuning on Distributed Machine Learning Resources: A Hierarchical Agent-based Approach.","link":"http://arxiv.org/abs/2309.06604","abstract":"Algorithm selection and hyperparameter tuning are critical steps in both academic and applied machine learning. On the other hand, these steps are becoming ever increasingly delicate due to the extensive rise in the number, diversity, and distributedness of machine learning resources. Multi-agent systems, when applied to the design of machine learning platforms, bring about several distinctive characteristics such as scalability, flexibility, and robustness, just to name a few. This paper proposes a fully automatic and collaborative agent-based mechanism for selecting distributedly organized machine learning algorithms and simultaneously tuning their hyperparameters. Our method builds upon an existing agent-based hierarchical machine-learning platform and augments its query structure to support the aforementioned functionalities without being limited to specific learning, selection, and tuning mechanisms. We have conducted theoretical assessments, formal verification, and analytical study to demonstrate the correctness, resource utilization, and computational efficiency of our technique. According to the results, our solution is totally correct and exhibits linear time and space complexity in relation to the size of available resources. To provide concrete examples of how the proposed methodologies can effectively adapt and perform across a range of algorithmic options and datasets, we have also conducted a series of experiments using a system comprised of 24 algorithms and 9 datasets.","creator":"Ahmad Esmaeili, Julia T. Rayz, Eric T. Matson"},{"id":"2309.06800","slug":"uncertainty-aware-traffic-prediction-under-missing-data-arxiv-2309-06800v2-cs-lg-updated","title":"Uncertainty-aware Traffic Prediction under Missing Data.","link":"http://arxiv.org/abs/2309.06800","abstract":"Traffic prediction is a crucial topic because of its broad scope of applications in the transportation domain. Recently, various studies have achieved promising results. However, most studies assume the prediction locations have complete or at least partial historical records and cannot be extended to non-historical recorded locations. In real-life scenarios, the deployment of sensors could be limited due to budget limitations and installation availability, which makes most current models not applicable. Though few pieces of literature tried to impute traffic states at the missing locations, these methods need the data simultaneously observed at the locations with sensors, making them not applicable to prediction tasks. Another drawback is the lack of measurement of uncertainty in prediction, making prior works unsuitable for risk-sensitive tasks or involving decision-making. To fill the gap, inspired by the previous inductive graph neural network, this work proposed an uncertainty-aware framework with the ability to 1) extend prediction to missing locations with no historical records and significantly extend spatial coverage of prediction locations while reducing deployment of sensors and 2) generate probabilistic prediction with uncertainty quantification to help the management of risk and decision making in the down-stream tasks. Through extensive experiments on real-life datasets, the result shows our method achieved promising results on prediction tasks, and the uncertainty quantification gives consistent results which highly correlated with the locations with and without historical data. We also show that our model could help support sensor deployment tasks in the transportation field to achieve higher accuracy with a limited sensor deployment budget.","creator":"Hao Mei, Junxian Li, Zhiming Liang, Guanjie Zheng, Bin Shi, Hua Wei"},{"id":"2309.06841","slug":"on-the-local-quadratic-stability-of-t-s-fuzzy-systems-in-the-vicinity-of-the-origin-arxiv-2309-06841v2-eess-sy-updated","title":"On the Local Quadratic Stability of T-S Fuzzy Systems in the Vicinity of the Origin.","link":"http://arxiv.org/abs/2309.06841","abstract":"The main goal of this paper is to introduce new local stability conditions for continuous-time Takagi-Sugeno (T-S) fuzzy systems. These stability conditions are based on linear matrix inequalities (LMIs) in combination with quadratic Lyapunov functions. Moreover, they integrate information on the membership functions at the origin and effectively leverage the linear structure of the underlying nonlinear system in the vicinity of the origin. As a result, the proposed conditions are proved to be less conservative compared to existing methods using fuzzy Lyapunov functions in the literature. Moreover, we establish that the proposed methods offer necessary and sufficient conditions for the local exponential stability of T-S fuzzy systems. The paper also includes discussions on the inherent limitations associated with fuzzy Lyapunov approaches. To demonstrate the theoretical results, we provide comprehensive examples that elucidate the core concepts and validate the efficacy of the proposed conditions.","creator":"Donghwan Lee, Do Wan Kim"}]},{"name":"Plant Biology","feed":[{"id":"2023.09.12.557462v1","slug":"triacylglycerol-stability-limits-futile-cycles-and-inhibition-of-carbon-capture-in-oil-accumulating-tobacco-leaves","title":"Triacylglycerol stability limits futile cycles and inhibition of carbon capture in oil-accumulating tobacco leaves","link":"http://biorxiv.org/cgi/content/short/2023.09.12.557462v1?rss=1","abstract":"Engineering plant vegetative tissue to accumulate triacylglycerols (TAG, e.g., oil) can increase the amount of oil harvested per acre to levels that exceed current oilseed crops. Engineered Nicotiana tabacum (tobacco) lines that accumulate 15% to 30% oil of leaf dry weight resulted in starkly different metabolic phenotypes. In-depth analysis of the leaf lipid accumulation and 14CO2 metabolic tracing mechanistically described metabolic adaptations to the leaf oil engineering. An oil-for-membrane lipid tradeoff in the 15% oil line (referred to as HO) was surprisingly not further exacerbated when lipid production was enhanced to 30% (LEC2 line). The HO line exhibited a futile cycle that limited TAG yield through exchange with starch, altered carbon flux into various metabolite pools and end products, and suggested overlapping pathways of the glyoxylate cycle and photorespiration that limited CO2 assimilation by 50%. In contrast, inclusion of the LEC2 transcription factor in tobacco improved TAG stability, alleviated the TAG-to-starch futile cycle, and recovered CO2 assimilation and plant growth comparable to wild type but with much higher lipid levels in the leaves. Thus, the unstable production of storage reserves and futile cycling limit vegetative oil engineering approaches. The capacity to overcome futile cycles and maintain enhanced stable TAG levels in LEC2 demonstrated the importance of considering unanticipated metabolic adaptations while engineering vegetative oil crops.","creator":"Johnson, B. S., Allen, D. K., Bates, P. D."},{"id":"2023.09.10.557080v1","slug":"the-effect-of-sunlight-intensity-on-flower-opening-time-and-exposure-duration-in-rice-oryza-sativa-ssp-indica-landraces","title":"The Effect of Sunlight Intensity on Flower Opening Time and Exposure Duration in Rice (Oryza sativa ssp. indica) Landraces","link":"http://biorxiv.org/cgi/content/short/2023.09.10.557080v1?rss=1","abstract":"We recorded sunlight intensity at anthesis of 390 rice landraces flowering in short-day season, and find that flower opening time (FOT) is delayed but flower exposure duration (FED) is shortened on cloudy days (<30000 lux). These results construe a reversal of the effect previously reported from a larger set of 1114 landaces (including the 390 landraces in this study), recorded during short-day and long-day seasons over 3 years. To resolve this Simpsons paradox, we subsequently recorded solar illuminance at FOT of 25 landrace populations, half of which was open to direct sunlight, compared to another half under shade. This experiment revealed that low sunlight intensity, mimicking cloudy days, significantly delays FOT, corroborating the pattern detected in our earlier findings. However, experimental shading has an indeterminate effect on FED of the same landraces. We hypothesize that the delayed FOT on overcast days is an adaptation in rice plants in anticipation of rain, for protection of the pollen from rainwash.","creator":"Deb, D., Dutta, S., Nauri, M."},{"id":"2023.09.12.557332v1","slug":"sterol-3-beta-glucosyltransferase-transparent-testa15-controls-seed-development-and-flavanol-accumulation-through-its-role-in-vacuole-biogenesis-and-maintenance-in-arabidopsis","title":"Sterol 3-beta-Glucosyltransferase TRANSPARENT TESTA15 Controls Seed Development and Flavanol Accumulation through its Role in Vacuole Biogenesis and Maintenance in Arabidopsis","link":"http://biorxiv.org/cgi/content/short/2023.09.12.557332v1?rss=1","abstract":"The Arabidopsis sterol 3-beta-glucosyltransferase UGT80B1/TRANSPARENT TESTA15 (TT15) catalyzes sterol glucoside biosynthesis. Its loss of function causes reduced seed size, defective flavanol, polysaccharide and lipid polyester deposition at the seed coat and reduced seed dormancy. How TT15 controls seed development and physiology is unknown. Here we show that tt15 mutants exhibit seed lethality with incomplete penetrance and maternal determinism that is correlated with endosperm cellularization defects, together with an increased sensitivity of seed germination to exogenous abscisic acid and paclobutrazol. We also reveal that flavanol deposition in the vacuole during tt15 seed development triggers premature endothelium cell death. An autoimmune-like syndrome characterized by callose and H2O2 accumulation was detected in endothelium at the seed abaxial pole. Similar phenotypes were observed with tt9/gfs9, a mutant defective in endomembrane trafficking and homotypic vacuole fusion. Double mutant analysis showed that tt9 partially rescued tt15 endothelium phenotypes. Consistent with seed mutant phenotypes, TT15 promoter activity was detected in endothelium and endosperm and TT15 protein was located mainly at the vacuolar membrane (tonoplast). Using fluorescence recovery after photobleaching, we demonstrated that tonoplast fluidity was increased in tt15 roots. Altogether our data suggest that TT15 regulates seed development and flavanol accumulation by modulating vacuole biogenesis and maintenance.","creator":"Akary, E., Berger, A., Perreau, F., Frey, A., To, A., Citerne, S., Schaller, H., Vernhettes, S., Grandjean, O., Nesi, N., Marion-Poll, A., Lepiniec, L., Debeaujon, I."},{"id":"2023.09.12.557336v1","slug":"a-mathematical-model-of-photoinhibition-exploring-the-impact-of-quenching-processes","title":"A mathematical model of photoinhibition: exploring the impact of quenching processes","link":"http://biorxiv.org/cgi/content/short/2023.09.12.557336v1?rss=1","abstract":"Plants are constantly exposed to changing environments, sometimes leading to extreme conditions and stress. For example, sudden exposure to high light leads to excess absorbed light energy, causing reactive oxygen species (ROS) formation. ROS damage the photosynthetic machinery, particularly the D1 protein in photosystem II (PSII), which therefore needs to be continuously repaired and replaced. The effect of the damage inflicted by high light is a prolonged decrease in photosynthetic efficiency. Hence, it is not surprising that photoinhibition has been subject to numerous experimental studies investigating its effects in the context of crop productivity. However, it has become apparent that classical measures of photoinhibition, i.e., changes in the chlorophyll fluorescence parameter Fv/Fm, are not only determined by the loss of PSII core function but also by processes such as energy transfer and quenching. Mathematical models can help dissect the influences on such fluorescence signals and quantify the contributions of various interacting mechanisms. We present a mathematical model with a dynamic description of the photosynthetic electron transport chain (PETC), non-photochemical quenching, and photoinhibition. With our model, we investigate the interconnection between quenching, photoprotection, and fluorescence using simulations and experimental data. We found that different energy-dissipating properties of intact and damaged PSIIs, as well as energy transfer between PSIIs, are critical components that need to be included in the model to ensure a satisfactory fit to the experimental data. We envisage that our model provides a framework for future investigations of photoinhibition dynamics and its importance for plant growth and yield.","creator":"Nies, T., Matsubara, S., Ebenhoeh, O."},{"id":"2023.09.11.557125v1","slug":"a-novel-workflow-for-unbiased-quantification-of-autophagosomes-in-3d-in-arabidopsis-thaliana-roots","title":"A novel workflow for unbiased quantification of autophagosomes in 3D in Arabidopsis thaliana roots","link":"http://biorxiv.org/cgi/content/short/2023.09.11.557125v1?rss=1","abstract":"Macroautophagy is frequently quantified by live imaging of autophagosomes decorated with a marker of fluorescently tagged ATG8 protein (FT-ATG8) in Arabidopsis thaliana. This requires generation of suitable plant material by time-consuming crossing or transformation with FT-ATG8 marker. Autophagosome quantification by image analysis often relies on their counting in individual focal planes. This approach is prone to deliver biased results due to inappropriate sampling of the regions of interest in the Z-direction, as the actual 3D distribution of autophagosomes is usually not taken into account. To overcome such drawbacks, we have developed and tested a workflow consisting of immunofluorescence microscopy of autophagosomes labelled with anti-ATG8 antibody followed by stereological image analysis employing the optical disector and the Cavalieri principle. Our immunolabelling protocol specifically recognized autophagosomes in epidermal cells of A. thaliana root. Higher numbers of immunolabelled autophagosomes were observed when compared with those recognized with FT-AtATG8e marker, suggesting that single AtATG8 isoform markers cannot detect all autophagosomes in a cell. Therefore, immunolabelling provides more precise information as the anti-ATG8 antibody recognizes virtually all AtATG8 isoforms. The number of autophagosomes per tissue volume determined by stereological methods correlated with the intensity of autophagy induction treatment. Compared to autophagosome quantifications in maximum intensity projections, stereological methods detected autophagosomes present in a given volume with higher accuracy. Our novel application of immunolabelling combined with stereological methods constitutes a powerful toolbox for unbiased and reproducible quantification of autophagosomes and offers a convenient alternative to the standard of live imaging using FP-ATG8 marker.","creator":"Danek, M., Kocourkova, D., Podmanicka, T., Eliasova, K., Nesvadbova, K., Krupar, P., Martinec, J."},{"id":"2023.09.12.555306v1","slug":"carotenoid-metabolism-negatively-regulates-auxin-mediated-root-growth","title":"Carotenoid metabolism negatively regulates auxin-mediated root growth","link":"http://biorxiv.org/cgi/content/short/2023.09.12.555306v1?rss=1","abstract":"Carotenoids support plant developmental activities as photosynthesis and photoprotective pigments, and also provide precursors for production of phytohormone abscisic acid and strigolactones, or bioactive apocarotenoids. Herein, we examined the role of carotenoid as a source of apocarotenoids, which control endogenous auxin levels and plant root architecture. Inhibiting {beta}-carotene biosynthesis by phytoene desaturase (PDS) inhibitor fluridone suppresses root growth, consequently inducing lateral root growth. PDS was confirmed to be the target of fluridone via the expression of the fluridone-insensitive trait 35S::mHvPDS in an Arabidopsis plant. Inhibiting {beta}-carotene biosynthesis elevated endogenous auxin levels and activated auxin signaling, thereby suppressing root growth. In addition, the root growth of the auxin-deficient mutant yucQ was partially restored via fluridone treatment. These results indicate that suppressing PDS activity increases endogenous auxin levels and suppresses root growth. Conversely, the carotenoid pool indirectly suppresses endogenous auxin levels. Exogenous application of retinal, apocarotenoid derived from {beta}-carotene, complemented fluridone-mediated root growth inhibition and partially recovered auxin-mediated growth inhibition. Moreover, retinal inhibited the induction of the auxin-inducible reporter pIAA19::ElucPEST, indicating an antagonistic effect of retinal on endogenous auxin levels. Interestingly, the auxin-deficient mutants wei2 wei7 and yucQ accumulated more {beta}-carotene compared with the wild type. The expression of CCDs, which converts {beta}-carotene into apocarotenoids, is auxin-inducible and increases following fluridone treatment. These results indicate feedback regulation during apocarotenoid biosynthesis in plant tissue. Thus, we conclude carotenoid regulates auxin levels and response, and this regulation is intermediated by apocarotenoid retinal.","creator":"Xu, K., Zeng, H., Yumoto, E., Asahina, M., Hayashi, K.-i., Fukaki, H., Ito, H., Watahiki, M. K."},{"id":"2023.09.11.557157v1","slug":"single-plant-omics-reveals-the-cascade-of-transcriptional-changes-during-the-vegetative-to-reproductive-transition","title":"Single-plant-omics reveals the cascade of transcriptional changes during the vegetative-to-reproductive transition","link":"http://biorxiv.org/cgi/content/short/2023.09.11.557157v1?rss=1","abstract":"Plants undergo rapid developmental transitions, as well as gradual developmental processes. Moreover, individual plants within a population will undergo the developmental transitions asynchronously, so it is difficult to assemble a time series to resolve the sequence of transcriptional changes that take place during these rapid transitions. Single-plant-omics has the potential to distinguish between transcriptional events that are associated with these binary and continuous processes. Furthermore, we can utilise single-plant-omics to exploit this developmental asynchrony to order individual plants by their developmental trajectory, revealing a detailed cascade of transcriptional events. Here, we utilise single-plant-transcriptomics to resolve the transcriptional events that coincide with the onset of bolting. We performed RNA-seq on the leaves of individual plants from a large population of wild type Arabidopsis thaliana replicated at one time point during the vegetative-to-reproductive transition. Even though more than half of transcripts were differentially expressed between bolted and unbolted plants, we were able to find a subset of regulators that were more closely associated with gradual developmental traits like leaf size and biomass. Using a novel pseudotime inference algorithm, we determined that some senescence-associated processes, such as the reduction in ribosome biogenesis, are evident in the transcriptome before a bolt is visible. These results show the potential of single-plant-omics to reveal the detailed sequence of events that occur during rapid developmental transitions.","creator":"Redmond, E. J., Ronald, J., Davis, S. J., Ezer, D."},{"id":"2023.09.10.556599v1","slug":"evolutionarily-conserved-cki1-mediated-two-component-signaling-is-required-for-female-germline-specification-in-marchantia-polymorpha","title":"Evolutionarily Conserved CKI1-Mediated Two-Component Signaling is Required for Female Germline Specification in Marchantia polymorpha","link":"http://biorxiv.org/cgi/content/short/2023.09.10.556599v1?rss=1","abstract":"In land plants, gametes derive from a small number of dedicated haploid cells. In angiosperms, one central cell and one egg cell are differentiated in the embryo sac as female gametes for double fertilization, while in non-flowering plants, only one egg cell is generated in the female sexual organ, called the archegonium. The central cell specification of Arabidopsis thaliana is controlled by the histidine kinase CYTOKININ-INDEPENDENT 1 (CKI1), which is a two-component signaling (TCS) activator sharing downstream regulatory components with the cytokinin signaling pathway. Our phylogenetic analysis suggested that CKI1 orthologs broadly exist in land plants. However, the role of CKI1 in the archegonium-bearing non-flowering plants remains unclear. Here we found that the sole CKI1 ortholog in the liverwort Marchantia polymorpha, MpCKI1, which functions through conserved downstream TCS components, regulates the female germline specification for egg cell development in the archegonium. In M. polymorpha, the archegonium develops three-dimensionally from a single cell, accumulating MpBONOBO (MpBNB), a master regulator for germline initiation and differentiation. We visualized female germline specification by capturing the distribution pattern of MpBNB in the discrete stages of early archegonium development, and found that the MpBNB accumulation is restricted to female germline cells. MpCKI1 is required for the proper MpBNB accumulation in the female germline, and is critical for the asymmetric cell divisions that specify the female germline cells. These results suggest that CKI1-mediated TCS originated during early land plant evolution and participates in female germ cell specification in deeply-diverged plant lineages.","creator":"Bao, H., Sun, R., Iwano, M., Yoshitake, Y., Aki, S. S., Umeda, M., Nishihama, R., Yamaoka, S., Kohchi, T."},{"id":"2023.09.10.557017v1","slug":"adapting-to-heat-stress-by-sowing-summer-grain-crops-early-in-late-winter-sorghum-root-growth-water-use-and-yield","title":"Adapting to heat stress by sowing summer grain crops early in late winter: Sorghum root growth, water use, and yield","link":"http://biorxiv.org/cgi/content/short/2023.09.10.557017v1?rss=1","abstract":"CONTEXT: Drought and extreme heat at flowering are common stresses limiting the yield of summer crops, which are likely to intensify and become more frequent as projected under climate change. OBJECTIVE: This study explores the idea that adaptation to these stresses could be increased by sowing summer crops early in late winter or spring, to avoid the overlap with critical crop stages around flowering. Here we report on the impacts of early sowing i.e., in late winter and spring on sorghum crop and root growth and function (i.e., water use), and final grain yield. METHODS: Two seasons of on-farm genotype (G) by environment (E) by management (M) sorghum experimentation were conducted in the Darling Downs region of Queensland, Australia. Each trial consisted of a factorial combination of three times of sowing (TOS, referred to as late winter, spring, and summer), two levels of irrigation, four target plant populations, and six commercial genotypes. Treatments were replicated three times. Crop roots and shoot were sampled at the flag leaf stage for each TOS. Crop water use across the growing season was monitored using time-lapse electromagnetic induction (EMI) surveys. EMI was also used to calculate a root activity factor. Final grain yield and yield components were determined at maturity. RESULTS: Results showed that TOS, irrigation levels, and their interactions significantly influenced crop root and shoot traits, water use, and yield, though results were not always consistent across seasons. In the first season which was dry and had large temperature contrasts between TOS, crop growth in the early sown crops was primarily limited by temperature. In contrast, the second season was much warmer and crop growth was instead primarily limited by water availability. Cold air and soil temperatures in the early sowing dates during the first season i.e., late winter and spring, lead to smaller crops with smaller rooting systems and root-to-shoot ratios, and roots having a larger average root diameter. In general terms, root length growth and root length density responded positively to increasing pre-flowering mean air temperatures ranging between 16 and 20C, while root average diameters were larger below 19 or above 21C. Early sowing advanced flowering and therefore decreased the risk of extreme heat during the critical stages around flowering and affected water use before and after flowering. The root activity factor was directly related to the crop root length density. The early sown crops increased yield by transferring water use from vegetative to reproductive stages. The larger yield of early sown sorghum was associated with larger grain numbers. Early sown crops had larger values of water use efficiency associated with larger total grain numbers, particularly for the tillers. As expected, the lowest values of water use efficiency were observed in irrigated and summer sown crops. The early sowing times left more water in the soil profile at maturity, particularly under irrigated conditions and with small plant populations. CONCLUSIONS: We conclude that early sown sorghum is a potential option to increase crop adaptation to hotter and drier environments. Here we propose that in the race to increase crop adaptation to heat stresses, plant breeding efforts should consider cold tolerance traits during crop germination, emergence, and early vegetative stages so that sorghum sowing windows could be significantly advanced.","creator":"Zhao, D., deVoil, P., G. Rognoni, B., Wilkus, E., Eyre, J., Broad, I., Rodriguez, D."},{"id":"2023.09.08.556755v1","slug":"transcriptional-modulation-during-photomorphogenesis-in-rice-seedlings","title":"Transcriptional modulation during photomorphogenesis in rice seedlings","link":"http://biorxiv.org/cgi/content/short/2023.09.08.556755v1?rss=1","abstract":"Light is one of the most important factors regulating plant gene expression patterns, metabolism, physiology, growth, and development. To explore how light may induce or alter transcript splicing, we conducted RNA-Seq-based transcriptome analyses by comparing the samples harvested as etiolated seedlings grown under continuous dark conditions vs. the light-treated green seedlings. We identified 14,766 differentially expressed genes, of which 4369 genes showed alternative splicing. We observed that genes mapped to the plastid-localized methyl-erythritol-phosphate (MEP) pathway were upregulated in light compared to the cytosolic mevalonate (MVA) pathway genes. Many of these genes also undergo splicing. These pathways provide crucial metabolite precursors for the biosynthesis of secondary metabolic compounds needed for chloroplast biogenesis, the establishment of successful photosynthetic apparatus, and photomorphogenesis. In the chromosome-wide survey of the light-induced transcriptome, we observed intron retention as the most predominant splicing event. In addition, we identified 1709 novel lncRNA transcripts in our transcriptome data.","creator":"Jaiswal, P., Gupta, P."},{"id":"2023.09.09.556983v1","slug":"a-key-role-of-pectin-demethylation-mediated-cell-wall-na-retention-in-regulating-differential-salt-stress-resistance-in-allotetraploid-rapeseed-genotypes","title":"A key role of pectin demethylation-mediated cell wall Na+ retention in regulating differential salt stress resistance in allotetraploid rapeseed genotypes","link":"http://biorxiv.org/cgi/content/short/2023.09.09.556983v1?rss=1","abstract":"Allotetraploid rapeseed (Brassica napus L.) is highly susceptible to salt stress, a worldwide limiting factor that causes severe losses in seed yield. Genetic variations in the resistance against salt stress found in rapeseed genotypes emphasizes the complex response architecture. Westar is ubiquitously used as a major transgenic receptor, and ZS11 is widely grown as a high production and good quality cultivar. In this study, Westar was identified to outperform than ZS11 under salt stress. Through cell component isolation, non-invasive micro-test, X-ray energy spectrum analysis, and ionomic profiling characterization, pectin demethylation was found to be a major regulator for differential salt resistance between Westar and ZS11. Integrated analyses of genome-wide DNA variations, differentially expression profiling, and gene co-expression network identified BnaC9.PME47, encoding pectin methyl esterase, as a positive regulator mainly responsible for salt stress resistance. BnaC9.PME47, located in two reported QTLs regions for salt resistance, was strongly induced by salt stress and localized on the cell wall. Natural variation of the promoter regions conferred higher expression of BnaC9.PME47 in Westar than in other salt-sensitive rapeseed genotypes. Loss-of-function of AtPME47 resulted in the hypersensitivity of Arabidopsis plants to salt stress. This study facilitates a more comprehensive understanding of the differential morpho-physiological and molecular responses to salt stress and abundant genetic diversity in rapeseed genotypes, and the integrated multiomics analyses provide novel insights regarding the rapid dissection of quantitative trait genes responsible for nutrient stresses in plant species with complex genomes.","creator":"Zhou, T., Wu, P.-j., Chen, J.-f., Du, X.-q., Feng, Y.-n., Yue, C.-p., Huang, J.-y., Hua, Y.-p."},{"id":"2023.09.09.556968v1","slug":"comparison-of-the-microbiome-and-mycobiome-in-tissues-of-the-tropical-carnivorous-epiphytic-herb-utricularia-jamesoniana","title":"Comparison of the microbiome and mycobiome in tissues of the tropical carnivorous epiphytic herb Utricularia jamesoniana","link":"http://biorxiv.org/cgi/content/short/2023.09.09.556968v1?rss=1","abstract":"Utricularia jamesoniana, a small epiphytic plant found in wet tropical forests, stands out for its carnivorous habit, intricate trap system, and small but beautiful and complex flowers. This species remains relatively understudied despite its wide geographical distribution and curious adaptations. In this study, we employed 16S rRNA and ITS sequencing to compare the prokaryotic and fungal communities within leaves and traps of U. jamesoniana. The analysis of amplicon sequence variants (ASVs) unveiled notable differences in community composition depending on the plant tissue and type of microorganism. Prokaryotic communities predominantly comprised Proteobacteria and Actinobacteriota, featuring genera such as Acidocella, Bradyrhizobium, Ferritrophicum, and Ferrovum. Fungal communities were dominated by Ascomycota and Basidiomycota, encompassing representatives of Dothideomycetes, Sordariomycetes, Eurotiomycetes, and Agaricomycetes, as well as ASVs related to Mycosphaerellaceae, Colletotrichum, Aspergillus, and Thanatephorus. We determined that the prokaryotic diversity has higher in the bladders with respect to the leaves. Fungal communities, in turn, were more diverse in leaves than in bladders. This study sheds light on the microbial communities associated with this carnivorous epiphyte and provides valuable insights into the intricate relationships between the plant and its microbial inhabitants across different tissues.","creator":"Naranjo, V., Mora, R. A., Morera, J., Acuna-Castillo, R., Rojas-Jimenez, K."},{"id":"2023.09.07.556738v1","slug":"stacking-of-prrs-in-potato-to-achieve-enhanced-resistance-against-phytophthora-infestans","title":"Stacking of PRRs in potato to achieve enhanced resistance against Phytophthora infestans","link":"http://biorxiv.org/cgi/content/short/2023.09.07.556738v1?rss=1","abstract":"Plants employ pattern recognition receptors (PRRs) to sense pathogen-associated molecular patterns (PAMPs) or apoplastic effectors at the plant cell surface, as well as nucleotide-binding domain leucine-rich-repeat-containing receptors (NLRs) to sense effectors inside the plant cell. Breeding for potato resistance to P. infestans has focused on the use of NLRs, however, these genes are typically quickly overcome since the matching avirulence genes evolve exceptionally quickly. Here, we stacked two PRRs, PERU and RLP23, that recognize the rather conserved Phytophthora PAMPs Pep-13/25 and nlp20, respectively, in the potato cultivar Atlantic, and evaluated their effect on P. infestans resistance. We found that PERU and RLP23 cooperate for the early immune responses like the accumulation of reactive oxygen species (ROS) and production of ethylene by recognizing their corresponding PAMPs. Furthermore, we show that potato plants overexpressing these two PRRs are slightly less affected by P. infestans compared to the single transformants. Together, our data suggest that pyramiding of surface receptors can provide additional enhanced resistance against pathogens, however, more effective or synergistic combinations that may include intracellular NLR receptors should be explored.","creator":"Ascurra, Y. C. T., Wouters, D., Visser, R., Nuernberger, T., Vleeshouwers, V."},{"id":"2023.09.09.556951v1","slug":"control-of-cell-fate-specification-and-patterning-by-an-ancestral-microrna","title":"Control of cell fate specification and patterning by an ancestral microRNA","link":"http://biorxiv.org/cgi/content/short/2023.09.09.556951v1?rss=1","abstract":"The formation of an organized body requires the establishment and maintenance of cells with structural and functional distinctive characteristics. A central question in developmental biology is how changes in the regulation of genes drive cell specification and patterning1. microRNAs (miRNAs) are small non-coding RNAs that regulate development through mRNA cleavage and/or translational repression2. In plants, miRNAs regulate key aspects including growth, development, stem cell maintenance, vegetative phase change, leaf morphogenesis, floral organ formation and flowering time3. Biogenesis of plant miRNAs depends on the activity of DICER-LIKE 1 (DCL1), an RNase type III endonuclease that processes double stranded RNA to give rise to mature miRNAs 4 . The genomes of today's flora contain at least one bona fide copy of DCL1 5,6. Using Marchantia polymorpha -a model bryophyte that allows comparative approaches to infer characteristics of the ancestral land plant-, we demonstrate that MpDCL1a is required for the biogenesis of miRNAs and uncovered a central role for miR166/Homeodomain Zipper Class III-regulated auxin synthesis in the specification of cell identity, patterning, meristem function, laminar expansion and the development of the body in the last common ancestor of extant land plants.","creator":"Aguilar-Cruz, A., Flores-Sandoval, E., Gutierrez-Ramos, X., Oltehua-Lopez, O., Dorantes-Acosta, A. E., Trujillo, J. T., Kato, H., Ishizaki, K., Mosher, R. A., Dolan, L., Grimanelli, D., Haseloff, J., Bowman, J. L., Arteaga-Vazquez, M. A."},{"id":"2023.09.10.557053v1","slug":"genome-size-is-positively-correlated-with-extinction-risk-in-herbaceous-angiosperms","title":"Genome size is positively correlated with extinction risk in herbaceous angiosperms","link":"http://biorxiv.org/cgi/content/short/2023.09.10.557053v1?rss=1","abstract":"O_LIAngiosperms with large genomes experience nuclear-, cellular- and organism-level constraints that may limit their phenotypic plasticity and ecological niche. These constraints have been documented to vary across lineages, life-history strategies, ecogeographic patterns and environmental conditions. Therefore, we test the hypotheses that extinction risk is higher in large-genomed compared to small-genomed species, and that the effect of genome size varies across three selected covariates: life form, endemism, and climatic zones. C_LIO_LIWe collated genome size and extinction risk information for a representative sample of angiosperms comprising 3,250 species, which we analyzed alongside life form, endemism and climate variables using a phylogenetic framework. C_LIO_LIAngiosperm genome size is positively correlated with extinction risk, a pattern driven by a signal in herbaceous but not woody species, regardless of climate and endemism. The influence of genome size is stronger in endemic herbaceous species, but is relatively homogenous across different climates. Beyond its indirect link via endemism and climate, genome size also influences extinction risk directly and significantly. C_LIO_LIGenome size may serve as a proxy for difficult-to-measure parameters associated with resilience and vulnerability in herbaceous angiosperms. Therefore, it merits further exploration as a useful biological attribute for understanding intrinsic extinction risk and augmenting plant conservation efforts. C_LI","creator":"Gomez, M. S., Brown, M. J., Pironon, S., Vesely, P., Bures, P., Elliott, T. L., Zedek, F., Pellicer, J., Forest, F., Lughadha, E. N., Leitch, I. J."},{"id":"2023.09.09.556959v1","slug":"cellular-gibberellin-dynamics-govern-indeterminate-nodule-development-morphologyand-function","title":"Cellular gibberellin dynamics govern indeterminate nodule development, morphologyand function","link":"http://biorxiv.org/cgi/content/short/2023.09.09.556959v1?rss=1","abstract":"During nutrient scarcity, plants can adapt their developmental strategy to maximize their chance of survival. Such plasticity in development is underpinned by hormonal regulation, which mediates the relationship between environmental cues and developmental outputs. In legumes, endosymbiosis with nitrogen fixing bacteria (rhizobia) is a key adaptation for supplying the plant with nitrogen in the form of ammonium. Rhizobia are housed in lateral root-derived organs termed nodules that maintain an environment conducive to Nitrogenase in these bacteria. Several phytohormones are important for regulating the formation of nodules, with both positive and negative roles proposed for gibberellin (GA). In this study, we determined the cellular location and function of bioactive GA during nodule organogenesis using a genetically-encoded second generation GA biosensor, GPS2. We found endogenous bioactive GA accumulates locally at the site of nodule primordia, increasing dramatically in the cortical cell layers, persisting through cell divisions and maintaining accumulation in the mature nodule meristem. We show, through mis-expression of GA catabolic enzymes that suppress GA accumulation, that GA acts as a positive regulator of nodule growth and development. Furthermore, increasing or decreasing GA through perturbation of biosynthesis gene expression can increase or decrease the size of nodules, respectively. This is unique from lateral root formation, a developmental program that shares common organogenesis regulators. We link GA to a wider gene regulatory program by showing that cytokinin as well as nodule-identity genes induce and sustain GA accumulation necessary for nodule function.","creator":"Drapek, C., Radzman-Mohd, N. A., Rizza, A., Schiessl, K., Dos Santos Barbosa, F., Wen, J., Oldroyd, G. E. D., Jones, A. M."},{"id":"2023.09.08.556869v1","slug":"the-chloroplastic-phosphate-transporter-crpht4-7-supports-phosphate-homeostasis-and-photosynthesis-in-chlamydomonas","title":"The chloroplastic phosphate transporter CrPHT4-7 supports phosphate homeostasis and photosynthesis in Chlamydomonas","link":"http://biorxiv.org/cgi/content/short/2023.09.08.556869v1?rss=1","abstract":"In eukaryotic cells, phosphorus is assimilated and utilized primarily as phosphate (Pi). Pi homeostasis is mediated by transporters that have not yet been adequately characterized in green algae. This study reports on CrPHT4-7 from Chlamydomonas reinhardtii, a member of the PHT4 transporter family, which exhibits remarkable similarity to AtPHT4;4 from Arabidopsis thaliana, a chloroplastic ascorbate transporter. Using fluorescent protein tagging we show that CrPHT4-7 resides in the chloroplast envelope membrane. Crpht4-7 mutants, generated by the CRISPR/Cas12a-mediated single-strand templated repair, show retarded growth especially in high light, enhanced sensitivity to phosphorus limitation, reduced ATP level, strong ascorbate accumulation and diminished non-photochemical quenching in high light. Conversely, CrPHT4-7 overexpressing lines exhibit enhanced biomass accumulation under high light conditions in comparison with the wild-type strain. Expressing CrPHT4-7 in a yeast strain lacking Pi transporters substantially recovered its slow growth phenotype demonstrating that it transports Pi. Even though CrPHT4-7 shows a high degree of similarity to AtPHT4;4, it does not display any significant ascorbate transport activity in yeast or intact algal cells. Thus, the results demonstrate that CrPHT4-7 functions as a chloroplastic Pi transporter essential for maintaining Pi homeostasis and photosynthesis in Chlamydomonas reinhardtii.  One-sentence summaryWe demonstrate that the CrPHT4-7 transporter of Chlamydomonas reinhardtii is located in the chloroplast envelope membrane and contributes to maintaining phosphate homeostasis and photosynthesis.","creator":"Toth, D., Kuntam, S., Ferenczi, A., Vidal-Meireles, A., Kovacs, L., Wang, L., Sarkadi, Z., Migh, E., Szentmihalyi, K., Tengolics, R., Neupert, J., Bock, R., Jonikas, M. C., Molnar, A., Toth, S. Z."},{"id":"2023.09.07.556601v1","slug":"nbptr1-confers-resistance-against-pseudomonas-syringae-pv-actinidiae-in-kiwifruit","title":"NbPTR1 confers resistance against Pseudomonas syringae pv. actinidiae in kiwifruit","link":"http://biorxiv.org/cgi/content/short/2023.09.07.556601v1?rss=1","abstract":"Pseudomonas syringae pv. actinidiae biovar 3 (Psa3) causes a devastating canker disease in yellow-fleshed kiwifruit (Actinidia chinensis). The effector HopZ5, which is present in all isolates of Psa3 causing global outbreaks of pandemic kiwifruit canker disease, triggers immunity in Nicotiana benthamiana and is not recognised in susceptible A. chinensis cultivars. In a search for N. benthamiana non-host resistance genes against HopZ5, we found that the nucleotide-binding leucine-rich repeat receptor NbPTR1 recognised HopZ5. RPM1-interacting protein 4 (RIN4) orthologues from multiple plants, including kiwifruit, were associated with NbPTR1-mediated autoimmunity suppression and recognition of HopZ5. No functional orthologues of NbPTR1 were found in A. chinensis. NbPTR1 transformed into Psa3-susceptible A. chinensis var. chinensis  Hort16A plants introduced HopZ5-specific resistance against Psa3. Altogether, this study suggested that expressing NbPTR1 in Psa3-susceptible kiwifruit is a viable approach to acquiring resistance to Psa3 and it provides valuable information for engineering resistance in otherwise susceptible kiwifruit genotypes.","creator":"Yeh, S.-M., Yoon, M., Scott, S., Chatterjee, A., Hemara, L., Chen, R., Wang, T., Templeton, K., Rikkerink, E., Jayaraman, J., Brendolise, C."},{"id":"2023.09.08.556846v1","slug":"yerba-mate-ilex-paraguariensis-genome-provides-new-insights-into-convergent-evolution-of-caffeine-biosynthesis","title":"Yerba mate (Ilex paraguariensis) genome provides new insights into convergent evolution of caffeine biosynthesis","link":"http://biorxiv.org/cgi/content/short/2023.09.08.556846v1?rss=1","abstract":"Yerba mate (Ilex paraguariensis) is an economically important crop marketed for the elaboration of mate, the third-most widely consumed caffeine-containing infusion worldwide. Here we report the first genome assembly of this species, which has a total length of 1.06 Gb and contains 53,390 protein-coding genes. Comparative analyses revealed that the large yerba mate genome size is partly due to a whole-genome duplication (Ip-) during the early evolutionary history of Ilex, in addition to the hexaploidization event ({gamma}) shared by core eudicots. Characterization of the genome allowed us to clone the genes encoding methyltransferase enzymes that catalyse multiple reactions required for caffeine production. To our surprise, this species has converged upon a different biochemical pathway compared to that of its relatives, coffee and tea. In order to gain insight into the structural basis for the convergent enzyme activities, we obtained a crystal structure for the terminal enzyme in the pathway that forms caffeine. The structure reveals that convergent solutions have evolved for substrate positioning because different amino acid residues facilitate a different substrate orientation such that efficient methylation occurs in the independently evolved enzymes in yerba mate and coffee. While our results show phylogenomic constraint limits the genes coopted for convergence of caffeine biosynthesis, the x-ray diffraction data suggests structural constraints are minimal for the convergent evolution of individual reactions.","creator":"Vignale, F. A., Hernandez Garcia, A., Modenutti, C. P., Sosa, E. J., Defelipe, L. A., Oliveira, R. R. M., Nunes, G. L., Acevedo, R. M., Burguener, G. F., Rossi, M., Zapata, P. D., Marti, D. A., Oliveira, G., Smith, M. N., Dubs, N. M., Nair, S., Barkman, T. J., Turjanski, A. G."},{"id":"2023.09.06.556598v1","slug":"atdreb2g-is-a-novel-regulator-of-riboflavin-biosynthesis-under-low-temperature-stress-and-abscisic-acid-treatment-in-arabidopsis-thaliana","title":"AtDREB2G is a novel regulator of riboflavin biosynthesis under low-temperature stress and abscisic acid treatment in Arabidopsis thaliana","link":"http://biorxiv.org/cgi/content/short/2023.09.06.556598v1?rss=1","abstract":"Riboflavin (RF) serves as a precursor to FMN and FAD, crucial cofactors in various metabolic processes. Strict regulation of cellular flavin homeostasis is imperative, yet information regarding the factors governing this regulation remains largely elusive. In this study, we first examined the impact of external flavin treatment on the Arabidopsis transcriptome to identify novel regulators of cellular flavin levels. Our analysis revealed alterations in the expression of 49 putative transcription factors. Subsequent reverse genetic screening highlighted a member of the Dehydration-Responsive Element Binding (DREB) family, AtDREB2G, as a potential regulator of cellular flavin levels. Knockout mutants of AtDREB2G (dreb2g) exhibited reduced flavin levels and decreased expression of RF biosynthetic genes compared to wild-type plants. Conversely, conditional overexpression of AtDREB2G led to an increase in the expression of RF biosynthetic genes and elevated flavin levels. In wild-type plants, exposure to low temperatures and abscisic acid treatment stimulated enhanced flavin levels and upregulated the expression of RF biosynthetic genes, concomitant with the induction of AtDREB2G. Notably, these responses were significantly attenuated in dreb2g mutants. Our findings establish AtDREB2G as a novel positive regulator of flavin biosynthesis in Arabidopsis, particularly under conditions of low temperature and abscisic acid treatment.","creator":"Namba, J., Harada, M., Toda, Y., Maruta, T., Ishikawa, T., Shigeoka, S., Yoshimura, K., Ogawa, T."},{"id":"2023.09.07.556260v1","slug":"a-soybean-rust-effector-protease-suppresses-host-immunity-and-cleaves-a-3-deoxy-7-phosphoheptulonate-synthase","title":"A soybean rust effector protease suppresses host immunity and cleaves a 3-deoxy-7-phosphoheptulonate synthase","link":"http://biorxiv.org/cgi/content/short/2023.09.07.556260v1?rss=1","abstract":"The devastating soybean rust (SBR) pathogen, Phakopsora pachyrhizi, encodes many secreted proteins, but only two have been functionally characterized for their roles in rust virulence. Here, we demonstrate that transient expression of P. pachyrhizi effector candidate 15 (PpEC15), an aspartic protease, leads to enhanced bacterial growth in planta, suppression of callose deposition, reduced expression of plant defense-related marker genes and suppression of pathogen-associated molecular pattern (PAMP)-induced reactive oxygen species (ROS). Stable expression of PpEC15 in soybean suppresses PAMP-induced ROS production and enhances bacterial growth, indicating that, collectively, PpEC15 suppresses host and non-host innate immune responses. Yeast-two-hybrid and proximity labeling identified putative PpEC15 interacting partners including a peptide-chain release factor (PCRF), a NAC83 (NAM, ATAF, and CUC) transcription factor, and a DAHP (3-deoxy-7-phosphoheptulonate) synthase. We further show that PpEC15 can cleave DAHP but does not cleave PCRF or NAC83. Virus-induced gene silencing of NAC83, PCRF and DAHP altered PAMP-induced ROS production and salicylic acid production, indicating that these proteins may be involved in immune signaling. Collectively, our data show that PpEC15 is conserved across P. pachyrhizi isolates and other economically important rust species and is involved in the suppression of plant basal defense responses. Understanding the role of PpEC15 in P. pachyrhizi virulence will provide a foundation for designing targeted intervention strategies to generate rust-resistant crops.","creator":"Chicowski, A. S., Qi, M., Variz, H., Bredow, M., Montes-Serey, C., Caiazza, F., Dong, H., Margets, A. C., Mejias, J., Walley, J., Craik, C., Pedley, K. F., Aung, K., Innes, R. W., Whitham, S."},{"id":"2023.09.06.555881v1","slug":"peanut-smut-a-scientometric-analysis-for-a-pathosystem-that-concerns-the-argentine-peanut-industry","title":"Peanut Smut: A scientometric analysis for a pathosystem that concerns the Argentine peanut industry.","link":"http://biorxiv.org/cgi/content/short/2023.09.06.555881v1?rss=1","abstract":"Since its first report in commercial batches in 1995, the prevalence and yield impact caused by smut disease have increased rapidly in peanut fields. At the same time, various working groups have studied this pathosystem using different approaches, contributing to the scientific knowledge of the disease. By recognizing the importance of a thorough bibliographic review and meticulous organization of information, the process of initiating new research projects becomes more effective. In light of this, the aim of this work was to provide a comprehensive scientometric analysis of the evolution of peanut smut research, spanning from its inception to the current day. For this purpose, we compiled bibliographic data about the disease and extracted information to calculate metrics. We observed that a smaller proportion of the scientific production was presented in peer-reviewed journals, the prevalent topics were epidemiology and breeding, and the collaborative endeavors were crucial for the scientific advancement in the study of this pathosystem. Additionally, the researchers with the most significant presence in the publications, the involved institutions, and the impact of the produced papers, among other trends were identified. Although there have been many scientific-technological advances in peanut smut over the years, this information is not reflected in scientific papers in peer-reviewed journals, which represents a great challenge for researchers involved in this topic. It is crucial to continue generating knowledge that contributes to the integrated management of this complex pathosystem. This will prevent further yield losses and the spread of the pathogen to new production areas.","creator":"Cazon, L. I., Paredes, J. A., Miretti, E., Gonzalez, N. R., Suarez, L., Conforto, E. C., Rago, A. M."},{"id":"2023.09.06.556496v1","slug":"growth-deficiency-and-enhanced-basal-immunity-in-arabidopsis-thaliana-mutants-of-edm2-edm3-and-ibm2-are-genetically-interlinked","title":"Growth deficiency and enhanced basal Immunity in Arabidopsis thaliana mutants of EDM2, EDM3 and IBM2 are genetically interlinked","link":"http://biorxiv.org/cgi/content/short/2023.09.06.556496v1?rss=1","abstract":"Mutants of the Arabidopsis thaliana genes, EDM2, EDM3 and IBM2 are known to show defects in a diverse set of defense and developmental processes. For example, they jointly exhibit enhanced levels of basal defense and stunted growth. Here we show that these two phenotypes are functionally connected by their dependency on the salicylic acid biosynthesis gene SID2 and the basal defense regulatory gene PAD4. Stunted growth of edm2, edm3 and ibm2 plants is a consequence of up-regulated basal defense. Constitutively enhanced activity of reactive oxygen species-generating peroxidases, we observed in these mutants, appears also to contribute to both, their enhanced basal defense and their growth retardation phenotypes. Furthermore, we found the histone H3 demethylase gene IBM1, a direct regulatory target of EDM2, EDM3 and IBM2, to be at least partially required for the basal defense and growth-related effects observed in these mutants. We recently reported that EDM2, EDM3 and IBM2 coordinate the extent of basal immunity with the timing of the floral transition. Together with these observations, data presented here show that at least some of the diverse phenotypic effects in edm2, edm3 and ibm2 mutants are genetically interlinked and functionally connected.","creator":"Wang, J., Eulgem, T."},{"id":"2023.09.05.556322v1","slug":"hormonal-and-transcriptomic-analysis-reveals-the-role-of-aba-and-br-in-breaking-the-barrier-of-inter-subgeneric-hybridization-in-water-lily-nymphaea","title":"Hormonal and transcriptomic analysis reveals the role of ABA and BR in breaking the barrier of inter-subgeneric hybridization in water lily (Nymphaea)","link":"http://biorxiv.org/cgi/content/short/2023.09.05.556322v1?rss=1","abstract":"Understanding the process of signal communication between pollen and stigma is of significant importance for plant sexual reproduction. In the case of inter-subgeneric hybridization in water lily, there exists a pre-fertilization hybridization barrier, the regulatory mechanism of which remains unclear. In this study, we conducted hormone and transcriptome analyses of unpollinated stigmas (Mock), self-pollinated stigmas (SP), cross-pollinated stigmas within the same subgenus (CP), and inter-subgenus cross-pollination stigmas (ISCP) in water lily to elucidate the formation mechanism of the inter-subgeneric hybridization barrier. Our results indicated that the lack of ABA and BR in ISCP stigmas are key factors contributing to the formation of the inter-subgeneric hybridization barrier in water lily. Exogenous application of ABA and BR can help overcome the barrier between inter-subgeneric water lily crosses. Through transcriptome analysis, we identified nine candidate genes involved in regulating the inter-subgeneric hybridization barrier in water lily. In addition, we further demonstrated the importance of the NCED2-mediated ABA synthesis pathway in the hybridization process through AS-ODN technology. Our study confirms that ABA and BR are critical for breaking the inter-subgeneric hybridization barrier in water lily. The identification of the nine candidate genes provides important clues for further research on the hybridization recognition mechanism in water lily.","creator":"Zhou, P., Li, J., Jiang, H., Yang, Z., Sun, C., Wang, H., Su, Q., Jin, Q., Wang, Y., Xu, Y."},{"id":"2023.09.05.556231v1","slug":"trials-and-tribulations-of-neotropical-plant-taxonomy-pace-of-tree-species-description","title":"Trials and tribulations of Neotropical plant taxonomy: pace of tree species description","link":"http://biorxiv.org/cgi/content/short/2023.09.05.556231v1?rss=1","abstract":"O_LIOne of the main aspects of taxonomic research is the description of new species. Identifying how to describe new species more efficiently is key to completing the inventory of the Neotropical flora in an era of massive biodiversity loss. C_LIO_LIHere we calculate the interval between first specimen collection and new species publication for a group of 2126 Neotropical trees, and discuss the historical context surrounding specimen collection and new species publication events. C_LIO_LIOur results reveal that on average, it takes almost 16 years from specimen collection to publication of a new Neotropical tree species, which is considerably shorter than previous estimates for other tropical groups. The central Andes is the region that had the longest average time lags, while the Choco had the shortest. Peru had the longest average time lags by country, while Haiti had the shortest. The average time lags increased until the early 1900s, when a decrease was observed, with the shortest lags between 1941 to 1960. C_LIO_LIWe found that the majority of the species described more rapidly are from plants collected and described by the same researcher. We demonstrate how political instability and conflict can delay or impede the completion of research initiatives in the region. We argue that enhancing international collaboration and training opportunities in Latin American countries, as well as ensuring safe plant collection campaigns, are critical to complete the inventory of the Neotropical flora. C_LI  Societal Impact StatementThis study aims to answer the question of how long it takes to describe a new species of tree in the Neotropics by calculating the time elapsed from collection of the first specimen to the publication of a new species. Given the current unprecedented concerns for global biodiversity loss, it is critical to identify best practices for describing new species more efficiently so we can complete the inventory of the Neotropical flora and implement appropriate conservation strategies in a timely manner.","creator":"Lujan, M., Lucas, E., Michelangeli, F., Prance, G., Rzedowski, J., Aguilar, D. S., Serpell, E., Sothers, C., Zuntini, A., Lemos, R. M."},{"id":"2023.09.06.556499v1","slug":"retrotransposon-driven-environmental-regulation-of-flc-leads-to-adaptive-response-to-herbicide","title":"Retrotransposon-driven environmental regulation of FLC leads to adaptive response to herbicide","link":"http://biorxiv.org/cgi/content/short/2023.09.06.556499v1?rss=1","abstract":"The mobilization of retrotransposons yields major-effect mutations. Here, we report an adaptive retrotransposon insertion within the first intron of the Arabidopsis floral-repressor locus FLOWERING LOCUS C (FLC). The insertion-mutation augments the environmental sensitivity of FLC by affecting the balance between coding and non-coding transcript isoforms in response to environmental threads. We show that this balance is modulated epigenetically by DNA methylation and orchestrated by IBM2, a factor involved in the processing of intronic heterochromatin. The stress-sensitive allele of FLC has recently spread across populations subjected to recurrent chemical weeding, and we demonstrate that retrotransposon-driven acceleration of life cycle represents a rapid response to herbicide. Our findings illustrate how retrotransposition can create environmentally-sensitive alleles that facilitate adaptation to anthropogenic disturbances of the environment.","creator":"Raingeval, M., Leduque, B., Baduel, P., Edera, A., Roux, F., Colot, V., Quadrana, L."},{"id":"2023.09.04.556251v1","slug":"identifying-the-fungal-diseases-of-african-yam-bean-sphenostylis-stenocarpa-harms-and-their-occurrence-in-south-west-nigeria","title":"Identifying the fungal diseases of African Yam Bean (\tSphenostylis stenocarpa   Harms) and their occurrence in South- West Nigeria","link":"http://biorxiv.org/cgi/content/short/2023.09.04.556251v1?rss=1","abstract":"Sphenostylis stenocarpa, commonly known as African yam bean (AYB), is an orphan crop with high nutritional properties but low yield production due to diseases. Hence, this study accessed the diversity and pathogenicity of fungi associated with AYB in Southwest (SW) Nigeria as a model area of cultivation. The incidence of fungi infecting AYB were surveyed in Oyo, Ondo, Ekiti, Osun, and Ogun states within SW Nigeria during 2018 planting season. The common field symptoms across all sites were tiny spot, brown spot, leaf blight, brown spot with yellow halo, necrotic lesion, and brown spot on pods. A total of 1005 fungi were isolated from leaf and pod samples, and identified morphologically on pure cultures as Aspergillus sp, Botrytis sp, Colletotrichum gloeosporioides, Curvularia lunata, Trichoderma harzianum, Macrophomina phaseolina, Pestalotia sp, Phoma sp, Fusarium verticillioides, F. oxysporum, F. solani, Botryodiplodia theobromae, and Choanephora curcubitarium and Nigrospora spp. Phoma sp and C. gleosporoides had highest frequency of occurrence 69.9% and 51.9% at early and mature stages, respectively. To conform to Kochs postulates, the pathogenicities of 12 exemplar strains of the most abundant fungal species were confirmed in controlled glasshouse tests. The identities of Colletotrichum sp., Aspergillus sp., Didymella sp., Pestalopsis sp, Lasiodiplodia theobromae, F. solani and F. oxysporum were confirmed based on internal transcribed spacer (ITS) sequencing and comparisons with the Genbank database. AYB germplasm from curated seed banks and farmer donated landraces were grown at the same site in 2020 and identical fungi were isolated. Further, genotypes with reduced disease incidences and incidences were identified. This first study to reveal the diversity of fungi associated with AYB in SW Nigeria that could inform disease management practices.","creator":"Oyedele, T., Kehinde, I., Atanda, H. Y., Oyelakin, A., Popoola, T., Mur, L."},{"id":"2023.09.04.555865v1","slug":"the-association-between-dioscorea-sansibarensis-and-orrella-dioscoreae-as-a-model-for-hereditary-leaf-symbiosis","title":"The association between Dioscorea sansibarensis and Orrella dioscoreae as a model for hereditary leaf symbiosis","link":"http://biorxiv.org/cgi/content/short/2023.09.04.555865v1?rss=1","abstract":"Hereditary, or vertically-transmitted, symbioses affect a large number of animal species and some plants. The precise mechanisms underlying transmission of functions of these associations are often difficult to describe, due to the difficulty in separating the symbiotic partners. This is especially the case for plant-bacteria hereditary symbioses, which lack experimentally tractable model systems. Here, we demonstrate the potential of the leaf symbiosis between the wild yam Dioscorea sansibarensis and the bacterium Orrella dioscoreae (O. dioscoreae) as a model system for hereditary symbiosis. O. dioscoreae is easy to grow and genetically manipulate, which is unusual for hereditary symbionts. These properties allowed us to design an effective antimicrobial treatment to rid plants of bacteria and generate whole aposymbiotic plants, which can later be re-inoculated with bacterial cultures. Aposymbiotic plants did not differ morphologically from symbiotic plants and the leaf forerunner tip containing the symbiotic glands formed normally even in the absence of bacteria, but microscopic differences between symbiotic and aposymbiotic glands highlight the influence of bacteria on the development of trichomes and secretion of mucilage. This is to our knowledge the first leaf symbiosis where both host and symbiont can be grown separately and where the symbiont can be genetically altered and reintroduced to the host.","creator":"Acar, T., Moreau, S., Jardinaud, M.-F., Houdinet, G., Maviane-Macia, F., De Meyer, F., Hoste, B., Leroux, O., Coen, O., Le Ru, A., Peeters, N., Carlier, A."},{"id":"2023.09.01.555968v1","slug":"a-congestion-downstream-of-psi-causes-the-over-reduction-of-the-electron-transport-chain-in-pgr5-independent-of-membrane-energization","title":"A congestion downstream of PSI causes the over-reduction of the electron transport chain in pgr5 independent of membrane energization","link":"http://biorxiv.org/cgi/content/short/2023.09.01.555968v1?rss=1","abstract":"The thylakoid protein Proton Gradient Regulation5 (PGR5) is thought to be a key component of cyclic electron flux around photosystem I. The pgr5 mutant is characterized by impaired proton motive force (pmf) formation across the thylakoid membrane, decreased photoprotective non-photochemical quenching (NPQ), and an over-reduction of the PSI acceptor side. This over-reduction has been attributed to impaired photosynthetic control, which down-regulates plastoquinol re-oxidation at the cytochrome b6f complex when the lumen is strongly acidified. Here, using the cgl160 ATP synthase assembly mutant, we show that in cgl160 pgr5 double mutants, both the pmf across the thylakoid membrane and NPQ are fully restored to wild-type levels. However, the acceptor-side limitation of PSI in the double mutants stays comparable to the single pgr5 mutant. This demonstrates that impaired photosynthetic control is not causal for the over-reduction of the PSI acceptor side in pgr5. Instead, we show that both in pgr5 and the clg160 pgr5 mutants, the entire high-potential chain from cytochrome f to PSI remains strongly reduced in high light. This leads to insufficient oxidizing power for plastoquinol re-oxidation by the cytochrome b6f complex, thus impairing pmf formation. We conclude that PGR5 plays a critical role in electron partitioning downstream of PSI.","creator":"Kappel, S., Thiele, W., Gefen-Treves, S., Henze, A., Armbruster, U., Schottler, M. A."},{"id":"2023.09.06.556483v1","slug":"methylosome-and-smn-complexes-are-dispensable-for-snrnp-assembly-in-arabidopsis","title":"Methylosome and SMN complexes are dispensable for snRNP assembly in Arabidopsis","link":"http://biorxiv.org/cgi/content/short/2023.09.06.556483v1?rss=1","abstract":"The role of RNA splicing as modulator of the molecular responses to stress is well described. In contrast, its importance in the acclimation of plants to changes in ambient temperatures started to emerge only recently. Here, we analyzed the role of temperature in spliceosome assembly, a key step often neglected in studies focusing on splicing. Taking advantage of mutants showing temperature-dependent phenotypes we conducted a comprehensive study of the role that the methylosome and SMN complexes have in plant snRNP assembly. Genetic analyses, as well as in vivo and in vitro evidence suggest a mechanism for snRNP assembly in plants that differs remarkably from vertebrate animals. The SMN complex in plants is apparently reduced to a single protein, GEMIN2, that is not essential for plant development. Similarly, the methylosome has a less crucial role in spliceosome assembly than previously thought. Our results highlight how an evolutionary conserved molecular process like RNA splicing has nevertheless evolved plant specific characteristics.","creator":"Goretti, D., Collani, S., Nardeli, S., Schmid, M."}]},{"name":"Economics","feed":[{"id":"2309.07160","slug":"the-effect-of-housewife-labor-on-gdp-calculations-arxiv-2309-07160v1-econ-gn","title":"The effect of housewife labor on gdp calculations.","link":"http://arxiv.org/abs/2309.07160","abstract":"In this study, the evolutionary development of labor has been tried to be revealed based on theoretical analysis. Using the example of gdp, which is an indicator of social welfare, the economic value of the labor of housewives was tried to be measured with an empirical modeling. To this end; first of all, the concept of labor was questioned in orthodox (mainstream) economic theories; then, by abstracting from the labor-employment relationship, it was examined what effect the labor of unpaid housewives who are unemployed in the capitalist system could have on gdp. In theoretical analysis; It has been determined that the changing human profile moves away from rationality and creates limited rationality and, accordingly, a heterogeneous individual profile. Women were defined as the new example of heterogeneous individuals, as those who best fit the definition of limited rational individuals because they prefer to be housewives. In the empirical analysis of the study, housewife labor was taken into account as the main variable. In the empirical analysis of the study; In the case of Turkiye, using turkstat employment data and the atkinson inequality scale; the impact of housewife labor on gdp was calculated. The results of the theoretical and empirical analysis were evaluated in the context of labor-employment independence.","creator":"Saadet Yagmur Kumcu"},{"id":"2309.07363","slug":"linking-mechanisms-limits-and-robustness-arxiv-2309-07363v1-econ-th","title":"Linking Mechanisms: Limits and Robustness.","link":"http://arxiv.org/abs/2309.07363","abstract":"Quota mechanisms are commonly used to elicit private information when agents face multiple decisions and monetary transfers are infeasible. As the number of decisions grows large, quotas asymptotically implement the same set of social choice functions as do separate mechanisms with transfers. We analyze the robustness of quota mechanisms. To set the correct quota, the designer must have precise knowledge of the environment. We show that, without transfers, only trivial social choice rules can be implemented in a prior-independent way. We obtain a tight bound on the decision error that results when the quota does not match the true type distribution. Finally, we show that in a multi-agent setting, quotas are robust to agents' beliefs about each other. Crucially, quotas make the distribution of reports common knowledge.","creator":"Ian Ball, Deniz Kattwinkel"},{"id":"2309.07371","slug":"the-fiscal-cost-of-public-debt-and-government-spending-shocks-arxiv-2309-07371v1-econ-gn","title":"The Fiscal Cost of Public Debt and Government Spending Shocks.","link":"http://arxiv.org/abs/2309.07371","abstract":"This paper investigates how the cost of public debt shapes fiscal policy and its effect on the economy. Using U.S. historical data, I show that when servicing the debt creates a fiscal burden, the government responds to spending shocks by limiting debt issuance. As a result, the initial shock triggers only a limited increase in public spending in the short run, and even leads to spending reversal in the long run. Under these conditions, fiscal policy loses its ability to stimulate economic activity. This outcome arises as the fiscal authority limits its own ability to borrow to ensure public debt sustainability. These findings are robust to several identification and estimation strategies.","creator":"Venance Riblier"},{"id":"2309.07427","slug":"measuring-higher-order-rationality-with-belief-control-arxiv-2309-07427v1-econ-gn","title":"Measuring Higher-Order Rationality with Belief Control.","link":"http://arxiv.org/abs/2309.07427","abstract":"Determining an individual's strategic reasoning capability based solely on choice data is a complex task. This complexity arises because sophisticated players might have non-equilibrium beliefs about others, leading to non-equilibrium actions. In our study, we pair human participants with computer players known to be fully rational. This use of robot players allows us to disentangle limited reasoning capacity from belief formation and social biases. Our results show that, when paired with robots, subjects consistently demonstrate higher levels of rationality and maintain stable rationality levels across different games compared to when paired with humans. This suggests that strategic reasoning might indeed be a consistent trait in individuals. Furthermore, the identified rationality limits could serve as a measure for evaluating an individual's strategic capacity when their beliefs about others are adequately controlled.","creator":"Wei James Chen, Meng-Jhang Fong, Po-Hsuan Lin"},{"id":"2309.07476","slug":"causal-inference-in-network-experiments-regression-based-analysis-and-design-based-properties-arxiv-2309-07476v1-econ-em","title":"Causal inference in network experiments: regression-based analysis and design-based properties.","link":"http://arxiv.org/abs/2309.07476","abstract":"Network experiments have been widely used in investigating interference among units. Under the ``approximate neighborhood interference\" framework introduced by \\cite{Leung2022}, treatments assigned to individuals farther from the focal individual result in a diminished effect on the focal individual's response, while the effect remains potentially nonzero. \\cite{Leung2022} establishes the consistency and asymptotic normality of the inverse-probability weighting estimator for estimating causal effects in the presence of interference. We extend these asymptotic results to the Hajek estimator which is numerically identical to the coefficient from the weighted-least-squares fit based on the inverse probability of the exposure mapping. The numerically equivalent regression-based approach offers two notable advantages: it can provide standard error estimators through the same weighted-least-squares fit, and it allows for the integration of covariates into the analysis. Furthermore, we introduce the regerssion-based network-robust variance estimator, adopting the form of the Heteroskedasticity and Autocorrelation Consistent estimator, and analyze its asymptotic bias. Recognizing that the variance estimator can be anti-conservative, we propose an adjusted variance estimator to improve empirical coverage. Although we focus on regression-based point and variance estimators, our theory holds under the design-based framework, which assumes that the randomness comes solely from the design of network experiments and allows for arbitrary misspecification of the regression models.","creator":"Mengsi Gao, Peng Ding"},{"id":"2309.07664","slug":"computer-says-no-exploring-systemic-hiring-bias-in-chatgpt-using-an-audit-approach-arxiv-2309-07664v1-econ-gn","title":"Computer says 'no': Exploring systemic hiring bias in ChatGPT using an audit approach.","link":"http://arxiv.org/abs/2309.07664","abstract":"Large language models offer significant potential for optimising professional activities, such as streamlining personnel selection procedures. However, concerns exist about these models perpetuating systemic biases embedded into their pre-training data. This study explores whether ChatGPT, a chatbot producing human-like responses to language tasks, displays ethnic or gender bias in job applicant screening. Using a correspondence audit approach, I simulated a CV screening task in which I instructed the chatbot to rate fictitious applicant profiles only differing in names, signalling ethnic and gender identity. Comparing ratings of Arab, Asian, Black American, Central African, Dutch, Eastern European, Hispanic, Turkish, and White American male and female applicants, I show that ethnic and gender identity influence ChatGPT's evaluations. The ethnic bias appears to arise partly from the prompts' language and partly from ethnic identity cues in applicants' names. Although ChatGPT produces no overall gender bias, I find some evidence for a gender-ethnicity interaction effect. These findings underscore the importance of addressing systemic bias in language model-driven applications to ensure equitable treatment across demographic groups. Practitioners aspiring to adopt these tools should practice caution, given the adverse impact they can produce, especially when using them for selection decisions involving humans.","creator":"Louis Lippens"},{"id":"2207.08789","slug":"estimating-continuous-treatment-effects-in-panel-data-using-machine-learning-with-a-climate-application-arxiv-2207-08789v2-econ-em-updated","title":"Estimating Continuous Treatment Effects in Panel Data using Machine Learning with a Climate Application.","link":"http://arxiv.org/abs/2207.08789","abstract":"This paper introduces and proves asymptotic normality for a new semi-parametric estimator of continuous treatment effects in panel data. Specifically, we estimate the average derivative. Our estimator uses the panel structure of data to account for unobservable time-invariant heterogeneity and machine learning (ML) methods to preserve statistical power while modeling high-dimensional relationships. We construct our estimator using tools from double de-biased machine learning (DML) literature. Monte Carlo simulations in a nonlinear panel setting show that our method estimates the average derivative with low bias and variance relative to other approaches. Lastly, we use our estimator to measure the impact of extreme heat on United States (U.S.) corn production, after flexibly controlling for precipitation and other weather features. Our approach yields extreme heat effect estimates that are 50% larger than estimates using linear regression. This difference in estimates corresponds to an additional $3.17 billion in annual damages by 2050 under median climate scenarios. We also estimate a dose-response curve, which shows that damages from extreme heat decline somewhat in counties with more extreme heat exposure.","creator":"Sylvia Klosin, Max Vilgalys"},{"id":"2209.10137","slug":"rank-preserving-multidimensional-mechanisms-arxiv-2209-10137v3-econ-th-updated","title":"Rank-Preserving Multidimensional Mechanisms.","link":"http://arxiv.org/abs/2209.10137","abstract":"We show that the mechanism-design problem for a monopolist selling multiple, heterogeneous objects to a buyer with ex ante symmetric and additive values is equivalent to the mechanism-design problem for a monopolist selling identical objects to a buyer with decreasing marginal values. Symmetric and incentive-compatible mechanisms for heterogeneous objects are rank preserving, i.e., higher-valued objects are assigned with a higher probability. In the identical-objects model, every mechanism is rank preserving. This facilitates the equivalence, which we use in three applications.","creator":"Sushil Bikhchandani, Debasis Mishra"}]}]