[{"name":"Artificial Intelligence","feed":[]},{"name":"Plant Biology","feed":[{"id":"2024.03.19.584964v1","slug":"both-major-xanthophyll-cycles-present-in-nature-can-provide-non-photochemical-quenching-in-the-model-diatom-phaeodactylum-tricornutum","title":"Both major xanthophyll cycles present in nature can provide Non-Photochemical Quenching in the model diatom Phaeodactylum tricornutum","link":"http://biorxiv.org/cgi/content/short/2024.03.19.584964v1?rss=1","abstract":"Photosynthetic organisms require light but also rely on photoprotection to preempt photodamage induced by excess light. The xanthophyll cycle, a light-dependent carotenoid interconversion, plays a key role in the on- and offset of Non-Photochemical Quenching (NPQ), a form of excess energy dissipation through heat. While in most photosynthetic eukaryotes, including brown algae, green algae and plants, the violaxanthin cycle is prevalent, haptophytes and diatoms rely on the diadinoxanthin cycle to regulate NPQ. Diatoms also contain small amounts of violaxanthin cycle pigments, thought to serve only as precursors in xanthophylls biosynthesis. Both cycles are catalyzed by the enzymes violaxanthin de-epoxidase (VDE) and zeaxanthin epoxidase (ZEP). Here, we characterized the role of VDE and different ZEP encoding paralogs (ZEP2 and ZEP3) in the model diatom Phaeodactylum tricornutum. We generated the respective knockout lines and treated exponentially growing mutants and wild type with periodic high light stress. We conclude that VDE and ZEP3 are the main regulators of the diadinoxanthin cycle. Under the same conditions, ZEP2 knockouts accumulated mainly pigments of the violaxanthin cycle instead of the diadinoxanthin cycle. Intriguingly, violaxanthin cycle pigments contributed to the generation of NPQ with the same quenching efficiency of diadinoxanthin cycle pigments, demonstrating that both major xanthophyll cycles present in nature can provide NPQ in the same organism, with similar properties. Consequently, the prevalence of the diadinoxanthin cycle in diatoms has not been driven by its higher quenching efficiency but likely resulted from the selective advantage of a faster switch between photoprotection and light harvesting.","creator":"Giossi, C. E., Wünsch, M. A., Dautermann, O., Schober, A. F., Buck, J. M., Kroth, P. G., Lohr, M., Lepetit, B."},{"id":"2024.03.19.585643v1","slug":"epigenetic-and-transcriptional-consequences-of-chemically-induced-transposon-mobilization-in-the-endosperm","title":"Epigenetic and transcriptional consequences of chemically induced transposon mobilization in the endosperm","link":"http://biorxiv.org/cgi/content/short/2024.03.19.585643v1?rss=1","abstract":"Genomic imprinting, an epigenetic phenomenon leading to parent-of-origin-specific gene expression, has independently evolved in the endosperm of flowering plants and the placenta of mammals--tissues crucial for nurturing embryos. While transposable elements (TEs) frequently colocalize with imprinted genes and are implicated in imprinting establishment, direct investigations of the impact of de novo TE transposition on genomic imprinting remain scarce. In this study, we explored the effects of chemically induced transposition of the Copia element ONSEN on genomic imprinting in Arabidopsis thaliana. Through the combination of chemical TE mobilization and doubled haploid induction, we generated a line with 40 new ONSEN copies. Our findings reveal a preferential targeting of maternally expressed genes (MEGs) for transposition, aligning with the colocalization of H2A.Z and H3K27me3 in MEGs-- both previously identified as promoters of ONSEN insertions. Additionally, we demonstrate that chemically-induced DNA hypomethylation induces global transcriptional deregulation in the endosperm, leading to the breakdown of MEG imprinting. This study provides insights into the consequences of chemically induced TE remobilization in the endosperm, underscoring the need for cautious interpretation of the connection between TEs and genomic imprinting.","creator":"del Toro-de Leon, G., van Boven, J., Santos-Gonzalez, J., Jiao, W.-B., Schneeberger, K., Köhler, C."},{"id":"2024.03.19.585220v1","slug":"exploring-the-role-of-cultivar-year-and-plot-age-in-the-incidence-of-grapevine-trunk-diseases-insights-from-20-years-of-regional-surveys-in-france","title":"Exploring the role of cultivar, year and plot age in the incidence of grapevine trunk diseases: insights from 20 years of regional surveys in France","link":"http://biorxiv.org/cgi/content/short/2024.03.19.585220v1?rss=1","abstract":"Grapevine trunk diseases cause yield losses and vine mortality in vineyards worldwide. However, there have been few quantitative studies evaluating grapevine dieback on a large spatial and temporal scale. Here, we consolidated and standardised databases from the 13 main wine regions of France, compiling records of foliar symptoms associated with esca and Eutypa dieback from 2082 plots and 36 cultivars over a 20-year period. This large dataset was used (1) for quantitative analysis of the prevalence (number of plots with at least one symptomatic plant) and incidence (percentage of symptomatic plants) of esca and Eutypa dieback; (2) to decipher the effects of cultivar, year and plot age on both the prevalence and incidence of esca leaf symptoms by temporal Bayesian modelling. Esca was present on a mean of 74 {+/-} 2% plots annually, with an incidence of 3.1 {+/-} 0.1%. Eutypa dieback occurred in 41 {+/-} 3% of the plots, with an incidence of 1.4 {+/-} 0.1%. Our modelling approach revealed that the cultivar had a significant impact on the prevalence of esca, but not on its incidence when prevalence is greater than zero. Esca prevalence remained stable, whereas esca incidence was higher than the mean value in six of the years after 2012. We also found a significant non-linear effect of plot age, 10-to 30-year-old plots significantly more susceptible, depending on the cultivar. This study clearly illustrates the importance of considering extensive and continuous monitoring to improve our understanding of the impact and evolution of crop diseases.","creator":"Etienne, L., Fabre, F., Martinetti, D., Frank, E., Michel, L., Bonnardot, V., Guerin Dubrana, L., Delmas, C. E. L."},{"id":"2024.03.18.585502v1","slug":"identifying-leaf-anatomy-and-metabolic-regulators-that-underpin-c4-photosynthesis-in-alloteropsis-semialata","title":"Identifying leaf anatomy and metabolic regulators that underpin C4 photosynthesis in \tAlloteropsis semialata","link":"http://biorxiv.org/cgi/content/short/2024.03.18.585502v1?rss=1","abstract":"O_LIC4 photosynthesis is a complex trait requiring multiple developmental and metabolic alterations. Despite this complexity, it has independently evolved over 60 times. However, our understanding of the transition to C4 is complicated by the fact that variation in photosynthetic type is usually segregated between species. C_LIO_LIHere, we perform a genome wide association study (GWAS) using the grass Alloteropsis semialata, the only known species to have C3, intermediate, and C4 accessions. We aimed to identify genomic regions associated with the strength of the C4 cycle (measured using {delta}13C), and the development of C4 leaf anatomy. C_LIO_LIGenomic regions correlated with {delta}13C include regulators of C4 decarboxylation enzymes (RIPK), non-photochemical quenching (SOQ1), and the development of Kranz anatomy (SCARECROW-LIKE). Regions associated with the development of C4 leaf anatomy in the intermediate accessions contain additional leaf anatomy regulators, including those responsible for vein patterning (GSL8) and meristem determinacy (GRF1). C_LIO_LIThe detection of highly correlated genomic regions with a modest sample size indicates that the emergence of C4 photosynthesis in A. semialata required a few loci of large effect. The candidate genes could prove to be relevant for engineering C4 leaf anatomy in C3 species. C_LI","creator":"Alenazi, A. S., Pereira, L., Christin, P.-A., Osborne, C. P., Dunning, L. T."},{"id":"2024.03.18.585622v1","slug":"molecular-phylogeny-and-cryptic-morphology-a-combined-approach-to-taxonomic-novelties-in-polycarpaea-caryophyllaceae-from-vietnam","title":"Molecular Phylogeny and Cryptic Morphology: A Combined Approach to Taxonomic Novelties in Polycarpaea (Caryophyllaceae) from Vietnam","link":"http://biorxiv.org/cgi/content/short/2024.03.18.585622v1?rss=1","abstract":"Three new species of Polycarpaea from Vietnam, P. vanana, P. chungana, P. duongana are described and illustrated based on evidence of molecular sequence data from two markers (ITS1-5.8S-ITS2 and rps16) and combined morphological characteristics. Polycarpaea vanana is closely related to Polycarpaea gaudichaudi, P. arenaria, P. duongana but differs by its stem glabrous, leaf ovate to elliptic, glabrous, ovary oblong ovoid, base obtuse, apex attenuate, capsule oblong void, 3.8 mm long. P. duongana differs from the three species mentioned above by its stem being densely villous, leaf spathulate, ciliate, ovary ovoid, base acute, apex obtuse, capsule ovoid, 1.2 mm long. Polycarpaea chungana is most similar to P. lignosa but differs in having leaf oblong or linear, sparse ciliate, sepal and petal apex deeply concaved or slightly bifid, ovary ovoid, ovoid, 0.8-1.0 mm long. Furthermore, the achievements of analysis using molecular data on the systematic positions of 7 other species are results that have not been in previous molecular analyses.","creator":"Tran, T. V., Hoang, T. T., Le, L. B., Le, N. T. K., Nguyen, M. T. A., Truong, A. T. L., Tran, N. T., Tran, V. T., Le, S. V., Duong, K. T., Hoang, K. V. B., Le, T. N., Nguyen, B. V."},{"id":"2024.03.18.585636v1","slug":"manipulating-plant-development-by-editing-histone-methylation-with-the-dcas9-tool-the-cuc3-boundary-gene-as-a-case-study","title":"Manipulating plant development by editing histone methylation with the dCas9 tool: the CUC3 boundary gene as a case study","link":"http://biorxiv.org/cgi/content/short/2024.03.18.585636v1?rss=1","abstract":"Chromatin modifications are deemed to associate with gene expression patterns, yet their causal function on transcription and cell fate remains unestablished. Here, we demonstrate the direct impact of an epigenome editing tool designed to remove a key chromatin modification at a precise locus in living plants, with outcomes from the molecular to the developmental scale.  The manipulated mark, H3K27me3, deposited at Lysine 27 of Histone 3 by the methyltransferase Polycomb PRC2 complex, is associated with the repression of developmental genes. As a new approach to investigate this histone mark genuine function, we used a dCas9-derived tool to bring a specific demethylase function at the CUP SHAPED COTYLEDON 3 (CUC3) organ frontier gene, aiming to remove the trimethyl mark at H3K27. We show that the removal of H3K27me3 at the locus causally induces activation of CUC3 expression within its regular territory, as well as ectopically. Our precise perturbation strategy reveals that alterations in a chromatin mark lead to changes in transcription and developmental gene expression patterning, with sharp consequences on plant morphogenesis and growth.  Our work thus constitutes a proof of concept for the effective use of epigenome editing tools in unveiling the causal role of mark dynamics, supported by both molecular and developmental evidences.","creator":"Fal, K., Le Masson, M., Berr, A., CARLES, C. C."},{"id":"2024.03.18.585645v1","slug":"seaweed-amino-acid-and-l-amino-acid-improve-coriander-growth","title":"Seaweed Amino Acid and L-Amino Acid Improve Coriander Growth","link":"http://biorxiv.org/cgi/content/short/2024.03.18.585645v1?rss=1","abstract":"This study investigates the impact of Seaweed amino acid (SG) and L-amino acid (LG) treatments on the growth and root development of coriander plants compared to a control group (CG). The results from Figure 1 illustrate a significant increase in biomass and foliage density for the SG and LG groups, suggesting an enhanced nutritional uptake resulting from these amino acid treatments. Both SG and LG treatments produced more vigorous growth and higher plant height compared to the CG, which received only water. Additionally, a closer inspection of coriander root systems in Figure 2 reveals an improvement in root biomass and architecture, indicating that both SG and LG applications contribute positively to root development, potentially enhancing plant resilience and yield. While both treatments showed comparable effects on root morphology, further research is required to determine if one has superior long-term benefits over the other. The findings point towards the efficacy of using amino acid treatments as bio-stimulants in agricultural practices to improve crop yield, especially in challenging growth conditions such as those found in Guangzhou, China.  O_FIG O_LINKSMALLFIG WIDTH=185 HEIGHT=200 SRC=\"FIGDIR/small/585645v1_fig1.gif\" ALT=\"Figure 1\"> View larger version (144K): org.highwire.dtl.DTLVardef@18fe61eorg.highwire.dtl.DTLVardef@4cbf72org.highwire.dtl.DTLVardef@ad1311org.highwire.dtl.DTLVardef@befdf5_HPS_FORMAT_FIGEXP  M_FIG O_FLOATNOFigure 1:C_FLOATNO Comparative Analysis of Coriander Growth Response to Root Applications of Seaweed Amino Acid (SG) and L-amino Acid (LG). Top Left (SG): Coriander plants treated with seaweed amino acid at 100 ppm, showing dense foliage. Top Right (LG): Coriander plants treated with L-amino acid at 100 ppm, exhibiting similar vegetative growth. Bottom Left (CG): Control coriander plants irrigated only with water, with noticeably less growth. Bottom Right: Comparative height analysis of harvested coriander plants, demonstrating the impact of SG and LG treatments versus the control group.  C_FIG O_FIG O_LINKSMALLFIG WIDTH=120 HEIGHT=200 SRC=\"FIGDIR/small/585645v1_fig2.gif\" ALT=\"Figure 2\"> View larger version (92K): org.highwire.dtl.DTLVardef@1130f64org.highwire.dtl.DTLVardef@57af69org.highwire.dtl.DTLVardef@bd3572org.highwire.dtl.DTLVardef@1ffe028_HPS_FORMAT_FIGEXP  M_FIG O_FLOATNOFigure 2.C_FLOATNO Differential Impact of Seaweed Amino Acid (SG) and L-amino Acid (LG) Treatments on Coriander Root Morphology. The image presents a comparative view of coriander root systems after treatment with Seaweed amino acids (SG) and L-amino acids (LG) against a control group (CG). The control group roots (top row) display a baseline development, having been irrigated solely with water. The SG group roots (middle row) exhibit enhanced development, indicative of the positive influence of Seaweed amino acid treatment. In contrast, the LG group roots (bottom row) show a comparable advancement in root structure to the SG group, suggesting both amino acid treatments contribute to improved root architecture and possibly, plant resilience at harvest.  C_FIG","creator":"Chen, X., Shang, Z., Chen, H., Wan, S."},{"id":"2024.03.18.585510v1","slug":"strong-heterologous-electron-sink-outcompetes-alternative-electron-transport-pathways-in-photosynthesis","title":"Strong heterologous electron sink outcompetes alternative electron transport pathways in photosynthesis","link":"http://biorxiv.org/cgi/content/short/2024.03.18.585510v1?rss=1","abstract":"Improvement of photosynthesis requires a thorough understanding of electron partitioning under both natural and strong electron sink conditions. We applied a wide array of state-of-the-art biophysical and biochemical techniques to thoroughly investigate the fate of photosynthetic electrons in the engineered cyanobacterium Synechocystis sp. PCC 6803, a blueprint for photosynthetic biotechnology, expressing the heterologous gene for ene-reductase, YqjM. This recombinant enzyme catalyses the reduction of an exogenously added substrate into the desired product by utilising photosynthetically produced NAD(P)H, enabling whole-cell biotransformation. Through coupling the biotransformation reaction with biophysical measurements, we demonstrated that the strong artificial electron sink, outcompetes the natural electron valves, the flavodiiron protein-driven Mehler-like reaction, and cyclic electron transport. These results show that ferredoxin-NAD(P)H-oxidoreductase (FNR) is the preferred route for delivering photosynthetic electrons from reduced ferredoxin and the cellular NADPH/NADP+ ratio as a key factor in orchestrating photosynthetic electron flux. These insights are crucial for understanding molecular mechanisms of photosynthetic electron transport and harnessing photosynthesis for sustainable bioproduction by engineering the cellular source/sink balance. Furthermore, we conclude that identifying the bioenergetic bottleneck of a heterologous electron sink is a crucial prerequisite for targeted engineering of photosynthetic biotransformation platforms.  Significance statementWe coupled the photosynthetic and biocatalytic (whole-cell biotransformation) performance of model cyanobacteria. We employed a heterologous NAD(P)H utilising enzyme, as a strong artificial electron sink, allowing us to gain a comprehensive understanding of photosynthetic electron partitioning. We demonstrated that the strong electron sink outcompetes natural electron sinks and cyclic electron transport.","creator":"Hubacek, M., Wey, L. T., Kourist, R., Malihan-Yap, L., Nikkanen, L., Allahverdiyeva, Y."},{"id":"2024.03.18.585484v1","slug":"investigating-the-interactions-of-the-cucumber-mosaic-virus-2b-protein-with-the-viral-1a-replicase-component-and-the-cellular-rna-silencing-factor-argonaute-1","title":"Investigating the interactions of the cucumber mosaic virus 2b protein with the viral 1a replicase component and the cellular RNA silencing factor Argonaute 1","link":"http://biorxiv.org/cgi/content/short/2024.03.18.585484v1?rss=1","abstract":"The cucumber mosaic virus (CMV) 2b protein is a suppressor of plant defenses and a pathogenicity determinant. Amongst the 2b proteins host targets is the RNA silencing factor Argonaute 1 (AGO1), which it binds to and inhibits. In Arabidopsis thaliana, if 2b-induced inhibition of AGO1 is too efficient it induces reinforcement of antiviral silencing by AGO2, and triggers increased resistance against aphids, CMVs insect vectors. These effects would be deleterious to CMV replication and transmission, respectively, but are moderated by the CMV 1a protein by sequestering sufficient 2b protein molecules into P-bodies to prevent excessive inhibition of AGO1. Mutant 2b protein variants were generated and red and green fluorescent protein fusions used to investigate subcellular colocalization with AGO1 and the 1a protein, and the effects of mutations on complex formation with the 1a protein and AGO1 were investigated using bimolecular fluorescence complementation and co-immunoprecipitation assays. Although we found that residues 56-60 influenced the 2b proteins interactions with the 1a protein and AGO1, it appears unlikely that any single residue or sequence domain is solely responsible. In silico predictions of intrinsic disorder within the 2b protein secondary structure were supported by circular dichroism (CD) but not by nuclear magnetic resonance (NMR) spectroscopy. Intrinsic disorder provides a plausible model to explain the 2b proteins ability to interact with AGO1, the 1a protein and other factors. However, the reasons for the conflicting conclusions provided by CD and NMR must first be resolved.","creator":"Crawshaw, S., Murphy, A. M., Rowling, P. J. E., Nietlispach, D., Itzhaki, L. S., Carr, J. P."},{"id":"2024.03.18.585633v1","slug":"grapevine-shiraz-disease-associated-viruses-lead-to-significant-yield-losses-by-altering-transcription-of-genes-related-to-defence-responses-and-photosynthesis","title":"Grapevine Shiraz Disease-associated viruses lead to significant yield losses by altering transcription of genes related to defence responses and photosynthesis","link":"http://biorxiv.org/cgi/content/short/2024.03.18.585633v1?rss=1","abstract":"Grapevine Shiraz disease (SD), which is associated with Grapevine Virus A (GVA), is one of the highly destructive diseases affecting Australian and South African vineyards. However, virtually nothing is known about the transcriptional modifications in grapevine phloem tissues induced by SD as well as its impact on vine physiology, yield and fruit composition. In this study, we assessed the physiological parameters of SD-infected Vitis vinifera L. cv. Shiraz vines grown in a commercial vineyard in South Australia over two growing seasons. Viruses present in symptomatic SD-affected and asymptomatic vines were investigated using serological (ELISA) and molecular tests (PCR and Illumina next generation sequencing). SD did not alter plant water status over the growing season, however significantly decreased canopy size, leaf gas exchange, chlorophyll fluorescence, and yield. Differential gene expression analysis revealed significantly higher expression of genes associated with systemic acquired resistance (SAR) and downregulation of defence- and photosynthesis-related genes in phloem tissues of SD vines. This is the first comprehensive report of the physiological and transcriptomic responses of grapevine to SD.","creator":"Nagahatenna, D., Onetto, C. A., Wang, Y. M., Borneman, A. R., Pagay, V. V."},{"id":"2024.03.18.585579v1","slug":"nonexpressor-of-pathogenesis-related-genes-control-huanglongbing-tolerance-by-regulating-immune-balance-in-citrus-plants","title":"NONEXPRESSOR OF PATHOGENESIS-RELATED GENES control Huanglongbing tolerance by regulating immune balance in citrus plants","link":"http://biorxiv.org/cgi/content/short/2024.03.18.585579v1?rss=1","abstract":"Huanglongbing (HLB) is a devastating citrus disease caused by the phloem-resident bacterial pathogen Candidatus liberibacter asiaticus (CLas). CLas infection of susceptible varieties triggers unbalanced immune responses, leading to overaccumulation of callose and reactive oxygen species (ROS), which in turn causes phloem plugging and HLB symptom development. Interestingly, some citrus relatives exhibit little or no symptoms in the presence of CLas, a phenomenon termed HLB tolerance. Moreover, overexpression of the Arabidopsis thaliana NPR1 (AtNPR1) gene in susceptible varieties has been shown to confer robust HLB tolerance. However, the mechanisms underlying HLB tolerance remain enigmatic. Here, we show that overexpression of AtNPR1 suppresses CLas- and Pseudomonas syringae pv. maculicola ES4326 (Psm)-induced overaccumulation of callose and ROS in citrus and Arabidopsis, respectively. Importantly, we found that knocking out of the Arabidopsis negative immune regulators, AtNPR3 and AtNPR4, and silencing of their Citrus sinensis ortholog CsNPR3, similarly suppress Psm- and CLas-induced callose and ROS overaccumulation, respectively, and that silencing of CsNPR3 also enhances HLB tolerance. These results reveal a conserved role of the NPR1/NPR3/NPR4-mediated signaling pathway in regulating plant immune balances and provide mechanistic support for overexpression of AtNPR1 or silencing of AtNPR3/AtNPR4 orthologs in citrus as a long-term solution to the HLB disease.","creator":"Sarkar, P., El-Mohtar, C., Turner, D., Welker, S., Robertson, C. J., Orbovic, V., Mou, Z., Levy, A."},{"id":"2024.03.14.585081v1","slug":"chloroplastic-ascorbate-acts-as-a-regulatory-hub-in-plant-metabolism-regardless-of-oxidative-stress","title":"Chloroplastic ascorbate acts as a regulatory hub in plant metabolism regardless of oxidative stress","link":"http://biorxiv.org/cgi/content/short/2024.03.14.585081v1?rss=1","abstract":"Ascorbate is a major plant metabolite that plays crucial roles in various processes, from reactive oxygen scavenging to epigenetic regulation. However, to what extent and how ascorbate modulates metabolism is largely unknown. To address this, we investigated the consequences of chloroplastic and total cellular ascorbate-deficiencies by studying chloroplastic ascorbate-transporter pht4;4 mutant lines, and the ascorbate-deficient vtc2-4 mutant of Arabidopsis thaliana. Under regular growth conditions, both ascorbate-deficiencies caused minor alterations in photosynthesis, with no apparent signs of oxidative damage. In contrast, metabolomics analysis revealed a global and largely overlapping metabolome rewiring in both ascorbate-deficiencies, suggesting that chloroplastic ascorbate modulates plant metabolism. We observed significant alterations in amino acid metabolism, particularly in arginine metabolism, activation of nucleotide salvage pathways, and changes in secondary metabolism. In addition, proteome-wide analysis of thermostability revealed that ascorbate may interact with enzymes involved in arginine metabolism, the Calvin-Benson cycle, and several photosynthetic electron transport components. Overall, our results suggest that, independently of oxidative stress, chloroplastic ascorbate interconnects and coordinates diverse metabolic pathways in vascular plants and thus acts as a regulatory hub.","creator":"Toth, D., Tengolics, R., Aarabi, F., Karlsson, A., Vidal-Meireles, A., Kovacs, L., Kuntam, S., Kormoczi, T., Fernie, A. R., Hudson, E., Papp, B., Toth, S. Z."},{"id":"2024.03.18.585456v1","slug":"discovery-of-active-mouse-plant-and-fungal-cytochrome-p450s-in-endogenous-proteomes-and-upon-expression-in-planta","title":"Discovery of active mouse, plant and fungal cytochrome P450s in endogenous proteomes and upon expression in planta.","link":"http://biorxiv.org/cgi/content/short/2024.03.18.585456v1?rss=1","abstract":"Eukaryotes produce a large number of cytochrome P450s that mediate the synthesis and degradation of diverse endogenous and exogenous metabolites. Yet, most of these P450s are uncharacterized and global tools to study these challenging, membrane-resident enzymes remain to be exploited. Here, we applied activity profiling of plant, mouse and fungal P450s with chemical probes that become reactive when oxidized by P450 enzymes. Identification by mass spectrometry revealed labeling of a wide range of active P450s, including six plant P450s, 40 mouse P450s and 13 P450s of the fungal wheat pathogen Zymoseptoria tritici. We next used transient expression of GFP-tagged P450s by agroinfiltration to show ER-targeting and NADPH-dependent, activity-based labeling of plant, mouse and fungal P450s. Both global profiling and transient expression can be used to detect a broad range of active P450s to study e.g. their regulation and discover selective inhibitors.","creator":"Font Farre, M., Brown, D., Toth, R., Mahadevan, C., Brazier-Hicks, M., Morimoto, K., Kaschani, F., Sinclair, J., Dale, R., Hall, S., Morris, M., Kaiser, M., Wright, A. T., Burton, J., van der Hoorn, R. A. L."},{"id":"2024.03.17.585425v1","slug":"high-resolution-mapping-of-novel-non-transgressive-hybrid-susceptibility-in-barley-exploited-by-p-teres-f-maculata-maps-to-a-single-pentatricopeptide-repeat-containing-protein","title":"High resolution mapping of novel non-transgressive hybrid susceptibility in barley exploited by P. teres f. maculata maps to a single pentatricopeptide repeat-containing protein","link":"http://biorxiv.org/cgi/content/short/2024.03.17.585425v1?rss=1","abstract":"Hybrid genotypes can provide significant yield gains over conventional inbred varieties due to heterosis or hybrid vigor. However, hybrids can also display unintended negative attributes or phenotypes such as extreme pathogen susceptibility. The necrotrophic pathogen Pyrenophora teres f. maculata (Ptm) causes spot form net blotch, which has caused significant losses to barley worldwide. Here, we report on a non-transgressive hybrid susceptibility locus in barley initially recognized because the three parental lines CI5791, Tifang and Golden Promise are resistant to Ptm isolate 13IM.3, however F2 progeny from CI5791 x Tifang and CI5791 x Golden Promise crosses exhibited extreme susceptibility. The susceptible phenotype segregated in a ratio of 1 resistant:1 susceptible representing a genetic segregation ratio of 1 parental (res):2 heterozygous (sus):1 parental (res) suggesting a single hybrid susceptibility locus. Genetic mapping using a total of 715 CI5791 x Tifang F2 individuals (1430 recombinant gametes) and 149 targeted SNPs delimited the hybrid susceptibility locus designated Susceptibility to Pyrenophora teres 2 (Spt2) to an [~]198 kb region on chromosome 5H of the Morex V3 reference assembly. This single locus was independently mapped with 83 CI5791 x Golden Promise F2 individuals (166 recombinant gametes) and 180 genome wide SNPs that colocalized to the same Spt2 locus. The CI5791 genome was sequenced using PacBio Continuous Long Read technology and comparative analysis between CI5791 and the publicly available Golden Promise genome assembly determined that the delimited region contained a single high confidence Spt2 candidate gene predicted to encode a pentatricopeptide repeat-containing protein.","creator":"Clare, S. J., Alhashel, A. F., Li, M., Effertz, K. M., Poudel, R. S., Zhang, J., Brueggeman, R. S."},{"id":"2024.03.17.585399v1","slug":"effects-of-arbuscular-mycorrhizal-fungi-on-nitrogen-uptake-in-cotton-gossypium-hirsutum-l-under-low-nitrogen-conditions","title":"Effects of arbuscular mycorrhizal fungi on nitrogen uptake in cotton (Gossypium hirsutum L.) under low-nitrogen conditions","link":"http://biorxiv.org/cgi/content/short/2024.03.17.585399v1?rss=1","abstract":"SummaryO_LICotton is an important global cash crop whose yield and quality are highly influenced by soil nitrogen. Therefore, examining the interactions between roots and arbuscular mycorrhizal fungi (AMF) under reduced nitrogen conditions is of great significance. C_LIO_LIWe investigated the effects of nitrogen application (0, 250, and 375 kg{middle dot} hm-2) on the AMF infection rate of cotton, the nitrogen content of each organ, root morphological characteristics and biomass, soil extracellular enzyme activity, and soil carbon and nitrogen content using a compartmentalized culture system. C_LIO_LIThe contribution of AMF to plant nitrogen was 10.40, 22.72, and 16.67% under high, low, and no nitrogen treatments, respectively. Under low-nitrogen conditions, the symbiosis between AMF and roots increased root surface area, tip number, branch number, mean diameter, and biomass; and increased soil extracellular enzyme activity (protease, NAG, PER, and PPO), the microbial biomass carbon-to-nitrogen ratio, active carbon content, and the soil nitrogen mineralization rate. Soil NO3--N, NH4+-N, and organic nitrogen content decreased, whereas the absorption of NO3--N by AMF hyphae was higher than that of NH4+-N. C_LIO_LIUnder low-nitrogen conditions, AMF promoted the decomposition of soil organic matter and the transformation of soil nitrogen through the action of hyphal microorganisms. C_LI","creator":"Wang, H., wang, y., cheng, X., He, Y., shen, z., zhang, W., pu, x."},{"id":"2024.03.16.585355v1","slug":"the-distribution-of-particulate-organic-matter-in-the-heterogeneous-soil-matrix-balancing-between-aerobic-respiration-and-denitrification","title":"The distribution of particulate organic matter in the heterogeneous soil matrix - balancing between aerobic respiration and denitrification","link":"http://biorxiv.org/cgi/content/short/2024.03.16.585355v1?rss=1","abstract":"Denitrification, a key process in soil nitrogen cycling, occurs predominantly within microbial hotspots, where denitrifiers use nitrate as an alternative electron acceptor. For accurate prediction of dinitrogen (N2) and nitrous oxide (N2O) emissions from denitrification, a precise quantification of these microscale hotspots is required.  Employing a unique combination of X-ray CT imaging, microscale O2 measurements, and 15N labeling, we were able to quantify hotspots of aerobic respiration and denitrification. We analyzed the dynamics of greenhouse gas (GHG) fluxes, soil oxygen supply, and the distribution of particulate organic matter (POM) in intact soil samples from a grassland and a cropland under different moisture conditions. Our findings reveal that both free and occluded particulate organic matter (POM), identified through X-ray CT imaging, contribute to GHG emissions. The occluded POM, i.e. POM at distant locations to air-filled pores, emerged as a primary driver of denitrification within structured soils of both land uses. Thus, the higher denitrification rates in the grassland could be attributed to the higher content of occluded POM. Conversely, despite possessing compacted areas that could favor denitrification, the cropland had only small amounts of occluded POM to stimulate denitrification. This underlines the complex interaction between soil structural heterogeneity, organic carbon supply, and microbial hotspot formation and thus contributes to a better understanding of soil-related GHG emissions.  In summary, our study provides a holistic understanding of soil-borne greenhouse gas emissions and emphasizes the need to refine predictive models for soil denitrification and N2O emissions by incorporating the microscale distribution of POM.","creator":"Lucas, M., Rohe, L., Apelt, B., Stange, C. F., Vogel, H.-J., Well, R., Schlüter, S."},{"id":"2024.03.16.585323v1","slug":"deep-learning-based-genomic-breeding-of-pest-resistant-grapevine","title":"Deep learning based genomic breeding of pest-resistant grapevine","link":"http://biorxiv.org/cgi/content/short/2024.03.16.585323v1?rss=1","abstract":"Crop pests have profoundly deleterious effects on crop yield and food security. However, conventional pest control depends heavily on the utilization of insecticides, which develops strong pesticide resistance and concerns of food safety. Crop and their wild relatives display diverse levels of pest resistance, indicating the feasibility for breeding of pest-resistant crop varieties. In this study, we integrate deep learning (DL)/machine learning (ML) algorithms, plant phenomics and whole genome sequencing (WGS) data to conduct genomic selection (GS) of pest-resistance in grapevine. We employ deep convolutional neural networks (DCNN) to accurately calculate the severity of damage by pests on grape leaves, which achieves a classification accuracy of 95.3% (Visual Geometry Group 16, VGG16, for binary trait) and a correlation coefficient of 0.94 in regression analysis (DCNN with Pest Damage Score, DCNN-PDS, for continuous trait). We apply DL models to predict and integrate phenotype (both binary and continuous) along with WGS data from 231 grape accessions, conducting Genome-Wide Association Studies (GWAS). This analysis detects a total of 69 QTLs, encompassing 139 candidate genes involved in pathways associated with pest resistance, including jasmonic acid (JA), salicylic acid (SA), ethylene, and other related pathways. Furthermore, through the combination with transcriptome data, we identify specific pest-resistant genes, such as ACA12 and CRK3, which play distinct roles in resisting herbivore attacks. Machine learning-based GS demonstrates a high accuracy (95.7%) and a strong correlation (0.90) in predicting the leaf area damaged by pests as binary and continuous traits in grapevine, respectively. In general, our study highlights the power of DL/ML in plant phenomics and GS, facilitating genomic breeding of pest-resistant grapevine.","creator":"Gan, Y., Liu, Z., Zhang, F., Xu, Q., Wang, X., Xue, H., Su, X., Ma, W., Long, Q., Ma, A., Huang, G., Liu, W., Xu, X., Sun, L., Zhang, Y., Liu, Y., Fang, X., Li, C., Yang, X., Wei, P., Fan, X., Zhang, C., Zhang, P., Liu, C., Zhang, Z., Huang, S., Wang, Y., Liu, Z., Zhou, Y."},{"id":"2024.03.15.585278v1","slug":"hairpin-rna-spray-confers-resistance-to-mungbean-yellow-mosaic-india-virus-in-mungbean","title":"Hairpin-RNA Spray Confers Resistance to Mungbean Yellow Mosaic India Virus in Mungbean","link":"http://biorxiv.org/cgi/content/short/2024.03.15.585278v1?rss=1","abstract":"The prevalence of Begomovirus diseases poses a significant threat to legume crops, necessitating the exploration of innovative control measures. This investigation explores the utilization of dsRNA molecules to initiate RNA interference (RNAi) targeting begomovirus, particularly focusing on Mungbean yellow mosaic India virus (MYMIV) and its potential threat to mungbean crops. Given the lack of genetic resistance in commercially available mungbean varieties, the study endeavors to employ RNAi as a strategic method for the effective control of MYMIV. The approach involves the preparation of vectors for the transient expression of three dsRNA targeting multiple overlapping ORFs of MYMIV DNA A through agroinoculation, and the selection of a highly efficient construct for dsRNA expression in bacteria, enabling topical application to mungbean plants in growth chamber experiments. Agroinoculation assays demonstrate effective resistance against MYMIV, as confirmed by reduced symptom severity, limited virus accumulation, and the presence of viral mRNAs. The stability of the prepared dsRNA against nucleases is confirmed, showcasing its ability to enter plant cells, move to non treated trifoliate leaves, and form siRNA when sprayed onto mungbean leaves, as validated by qRT-PCR and northern blotting. Varied combinations of the timing of dsRNA spray and virus infection reveal differential resistance against the virus. Notably, spraying two days before or on the same day as virus exposure emerges as the most suitable time to achieve optimal resistance against virus infection. In light of these findings, the topical application of dsRNAs stands out as a promising and effective strategy for MYMIV control in mungbean crops.","creator":"Dhobale, K. V., Sahoo, L."},{"id":"2024.03.15.585305v1","slug":"transcriptomic-analyses-in-the-gametophyte-ofdryopteris-affinis-apomixis-and-more","title":"Transcriptomic analyses in the gametophyte ofDryopteris affinis: apomixis and more","link":"http://biorxiv.org/cgi/content/short/2024.03.15.585305v1?rss=1","abstract":"The gametophyte of the fern Dryopteris affinis ssp. affinis represents a good model to explore the molecular basis of vegetative and reproductive development, as well as stress responses. Specifically, this fern reproduces asexually by apogamy, a peculiar case of apomixis whereby a sporophyte forms directly from a gametophytic cell without fertilization. Using an RNA-sequencing approach, we have previously annotated more than six thousand transcripts. Here, we selected one hundred of the inferred proteins that seemed particularly interesting for a detailed study of their potential functions, protein-protein interactions, and molecular phylogenies. As expected, a plethora of proteins associated with gametogenesis and embryogenesis in angiosperms, such as FERONIA (FER) and CHROMATING REMODELING 11 (CHR11) were identified, and more than a dozen candidates potentially involved in apomixis, such as ARGONAUTE4 (AGO4), AGO9, and AGO10, BABY BOOM (BBM), FASCIATED STEM4 (FAS4), FERTILIZATION-INDEPENDENT ENDOSPERM (FIE), and MATERNAL EFFECT EMBRYO ARREST29 (MEE29). In addition, proteins involved in the response to biotic and abiotic stresses were widely represented, as shown by the enrichment of heat-shock proteins. Using the String platform, studying interactomes revealed that most of the protein-protein interactions were predicted based on experimental, database, and text mining datasets, with MULTICOPY SUPPRESSOR OF IRA4 (MSI4) showing the highest number of 16 interactions. Lastly, some proteins were studied from a phylogenetic point of view, comparing the alignments with respect to more distantly or closely related plant groups, identifying AGO1 as the evolutionarily most similar to that other ferns and the most distant to the predicted common ancestor. This work sets the stage for future functional characterizations in relation to gametophyte development including apomictic reproduction.","creator":"Ojosnegros, S., Alvarez, J. M., Gagliardini, V., Quintanilla, L. G., Grossniklaus, U., Fernandez, H."},{"id":"2024.03.14.585007v1","slug":"an-optimized-somatic-embryo-transformation-system-assisted-homozygous-edited-rubber-tree-generation-method-mediated-by-crispr-cas9","title":"An optimized somatic embryo transformation system assisted homozygous edited rubber tree generation method mediated by CRISPR/Cas9","link":"http://biorxiv.org/cgi/content/short/2024.03.14.585007v1?rss=1","abstract":"Previously, we have realized the CRISPR/Cas9-RNP and plasmid mediated protoplast transient transformation genome editing in the rubber tree (Hevea brasiliensis), but no gene editing plants were acquired due to the bottleneck of genetic transformation. In present study, antibiotic sensitivity tests against kanamycin, hygromycin and basta were analyzed for embryo screening, the results demonstrated that 10 mg/L hygromycin is the best for transformation. Then Agrobacterium mediated transformation of H. brasiliensis embryos was carried out using a pCAMBIA1300-based CRISPR/Cas9 vector targeting Phytoene desaturase gene (HbPDS). High-throughput sequencing of T0 generation positive embryos which were used as regeneration materials in typical transformation procedure showed that more than 90% T0 edited embryos are chimeric with a 3.2% transformation efficiency. A T0 embryo with 9.8% edited cells was sliced into small pieces for one more cycle embryogenesis to produce T1 generation embryos in order to improve the ratio of homozygous embryos. Subsequently, next-generation sequencing (NGS) demonstrated that 29 out of 33 T1 embryos were edited, nearly 50% of which were found homozygous. At last, besides four chimeric plantlets with partial albino leaves, four plantlets with complete albino phenotype were regenerated from the 29 T1 generation edited embryos, among which one is a homozygous mono-allelic mutant and the other three are homozygous bi-allelic mutants. NGS demonstrated that the threshold for the proportion of edited cells with expected albino phenotype is between 70-85%. Additionally, Tail-PCR indicate that the T-DNA was inserted into different genome positions in the four homozygous edited plantlets, combined with the different genotypes are considered, the four homozygous plantlets can be confirmed as independently derived from single transformed cells. Overall, this is the first edited rubber trees with expected phenotype reported publicly, which shows the potential in genetic improvement of H. brasiliensis by CRISPR/Cas9 gene editing, and subculture of T0 positive transformed somatic embryos into T1 generation is proved to be an effective and necessary procedure to produce homozygous transgenic plantlets. This study presents a significant advancement in transgenic and gene editing for rubber tree.","creator":"Yang, X., Lin, Q., Udayabhanu, J., Hua, Y., Dai, X., Xin, S., Huang, H., Huang, T."},{"id":"2024.03.14.584999v1","slug":"decoding-strawberry-volatile-cultivar-diversity-through-comparative-transcriptome-analysis","title":"Decoding strawberry volatile cultivar diversity through comparative transcriptome analysis","link":"http://biorxiv.org/cgi/content/short/2024.03.14.584999v1?rss=1","abstract":"This study presents a comparative transcriptomic analysis of three commercial strawberry cultivars:  Rociera,  Calderon, and  Victory, aimed at uncovering the molecular basis of their distinct flavor and aroma profiles. Through RNA sequencing, we analyzed the transcriptomic landscape of these varieties, uncovering a notable array of differentially expressed genes (DEGs) between them. Specifically,  Rociera showed a higher count of DEGs compared to  Victory, suggesting significant differences in gene expression related to flavor and aroma between those cultivars. Our further investigations revealed pivotal metabolic pathways-- such as those involving furanones, amino acids, fatty acids, and terpenoids--participating in generating volatile organic compounds in strawberries. These pathways exhibited variety-specific expression patterns, underlining the genetic determinants of each varietys unique sensory characteristics. Gene Ontology (GO) enrichment analysis underscored important pathways like phototropism, sugar-mediated signaling, and terpenoid biosynthesis, highlighting the genetic intricacy that influences strawberry flavor and aroma. Additionally, our study identified 31,677 single nucleotide polymorphisms (SNPs) with a significant impact on genes associated with volatile compound biosynthesis. Notably, SNPs linked to key enzymes such as lipoxygenase 6, omega-6 fatty acid desaturase (FaFAD1), and phenylalanine ammonia-lyase 1 (PAL) were discovered, shedding light on the genetic variations that underlie flavor differences. Therefore, this research advances our comprehension of the genetic elements that impact strawberry fruit flavor and aroma, offering invaluable insights for molecular breeding endeavors focused on enhancing strawberry flavor.","creator":"Passa, K., Tsormpatsidis, E., Ganopoulos, I., Bazakos, C., Papasotiropoulos, V."},{"id":"2024.03.14.585090v1","slug":"postembryonic-developmental-roles-of-the-arabidopsis-keule-gene","title":"Postembryonic developmental roles of the Arabidopsis KEULE gene","link":"http://biorxiv.org/cgi/content/short/2024.03.14.585090v1?rss=1","abstract":"Cytokinesis in plant cells begins with the fusion of vesicles that transport cell wall materials at the center of the cell division plane, where the cell plate forms and expands radially until it fuses with the parental cell wall at the preprophase band. Vesicle fusion is facilitated by trans-SNARE complexes, with assistance from Sec1/Munc18 (SM) proteins. The SNARE protein KNOLLE and the SM protein KEULE are required for membrane fusion at the cell plate. Due to the crucial function of KEULE, all Arabidopsis (Arabidopsis thaliana) keule mutants identified to date are seedling lethal. Here, we identified the Arabidopsis serrata4-1 (sea4-1) and sea4-2 mutants, which carry recessive, hypomorphic alleles of KEULE. Homozygous sea4-1 and sea4-2 plants are viable and fertile but exhibit smaller rosettes and fewer leaves at bolting than the wild type. Their leaves are serrated, small, and undulated, with a complex venation pattern, develop necrotic patches, and undergo premature senescence. We established a likely relationship between these phenotypes and their defects in cytokinesis through reduced cell wall integrity and increased unfolded protein response. These findings shed light on the roles of KEULE in postembryonic development, particularly in the patterning of rosette leaves and leaf margins.","creator":"Ruiz-Bayon, A., Cara-Rodriguez, C., Sarmiento-Manus, R., Munoz-Viana, R., Lozano, F. M., Ponce, M. R., Micol, J. L."},{"id":"2024.03.15.585124v1","slug":"a-bacterial-type-iii-effector-hijacks-plant-ubiquitin-proteases-to-evade-degradation","title":"A bacterial type III effector hijacks plant ubiquitin proteases to evade degradation","link":"http://biorxiv.org/cgi/content/short/2024.03.15.585124v1?rss=1","abstract":"Gram-negative bacterial pathogens inject effector proteins inside plant cells using a type III secretion system. These effectors manipulate plant cellular functions and suppress the plant immune system in order to promote bacterial proliferation. Despite the fact that bacterial effectors are exogenous threatening proteins potentially exposed to the protein degradation systems inside plant cells, effectors are relative stable and able to perform their virulence functions. In this work, we found that RipE1, an effector protein secreted by the bacterial wilt pathogen, Ralstonia solanacearum, undergoes phosphorylation of specific residues inside plant cells, and this promotes its stability. Moreover, RipE1 associates with plant ubiquitin proteases, which contribute to RipE1 deubiquitination and stabilization. The absence of those specific phosphorylation sites or specific host ubiquitin proteases leads to a substantial decrease in RipE1 protein accumulation, indicating that RipE1 hijacks plant post-translational modification regulators in order to promote its own stability. These results suggest that effector stability or degradation in plant cells constitute another molecular event subject to co-evolution between plants and pathogens.","creator":"Yu, W., Li, M., Wang, W., Zhuang, H., Luo, J., Sang, Y., Segonzac, C., Macho, A. P."},{"id":"2024.03.14.585028v1","slug":"graphical-pangenomics-enabled-characterisation-of-structural-variant-impact-on-gene-expression-in-brassica-napus","title":"Graphical pangenomics-enabled characterisation of structural variant impact on gene expression in Brassica napus","link":"http://biorxiv.org/cgi/content/short/2024.03.14.585028v1?rss=1","abstract":"Structural variants (SVs, eg. insertions and deletions) are genomic variations > 50 bp that are known to be associated with a range of crop traits, from yield to flowering behaviour and stress responses. Recently, pangenome graphs have emerged as a powerful framework for analysing genomic data by encoding population- or species-level diversity in one data structure. Pangenome graphs have the potential to serve as unbiased references for downstream applications, including SV genotyping and pan-transcriptomic analyses.  In this work, we hypothesized that extensive variation affects transcript quantification and expression quantitative trait locus (eQTL) analysis when relying on a single reference, and that using pangenome graphs can mitigate reference sequence bias.  We combined long and short read whole genome sequencing data with expression profiling of Brassica napus (oilseed rape) to assess the impact of SVs on gene expression regulation and explored the utility of pangenome graphs for eQTL analysis. We demonstrate that pangenome graphs provides a superior framework for eQTL analysis by eliminating single reference bias in gene expression quantification. Combined with the graph-based genotyping of SVs, we identified 240 eQTL-SVs found in close proximity of target loci. These SVs affect expression of genes related to important traits, are often not in linkage with SNPs and represent diversity unaccounted for in classical SNP-based analyses.  This study highlights the multiple advantages of graph-based approaches in population-scale studies and provides novel insight into gene expression regulation in an important crop.","creator":"Golicz, A. A., Yildiz, G., Weber, S., Kox, T., Abbadi, A., Snowdon, R. J., Zanini, S. F."},{"id":"2024.03.14.584694v1","slug":"the-transcription-factor-atml1-maintains-giant-cell-identity-by-inducing-synthesis-of-its-own-very-long-chain-fatty-acid-containing-ligands","title":"The transcription factor ATML1 maintains giant cell identity by inducing synthesis of its own (very) long-chain fatty acid-containing ligands","link":"http://biorxiv.org/cgi/content/short/2024.03.14.584694v1?rss=1","abstract":"During development, cells not only adopt specialized identities but also maintain those identities. Endoreduplication is thought to maintain cell identity. High concentrations of ARABIDOPSIS THALIANA MERISTEM LAYER1 (ATML1) specify giant cell identity and induce endoreduplication in sepals. How different concentrations of ATML1 can specify different identities remains unclear. Here, we show that high concentrations of ATML1 induce the biosynthesis of both long-chain and very long-chain fatty acids (LCFAs/VLCFAs), and these fatty acids are required for the maintenance of giant cell identity. Inhibition of VLCFA biosynthesis causes endoreduplicated giant cells to resume division and lose their identity, indicating that endoreduplication is not sufficient to maintain cell identity. Structural predictions suggest that LCFA-containing lipids bind to the START domain 2 of ATML1, causing ATML1 dimerization and its auto-activation. Our data and modeling imply that ATML1 induces biosynthesis of its own lipid ligands in a positive feedback loop, shedding light on the intricate network dynamics that specify and maintain giant cell identity.  Teaser: Endoreduplicated cells in Arabidopsis thaliana sepals divide and de-differentiate in the absence of VLCFA biosynthesis.","creator":"Vadde, B. V. L., Russell, N. J., Bagde, S. R., Askey, B., Saint-Antoine, M. M., Brownfield, B. A., Mughal, S., Apprill, L. E., Khosla, A., Clark, F. K., Schwarz, E. M., Alseekh, S., Fernie, A. R., Singh, A., Schrick, K., Fromme, J. C., Skirycz, A., Formosa-Jordan, P., Roeder, A. H. K."},{"id":"2024.03.15.585069v1","slug":"overlapping-roles-of-arabidopsis-incurvata11-and-cupuliformis2-as-polycomb-repressive-complex-2-accessory-proteins","title":"Overlapping roles of Arabidopsis INCURVATA11 and CUPULIFORMIS2 as Polycomb Repressive Complex 2 accessory proteins","link":"http://biorxiv.org/cgi/content/short/2024.03.15.585069v1?rss=1","abstract":"Polycomb Repressive Complex 2 (PRC2) catalyzes the trimethylation of lysine 27 of histone H3 (H3K27me3) and plays a key role in epigenetic repression of gene expression in plants and animals. PRC2 core components have all been identified in Arabidopsis thaliana, with an expanding list of accessory proteins, some of which facilitate the recruitment of PRC2 to specific targets. INCURVATA11 (ICU11) is a 2-oxoglutarate and Fe2+-dependent dioxygenase that was previously shown to be a likely PRC2 accessory protein. In Tandem Affinity Purification (TAP)-based screens for interacting partners of ICU11 and its redundant paralog CUPULIFORMIS2 (CP2), we discovered that ICU11 interacts with four PRC2 core components, including EMBRYONIC FLOWER 2 (EMF2), and with the accessory proteins EMF1, TELOMERE REPEAT BINDING 1 (TRB1), TRB2, and TRB3. CP2 did not interact with PRC2 core components, nor with TRB1, TRB2, or TRB3, but did interact with TRB4 and TRB5. Both ICU11 and CP2 interacted with the nuclear proteins NAC DOMAIN CONTAINING PROTEIN 50 (NAC050), NAC052 and COP9 SIGNALOSOME SUBUNIT 1 (CSN1). Bimolecular Fluorescence Complementation (BiFC) assays revealed that ICU11 and CP2 both interact with the PRC2 core components CURLY LEAF and SWINGER, and the accessory proteins LIKE HETEROCHROMATIN PROTEIN 1, TRB1, and TRB3. ICU11 and CP2 did not interact with each other. Beyond their phenotypes, transcriptomic profiles revealed strong similarities between emf2-3 and the double mutant icu11-5 cp2-1, as well as with mutants in PRC2 core components. A significant proportion of the genes mis-regulated in icu11-5 cp2-1 are known to harbor H3K27me3 repressive marks in the wild type. Our results provide further evidence that ICU11 acts as a PRC2 accessory protein, and strongly suggest that CP2 plays a similar role.","creator":"Nadi, R., Juan-Vicente, L., Lup, S. D., Fernandez, Y., Rubio, V., Micol, J. L."},{"id":"2024.03.13.584811v1","slug":"simultaneous-and-dynamic-super-resolution-imaging-of-two-proteins-in-arabidopsis-thaliana-using-dual-color-sptpalm","title":"Simultaneous and Dynamic Super-Resolution Imaging of Two Proteins in Arabidopsis thaliana using dual-color sptPALM","link":"http://biorxiv.org/cgi/content/short/2024.03.13.584811v1?rss=1","abstract":"Super-resolution microscopy techniques have revolutionized cell biology by providing insights into the dynamics of single molecules and nanoscale organization within living cells. However, the application of dynamic live-cell methods in plants has been limited by the lack of suitable fluorophores for simultaneous visualization of multiple proteins. To address this challenge, we implemented a two-color sptPALM approach using codon-optimized photoactivatable fluorescent proteins PA-GFP and PATagRFP. Recently, we showed their individual usability in single-color experiments in Nicotiana benthamiana and Arabidopsis thaliana cells. Here, we now demonstrate the suitability of these fluorophores and their combined use for dual-color sptPALM for the simultaneous observation of two different protein fusions in the same plant cell.","creator":"Rohr, L., Ehinger, A., Burmeister, N. G., Meixner, A. J., Kemmerling, B., Harter, K., zur Oven-Krockhaus, S."},{"id":"2024.03.13.584916v1","slug":"a-rapid-and-efficient-in-vivo-inoculation-method-for-introducing-tree-stem-canker-pathogens-onto-leaves-suitable-for-large-scale-assessment-of-resistance-in-poplar-breeding-progeny","title":"A rapid and efficient in vivo inoculation method for introducing tree stem canker pathogens onto leaves, suitable for large-scale assessment of resistance in poplar breeding progeny","link":"http://biorxiv.org/cgi/content/short/2024.03.13.584916v1?rss=1","abstract":"Hybrid breeding is the most direct and efficient method of controlling and managing tree diseases. However, \"in vitro stem inoculation\" can not be used for rapid, efficient, and low-cost screening of resistant clones in the early stage of stem canker infection. Therefore, we inoculated stem canker pathogens on poplar leaves to evaluate the resistance of hybrid clones in the poplar-Valsa sordida pathosystem. \"In vivo leaf inoculation\" showed that: 1) V. sordida induces extended necrotic lesions and conidia on leaves. 2) The upper leaves exhibited higher resistance than the middle leaves. 3) The shading conditions induced more severe symptoms on leaves than the lighting conditions. 4) The susceptibility of poplar leaves to juvenile mycelium was higher than old myceliums. 5) The resistance of 48 poplar clones against V. sordida was distributed normally. 6) The efficacy of \"in vivo leaf inoculation\" was consistent with \"in vitro stem inoculation\". In summary, \"in vivo leaf inoculation\" has the advantages of a wide application range, simple operation, short experimental process, and host safety. This method is of great significance for poplar breeding, the study of pathology and molecular biology, pathogenic differentiation, and sporulation of fungal canker pathogens.","creator":"li, z., Zhang, B., Fu, Y., Suo, Y., Zhang, Y., Feng, J., Pan, L., Shen, W., Liu, H., Su, X., Zhao, J."},{"id":"2024.03.12.584584v1","slug":"natural-soil-suppressiveness-against-soilborne-phytopathogens-extends-to-the-control-of-insect-pest","title":"Natural soil suppressiveness against soilborne phytopathogens extends to the control of insect pest","link":"http://biorxiv.org/cgi/content/short/2024.03.12.584584v1?rss=1","abstract":"Since the 1980s, soils in a 22-km2 area near Lake Neuchatel in Switzerland have been recognized for their innate ability to suppress the black root rot plant disease. Their efficacy against insect pests has not been studied. We demonstrate that natural soil suppressiveness also protects plants from the leaf-feeding pest insect Oulema melanopus. Plants grown in the most suppressive soil have a reduced stress response to Oulema feeding, reflected by dampened levels of herbivore defense-related phytohormones and benzoxazinoids, and enhanced salicylate levels in plants without the insect indicate defense-priming. The rhizosphere microbiome network of the suppressive soils was highly tolerant to the destabilizing impact of insect exposure. The presence of plant-beneficial bacteria in the suppressive soils along with priming conferred plant resistance to the insect pest, manifesting also in the onset of insect microbiome dysbiosis. This intricate soil-plant-insect feedback extends natural soil suppressiveness from soilborne diseases to insect pests.","creator":"Harmsen, N., Vesga, P., Glauser, G., Klötzli, F., Heiman, C. M., Altenried, A., Vacheron, J., Muller, D., Moënne-Loccoz, Y., Steinger, T., Keel, C., Garrido-Sanz, D."},{"id":"2024.03.13.584802v1","slug":"unveiling-shared-genetic-regulators-for-plant-architectural-and-biomass-yield-traits-in-sorghum","title":"Unveiling shared genetic regulators for plant architectural and biomass yield traits in sorghum","link":"http://biorxiv.org/cgi/content/short/2024.03.13.584802v1?rss=1","abstract":"Sorghum is emerging as an ideal genetic model for designing high-biomass bioenergy crops. Biomass yield, a complex trait influenced by various plant architectural features, is typically regulated by numerous genes. This study aims to dissect the genetic mechanisms underlying fourteen plant architectural and ten biomass yield traits in a sorghum association panel (SAP) across two growing seasons. We identified 321 associated loci via genome-wide association studies involving 234,264 single nucleotide polymorphisms (SNPs). These loci encompass both genes with a priori links to biomass traits, such as  maturity,  dwarfing (Dw),  leafbladeless1,  cryptochrome, and several loci not previously linked to roles in determining these traits. We identified 22 pleiotropic loci associated with variation in multiple phenotypes. Three of these loci, located on chromosomes 3 (S03_15463061), 6 (S06_42790178; Dw2), and 9 (S09_57005346; Dw1), exert significant and consistent effects on multiple traits. Additionally, we identified three genomic hotspots on chromosomes 6, 7, and 9, containing multiple SNPs associated with variation in plant architecture and biomass yield traits. Positive correlations were observed among linked SNPs close to or within the same genomic regions. Thirteen haplotypes were identified from these positively correlated SNPs on chr 6, with haplotypes 8 and 11 emerging as optimal combinations, exhibiting pronounced effects on the traits. Lastly, network analysis revealed that loci associated with flowering, plant heights, leaf characteristics, plant number, and tiller number per plant were highly interconnected with other genetic loci linked to plant architecture and biomass yield traits. The pyramiding of favorable alleles related to these traits holds promise for enhancing the future development of bioenergy sorghum crops.","creator":"Singh, A., Newton, L. A., Schnable, J. C., Thompson, A. M."}]},{"name":"Economics","feed":[]}]