[{"name":"Artificial Intelligence","feed":[{"title":"Abstraction-based Probabilistic Stability Analysis of Polyhedral Probabilistic Hybrid Systems.","link":"http://arxiv.org/abs/2304.02647","abstract":"In this paper, we consider the problem of probabilistic stability analysis of a subclass of Stochastic Hybrid Systems, namely, Polyhedral Probabilistic Hybrid Systems (PPHS), where the flow dynamics is given by a polyhedral inclusion, the discrete switching between modes happens probabilistically at the boundaries of their invariant regions and the continuous state is not reset during switching. We present an abstraction-based analysis framework that consists of constructing a finite Markov Decision Processes (MDP) such that verification of certain property on the finite MDP ensures the satisfaction of probabilistic stability on the PPHS. Further, we present a polynomial-time algorithm for verifying the corresponding property on the MDP. Our experimental analysis demonstrates the feasibility of the approach in successfully verifying probabilistic stability on PPHS of various dimensions and sizes.","creator":"Spandan Das, Pavithra Prabhakar"},{"title":"CT Multi-Task Learning with a Large Image-Text (LIT) Model.","link":"http://arxiv.org/abs/2304.02649","abstract":"Large language models (LLM) not only empower multiple language tasks but also serve as a general interface across different spaces. Up to now, it has not been demonstrated yet how to effectively translate the successes of LLMs in the computer vision field to the medical imaging field which involves high-dimensional and multi-modal medical images. In this paper, we report a feasibility study of building a multi-task CT large image-text (LIT) model for lung cancer diagnosis by combining an LLM and a large image model (LIM). Specifically, the LLM and LIM are used as encoders to perceive multi-modal information under task-specific text prompts, which synergizes multi-source information and task-specific and patient-specific priors for optimized diagnostic performance. The key components of our LIT model and associated techniques are evaluated with an emphasis on 3D lung CT analysis. Our initial results show that the LIT model performs multiple medical tasks well, including lung segmentation, lung nodule detection, and lung cancer classification. Active efforts are in progress to develop large image-language models for superior medical imaging in diverse applications and optimal patient outcomes.","creator":"Chuang Niu, Ge Wang"},{"title":"Adaptive Ensemble Learning: Boosting Model Performance through Intelligent Feature Fusion in Deep Neural Networks.","link":"http://arxiv.org/abs/2304.02653","abstract":"In this paper, we present an Adaptive Ensemble Learning framework that aims to boost the performance of deep neural networks by intelligently fusing features through ensemble learning techniques. The proposed framework integrates ensemble learning strategies with deep learning architectures to create a more robust and adaptable model capable of handling complex tasks across various domains. By leveraging intelligent feature fusion methods, the Adaptive Ensemble Learning framework generates more discriminative and effective feature representations, leading to improved model performance and generalization capabilities.  We conducted extensive experiments and evaluations on several benchmark datasets, including image classification, object detection, natural language processing, and graph-based learning tasks. The results demonstrate that the proposed framework consistently outperforms baseline models and traditional feature fusion techniques, highlighting its effectiveness in enhancing deep learning models' performance. Furthermore, we provide insights into the impact of intelligent feature fusion on model performance and discuss the potential applications of the Adaptive Ensemble Learning framework in real-world scenarios.  The paper also explores the design and implementation of adaptive ensemble models, ensemble training strategies, and meta-learning techniques, which contribute to the framework's versatility and adaptability. In conclusion, the Adaptive Ensemble Learning framework represents a significant advancement in the field of feature fusion and ensemble learning for deep neural networks, with the potential to transform a wide range of applications across multiple domains.","creator":"Neelesh Mungoli"},{"title":"Predictive Coding as a Neuromorphic Alternative to Backpropagation: A Critical Evaluation.","link":"http://arxiv.org/abs/2304.02658","abstract":"Backpropagation has rapidly become the workhorse credit assignment algorithm for modern deep learning methods. Recently, modified forms of predictive coding (PC), an algorithm with origins in computational neuroscience, have been shown to result in approximately or exactly equal parameter updates to those under backpropagation. Due to this connection, it has been suggested that PC can act as an alternative to backpropagation with desirable properties that may facilitate implementation in neuromorphic systems. Here, we explore these claims using the different contemporary PC variants proposed in the literature. We obtain time complexity bounds for these PC variants which we show are lower-bounded by backpropagation. We also present key properties of these variants that have implications for neurobiological plausibility and their interpretations, particularly from the perspective of standard PC as a variational Bayes algorithm for latent probabilistic models. Our findings shed new light on the connection between the two learning frameworks and suggest that, in its current forms, PC may have more limited potential as a direct replacement of backpropagation than previously envisioned.","creator":"Umais Zahid, Qinghai Guo, Zafeirios Fountas"},{"title":"ACTION++: Improving Semi-supervised Medical Image Segmentation with Adaptive Anatomical Contrast.","link":"http://arxiv.org/abs/2304.02689","abstract":"Medical data often exhibits long-tail distributions with heavy class imbalance, which naturally leads to difficulty in classifying the minority classes (i.e., boundary regions or rare objects). Recent work has significantly improved semi-supervised medical image segmentation in long-tailed scenarios by equipping them with unsupervised contrastive criteria. However, it remains unclear how well they will perform in the labeled portion of data where class distribution is also highly imbalanced. In this work, we present ACTION++, an improved contrastive learning framework with adaptive anatomical contrast for semi-supervised medical segmentation. Specifically, we propose an adaptive supervised contrastive loss, where we first compute the optimal locations of class centers uniformly distributed on the embedding space (i.e., off-line), and then perform online contrastive matching training by encouraging different class features to adaptively match these distinct and uniformly distributed class centers. Moreover, we argue that blindly adopting a constant temperature $\\tau$ in the contrastive loss on long-tailed medical data is not optimal, and propose to use a dynamic $\\tau$ via a simple cosine schedule to yield better separation between majority and minority classes. Empirically, we evaluate ACTION++ on ACDC and LA benchmarks and show that it achieves state-of-the-art across two semi-supervised settings. Theoretically, we analyze the performance of adaptive anatomical contrast and confirm its superiority in label efficiency.","creator":"Chenyu You, Weicheng Dai, Yifei Min, Lawrence Staib, Jas Sekhon, James S. Duncan"},{"title":"Structured prompt interrogation and recursive extraction of semantics (SPIRES): A method for populating knowledge bases using zero-shot learning.","link":"http://arxiv.org/abs/2304.02711","abstract":"Creating knowledge bases and ontologies is a time consuming task that relies on a manual curation. AI/NLP approaches can assist expert curators in populating these knowledge bases, but current approaches rely on extensive training data, and are not able to populate arbitrary complex nested knowledge schemas.  Here we present Structured Prompt Interrogation and Recursive Extraction of Semantics (SPIRES), a Knowledge Extraction approach that relies on the ability of Large Language Models (LLMs) to perform zero-shot learning (ZSL) and general-purpose query answering from flexible prompts and return information conforming to a specified schema. Given a detailed, user-defined knowledge schema and an input text, SPIRES recursively performs prompt interrogation against GPT-3+ to obtain a set of responses matching the provided schema. SPIRES uses existing ontologies and vocabularies to provide identifiers for all matched elements.  We present examples of use of SPIRES in different domains, including extraction of food recipes, multi-species cellular signaling pathways, disease treatments, multi-step drug mechanisms, and chemical to disease causation graphs. Current SPIRES accuracy is comparable to the mid-range of existing Relation Extraction (RE) methods, but has the advantage of easy customization, flexibility, and, crucially, the ability to perform new tasks in the absence of any training data. This method supports a general strategy of leveraging the language interpreting capabilities of LLMs to assemble knowledge bases, assisting manual knowledge curation and acquisition while supporting validation with publicly-available databases and ontologies external to the LLM.  SPIRES is available as part of the open source OntoGPT package: https://github.com/ monarch-initiative/ontogpt.","creator":"J. Harry Caufield, Harshad Hegde, Vincent Emonet, Nomi L. Harris, Marcin P. Joachimiak, Nicolas Matentzoglu, HyeongSik Kim, Sierra A.T. Moxon, Justin T. Reese, Melissa A. Haendel, Peter N. Robinson, Christopher J. Mungall"},{"title":"To Asymmetry and Beyond: Structured Pruning of Sequence to Sequence Models for Improved Inference Efficiency.","link":"http://arxiv.org/abs/2304.02721","abstract":"Sequence-to-sequence language models can be used to produce abstractive summaries which are coherent, relevant, and concise. Still, model sizes can make deployment in latency-sensitive or web-scale implementations difficult. This paper studies the relationship between model size, structured pruning, inference efficiency, and summarization accuracy on widely used summarization datasets. We show that model accuracy is tied to the encoder size while inference efficiency is connected to the decoder. Using asymmetric pruning can lead to nearly 3x improvement in inference latency with ~1 point loss in Rouge-2. Moreover, we find both the average degradation and the role of asymmetry to be consistent across model sizes and variations in datasets.","creator":"Daniel Campos, ChengXiang Zhai"},{"title":"Core Challenges in Embodied Vision-Language Planning.","link":"http://arxiv.org/abs/2304.02738","abstract":"Recent advances in the areas of Multimodal Machine Learning and Artificial Intelligence (AI) have led to the development of challenging tasks at the intersection of Computer Vision, Natural Language Processing, and Robotics. Whereas many approaches and previous survey pursuits have characterised one or two of these dimensions, there has not been a holistic analysis at the center of all three. Moreover, even when combinations of these topics are considered, more focus is placed on describing, e.g., current architectural methods, as opposed to also illustrating high-level challenges and opportunities for the field. In this survey paper, we discuss Embodied Vision-Language Planning (EVLP) tasks, a family of prominent embodied navigation and manipulation problems that jointly leverage computer vision and natural language for interaction in physical environments. We propose a taxonomy to unify these tasks and provide an in-depth analysis and comparison of the current and new algorithmic approaches, metrics, simulators, and datasets used for EVLP tasks. Finally, we present the core challenges that we believe new EVLP works should seek to address, and we advocate for task construction that enables model generalisability and furthers real-world deployment.","creator":"Jonathan Francis, Nariaki Kitamura, Felix Labelle, Xiaopeng Lu, Ingrid Navarro, Jean Oh"},{"title":"Bengali Fake Review Detection using Semi-supervised Generative Adversarial Networks.","link":"http://arxiv.org/abs/2304.02739","abstract":"This paper investigates the potential of semi-supervised Generative Adversarial Networks (GANs) to fine-tune pretrained language models in order to classify Bengali fake reviews from real reviews with a few annotated data. With the rise of social media and e-commerce, the ability to detect fake or deceptive reviews is becoming increasingly important in order to protect consumers from being misled by false information. Any machine learning model will have trouble identifying a fake review, especially for a low resource language like Bengali. We have demonstrated that the proposed semi-supervised GAN-LM architecture (generative adversarial network on top of a pretrained language model) is a viable solution in classifying Bengali fake reviews as the experimental results suggest that even with only 1024 annotated samples, BanglaBERT with semi-supervised GAN (SSGAN) achieved an accuracy of 83.59% and a f1-score of 84.89% outperforming other pretrained language models - BanglaBERT generator, Bangla BERT Base and Bangla-Electra by almost 3%, 4% and 10% respectively in terms of accuracy. The experiments were conducted on a manually labeled food review dataset consisting of total 6014 real and fake reviews collected from various social media groups. Researchers that are experiencing difficulty recognizing not just fake reviews but other classification issues owing to a lack of labeled data may find a solution in our proposed methodology.","creator":"Md. Tanvir Rouf Shawon, G. M. Shahariar, Faisal Muhammad Shah, Mohammad Shafiul Alam, Md. Shahriar Mahbub"},{"title":"Behavioral estimates of conceptual structure are robust across tasks in humans but not large language models.","link":"http://arxiv.org/abs/2304.02754","abstract":"Neural network models of language have long been used as a tool for developing hypotheses about conceptual representation in the mind and brain. For many years, such use involved extracting vector-space representations of words and using distances among these to predict or understand human behavior in various semantic tasks. In contemporary language AIs, however, it is possible to interrogate the latent structure of conceptual representations using methods nearly identical to those commonly used with human participants. The current work uses two common techniques borrowed from cognitive psychology to estimate and compare lexical-semantic structure in both humans and a well-known AI, the DaVinci variant of GPT-3. In humans, we show that conceptual structure is robust to differences in culture, language, and method of estimation. Structures estimated from AI behavior, while individually fairly consistent with those estimated from human behavior, depend much more upon the particular task used to generate behavior responses--responses generated by the very same model in the two tasks yield estimates of conceptual structure that cohere less with one another than do human structure estimates. The results suggest one important way that knowledge inhering in contemporary AIs can differ from human cognition.","creator":"Siddharth Suresh, Lisa Padua, Kushin Mukherjee, Timothy T Rogers"},{"title":"The Saudi Privacy Policy Dataset.","link":"http://arxiv.org/abs/2304.02757","abstract":"This paper introduces the Saudi Privacy Policy Dataset, a diverse compilation of Arabic privacy policies from various sectors in Saudi Arabia, annotated according to the 10 principles of the Personal Data Protection Law (PDPL); the PDPL was established to be compatible with General Data Protection Regulation (GDPR); one of the most comprehensive data regulations worldwide. Data were collected from multiple sources, including the Saudi Central Bank, the Saudi Arabia National United Platform, the Council of Health Insurance, and general websites using Google and Wikipedia. The final dataset includes 1,000 websites belonging to 7 sectors, 4,638 lines of text, 775,370 tokens, and a corpus size of 8,353 KB. The annotated dataset offers significant reuse potential for assessing privacy policy compliance, benchmarking privacy practices across industries, and developing automated tools for monitoring adherence to data protection regulations. By providing a comprehensive and annotated dataset of privacy policies, this paper aims to facilitate further research and development in the areas of privacy policy analysis, natural language processing, and machine learning applications related to privacy and data protection, while also serving as an essential resource for researchers, policymakers, and industry professionals interested in understanding and promoting compliance with privacy regulations in Saudi Arabia.","creator":"Hend Al-Khalifa, Malak Mashaabi, Ghadi Al-Yahya, Raghad Alnashwan"},{"title":"Application of Transformers based methods in Electronic Medical Records: A Systematic Literature Review.","link":"http://arxiv.org/abs/2304.02768","abstract":"The combined growth of available data and their unstructured nature has received increased interest in natural language processing (NLP) techniques to make value of these data assets since this format is not suitable for statistical analysis. This work presents a systematic literature review of state-of-the-art advances using transformer-based methods on electronic medical records (EMRs) in different NLP tasks. To the best of our knowledge, this work is unique in providing a comprehensive review of research on transformer-based methods for NLP applied to the EMR field. In the initial query, 99 articles were selected from three public databases and filtered into 65 articles for detailed analysis. The papers were analyzed with respect to the business problem, NLP task, models and techniques, availability of datasets, reproducibility of modeling, language, and exchange format. The paper presents some limitations of current research and some recommendations for further research.","creator":"Vitor Alcantara Batista, Alexandre Gon&#xe7;alves Evsukoff"},{"title":"Low-Shot Learning for Fictional Claim Verification.","link":"http://arxiv.org/abs/2304.02769","abstract":"In this paper, we study the problem of claim verification in the context of claims about fictional stories in a low-shot learning setting. To this end, we generate two synthetic datasets and then develop an end-to-end pipeline and model that is tested on both benchmarks. To test the efficacy of our pipeline and the difficulty of benchmarks, we compare our models' results against human and random assignment results. Our code is available at https://github.com/Derposoft/plot_hole_detection.","creator":"Viswanath Chadalapaka, Derek Nguyen, JoonWon Choi, Shaunak Joshi, Mohammad Rostami"},{"title":"Inapproximability of sufficient reasons for decision trees.","link":"http://arxiv.org/abs/2304.02781","abstract":"In this note, we establish the hardness of approximation of the problem of computing the minimal size of a $\\delta$-sufficient reason for decision trees.","creator":"Alexander Kozachinskiy"},{"title":"UNICORN: A Unified Backdoor Trigger Inversion Framework.","link":"http://arxiv.org/abs/2304.02786","abstract":"The backdoor attack, where the adversary uses inputs stamped with triggers (e.g., a patch) to activate pre-planted malicious behaviors, is a severe threat to Deep Neural Network (DNN) models. Trigger inversion is an effective way of identifying backdoor models and understanding embedded adversarial behaviors. A challenge of trigger inversion is that there are many ways of constructing the trigger. Existing methods cannot generalize to various types of triggers by making certain assumptions or attack-specific constraints. The fundamental reason is that existing work does not consider the trigger's design space in their formulation of the inversion problem. This work formally defines and analyzes the triggers injected in different spaces and the inversion problem. Then, it proposes a unified framework to invert backdoor triggers based on the formalization of triggers and the identified inner behaviors of backdoor models from our analysis. Our prototype UNICORN is general and effective in inverting backdoor triggers in DNNs. The code can be found at https://github.com/RU-System-Software-and-Security/UNICORN.","creator":"Zhenting Wang, Kai Mei, Juan Zhai, Shiqing Ma"},{"title":"End-to-end Manipulator Calligraphy Planning via Variational Imitation Learning.","link":"http://arxiv.org/abs/2304.02801","abstract":"Planning from demonstrations has shown promising results with the advances of deep neural networks. One of the most popular real-world applications is automated handwriting using a robotic manipulator. Classically it is simplified as a two-dimension problem. This representation is suitable for elementary drawings, but it is not sufficient for Japanese calligraphy or complex work of art where the orientation of a pen is part of the user expression. In this study, we focus on automated planning of Japanese calligraphy using a three-dimension representation of the trajectory as well as the rotation of the pen tip, and propose a novel deep imitation learning neural network that learns from expert demonstrations through a combination of images and pose data. The network consists of a combination of variational auto-encoder, bi-directional LSTM, and Multi-Layer Perceptron (MLP). Experiments are conducted in a progressive way, and results demonstrate that the proposed approach is successful in completion of tasks for real-world robots, overcoming the distribution shift problem in imitation learning. The source code and dataset will be public.","creator":"Fangping Xie, Pierre Le Meur, Charith Fernando"},{"title":"HomPINNs: homotopy physics-informed neural networks for solving the inverse problems of nonlinear differential equations with multiple solutions.","link":"http://arxiv.org/abs/2304.02811","abstract":"Due to the complex behavior arising from non-uniqueness, symmetry, and bifurcations in the solution space, solving inverse problems of nonlinear differential equations (DEs) with multiple solutions is a challenging task. To address this issue, we propose homotopy physics-informed neural networks (HomPINNs), a novel framework that leverages homotopy continuation and neural networks (NNs) to solve inverse problems. The proposed framework begins with the use of a NN to simultaneously approximate known observations and conform to the constraints of DEs. By utilizing the homotopy continuation method, the approximation traces the observations to identify multiple solutions and solve the inverse problem. The experiments involve testing the performance of the proposed method on one-dimensional DEs and applying it to solve a two-dimensional Gray-Scott simulation. Our findings demonstrate that the proposed method is scalable and adaptable, providing an effective solution for solving DEs with multiple solutions and unknown parameters. Moreover, it has significant potential for various applications in scientific computing, such as modeling complex systems and solving inverse problems in physics, chemistry, biology, etc.","creator":"Haoyang Zheng, Yao Huang, Ziyang Huang, Wenrui Hao, Guang Lin"},{"title":"4D Agnostic Real-Time Facial Animation Pipeline for Desktop Scenarios.","link":"http://arxiv.org/abs/2304.02814","abstract":"We present a high-precision real-time facial animation pipeline suitable for animators to use on their desktops. This pipeline is about to be launched in FACEGOOD's Avatary\\footnote{https://www.avatary.com/} software, which will accelerate animators' productivity. The pipeline differs from professional head-mounted facial capture solutions in that it only requires the use of a consumer-grade 3D camera on the desk to achieve high-precision real-time facial capture. The system enables animators to create high-quality facial animations with ease and speed, while reducing the cost and complexity of traditional facial capture solutions. Our approach has the potential to revolutionize the way facial animation is done in the entertainment industry.","creator":"Wei Chen, HongWei Xu, Jelo Wang"},{"title":"GPT detectors are biased against non-native English writers.","link":"http://arxiv.org/abs/2304.02819","abstract":"The rapid adoption of generative language models has brought about substantial advancements in digital communication, while simultaneously raising concerns regarding the potential misuse of AI-generated content. Although numerous detection methods have been proposed to differentiate between AI and human-generated content, the fairness and robustness of these detectors remain underexplored. In this study, we evaluate the performance of several widely-used GPT detectors using writing samples from native and non-native English writers. Our findings reveal that these detectors consistently misclassify non-native English writing samples as AI-generated, whereas native writing samples are accurately identified. Furthermore, we demonstrate that simple prompting strategies can not only mitigate this bias but also effectively bypass GPT detectors, suggesting that GPT detectors may unintentionally penalize writers with constrained linguistic expressions. Our results call for a broader conversation about the ethical implications of deploying ChatGPT content detectors and caution against their use in evaluative or educational settings, particularly when they may inadvertently penalize or exclude non-native English speakers from the global discourse.","creator":"Weixin Liang, Mert Yuksekgonul, Yining Mao, Eric Wu, James Zou"},{"title":"DITTO-NeRF: Diffusion-based Iterative Text To Omni-directional 3D Model.","link":"http://arxiv.org/abs/2304.02827","abstract":"The increasing demand for high-quality 3D content creation has motivated the development of automated methods for creating 3D object models from a single image and/or from a text prompt. However, the reconstructed 3D objects using state-of-the-art image-to-3D methods still exhibit low correspondence to the given image and low multi-view consistency. Recent state-of-the-art text-to-3D methods are also limited, yielding 3D samples with low diversity per prompt with long synthesis time. To address these challenges, we propose DITTO-NeRF, a novel pipeline to generate a high-quality 3D NeRF model from a text prompt or a single image. Our DITTO-NeRF consists of constructing high-quality partial 3D object for limited in-boundary (IB) angles using the given or text-generated 2D image from the frontal view and then iteratively reconstructing the remaining 3D NeRF using inpainting latent diffusion model. We propose progressive 3D object reconstruction schemes in terms of scales (low to high resolution), angles (IB angles initially to outer-boundary (OB) later), and masks (object to background boundary) in our DITTO-NeRF so that high-quality information on IB can be propagated into OB. Our DITTO-NeRF outperforms state-of-the-art methods in terms of fidelity and diversity qualitatively and quantitatively with much faster training times than prior arts on image/text-to-3D such as DreamFusion, and NeuralLift-360.","creator":"Hoigi Seo, Hayeon Kim, Gwanghyun Kim, Se Young Chun"},{"title":"Probing the Purview of Neural Networks via Gradient Analysis.","link":"http://arxiv.org/abs/2304.02834","abstract":"We analyze the data-dependent capacity of neural networks and assess anomalies in inputs from the perspective of networks during inference. The notion of data-dependent capacity allows for analyzing the knowledge base of a model populated by learned features from training data. We define purview as the additional capacity necessary to characterize inference samples that differ from the training data. To probe the purview of a network, we utilize gradients to measure the amount of change required for the model to characterize the given inputs more accurately. To eliminate the dependency on ground-truth labels in generating gradients, we introduce confounding labels that are formulated by combining multiple categorical labels. We demonstrate that our gradient-based approach can effectively differentiate inputs that cannot be accurately represented with learned features. We utilize our approach in applications of detecting anomalous inputs, including out-of-distribution, adversarial, and corrupted samples. Our approach requires no hyperparameter tuning or additional data processing and outperforms state-of-the-art methods by up to 2.7%, 19.8%, and 35.6% of AUROC scores, respectively.","creator":"Jinsol Lee, Charlie Lehman, Mohit Prabhushankar, Ghassan AlRegib"},{"title":"TBDetector:Transformer-Based Detector for Advanced Persistent Threats with Provenance Graph.","link":"http://arxiv.org/abs/2304.02838","abstract":"APT detection is difficult to detect due to the long-term latency, covert and slow multistage attack patterns of Advanced Persistent Threat (APT). To tackle these issues, we propose TBDetector, a transformer-based advanced persistent threat detection method for APT attack detection. Considering that provenance graphs provide rich historical information and have the powerful attacks historic correlation ability to identify anomalous activities, TBDetector employs provenance analysis for APT detection, which summarizes long-running system execution with space efficiency and utilizes transformer with self-attention based encoder-decoder to extract long-term contextual features of system states to detect slow-acting attacks. Furthermore, we further introduce anomaly scores to investigate the anomaly of different system states, where each state is calculated with an anomaly score corresponding to its similarity score and isolation score. To evaluate the effectiveness of the proposed method, we have conducted experiments on five public datasets, i.e., streamspot, cadets, shellshock, clearscope, and wget_baseline. Experimental results and comparisons with state-of-the-art methods have exhibited better performance of our proposed method.","creator":"Nan Wang, Xuezhi Wen, Dalin Zhang, Xibin Zhao, Jiahui Ma, Mengxia Luo, Sen Nie, Shi Wu, Jiqiang Liu"},{"title":"Whose Text Is It Anyway? Exploring BigCode, Intellectual Property, and Ethics.","link":"http://arxiv.org/abs/2304.02839","abstract":"Intelligent or generative writing tools rely on large language models that recognize, summarize, translate, and predict content. This position paper probes the copyright interests of open data sets used to train large language models (LLMs). Our paper asks, how do LLMs trained on open data sets circumvent the copyright interests of the used data? We start by defining software copyright and tracing its history. We rely on GitHub Copilot as a modern case study challenging software copyright. Our conclusion outlines obstacles that generative writing assistants create for copyright, and offers a practical road map for copyright analysis for developers, software law experts, and general users to consider in the context of intelligent LLM-powered writing tools.","creator":"Madiha Zahrah Choksi, David Goedicke"},{"title":"Robust Neural Architecture Search.","link":"http://arxiv.org/abs/2304.02845","abstract":"Neural Architectures Search (NAS) becomes more and more popular over these years. However, NAS-generated models tends to suffer greater vulnerability to various malicious attacks. Lots of robust NAS methods leverage adversarial training to enhance the robustness of NAS-generated models, however, they neglected the nature accuracy of NAS-generated models. In our paper, we propose a novel NAS method, Robust Neural Architecture Search (RNAS). To design a regularization term to balance accuracy and robustness, RNAS generates architectures with both high accuracy and good robustness. To reduce search cost, we further propose to use noise examples instead adversarial examples as input to search architectures. Extensive experiments show that RNAS achieves state-of-the-art (SOTA) performance on both image classification and adversarial attacks, which illustrates the proposed RNAS achieves a good tradeoff between robustness and accuracy.","creator":"Xunyu Zhu, Jian Li, Yong Liu, Weiping Wang"},{"title":"Robustmix: Improving Robustness by Regularizing the Frequency Bias of Deep Nets.","link":"http://arxiv.org/abs/2304.02847","abstract":"Deep networks have achieved impressive results on a range of well-curated benchmark datasets. Surprisingly, their performance remains sensitive to perturbations that have little effect on human performance. In this work, we propose a novel extension of Mixup called Robustmix that regularizes networks to classify based on lower-frequency spatial features. We show that this type of regularization improves robustness on a range of benchmarks such as Imagenet-C and Stylized Imagenet. It adds little computational overhead and, furthermore, does not require a priori knowledge of a large set of image transformations. We find that this approach further complements recent advances in model architecture and data augmentation, attaining a state-of-the-art mCE of 44.8 with an EfficientNet-B8 model and RandAugment, which is a reduction of 16 mCE compared to the baseline.","creator":"Jonas Ngnawe, Marianne ABEMGNIGNI NJIFON, Jonathan Heek, Yann Dauphin"},{"title":"A review of ensemble learning and data augmentation models for class imbalanced problems: combination, implementation and evaluation.","link":"http://arxiv.org/abs/2304.02858","abstract":"Class imbalance (CI) in classification problems arises when the number of observations belonging to one class is lower than the other classes. Ensemble learning that combines multiple models to obtain a robust model has been prominently used with data augmentation methods to address class imbalance problems. In the last decade, a number of strategies have been added to enhance ensemble learning and data augmentation methods, along with new methods such as generative adversarial networks (GANs). A combination of these has been applied in many studies, but the true rank of different combinations would require a computational review. In this paper, we present a computational review to evaluate data augmentation and ensemble learning methods used to address prominent benchmark CI problems. We propose a general framework that evaluates 10 data augmentation and 10 ensemble learning methods for CI problems. Our objective was to identify the most effective combination for improving classification performance on imbalanced datasets. The results indicate that combinations of data augmentation methods with ensemble learning can significantly improve classification performance on imbalanced datasets. These findings have important implications for the development of more effective approaches for handling imbalanced datasets in machine learning applications.","creator":"Azal Ahmad Khan, Omkar Chaudhari, Rohitash Chandra"},{"title":"Can Large Language Models Play Text Games Well? Current State-of-the-Art and Open Questions.","link":"http://arxiv.org/abs/2304.02868","abstract":"Large language models (LLMs) such as ChatGPT and GPT-4 have recently demonstrated their remarkable abilities of communicating with human users. In this technical report, we take an initiative to investigate their capacities of playing text games, in which a player has to understand the environment and respond to situations by having dialogues with the game world. Our experiments show that ChatGPT performs competitively compared to all the existing systems but still exhibits a low level of intelligence. Precisely, ChatGPT can not construct the world model by playing the game or even reading the game manual; it may fail to leverage the world knowledge that it already has; it cannot infer the goal of each step as the game progresses. Our results open up new research questions at the intersection of artificial intelligence, machine learning, and natural language processing.","creator":"Chen Feng Tsai, Xiaochen Zhou, Sierra S. Liu, Jing Li, Mo Yu, Hongyuan Mei"},{"title":"Automatic ICD-10 Code Association: A Challenging Task on French Clinical Texts.","link":"http://arxiv.org/abs/2304.02886","abstract":"Automatically associating ICD codes with electronic health data is a well-known NLP task in medical research. NLP has evolved significantly in recent years with the emergence of pre-trained language models based on Transformers architecture, mainly in the English language. This paper adapts these models to automatically associate the ICD codes. Several neural network architectures have been experimented with to address the challenges of dealing with a large set of both input tokens and labels to be guessed. In this paper, we propose a model that combines the latest advances in NLP and multi-label classification for ICD-10 code association. Fair experiments on a Clinical dataset in the French language show that our approach increases the $F_1$-score metric by more than 55\\% compared to state-of-the-art results.","creator":"Yakini Tchouka, Jean-Fran&#xe7;ois Couchot, David Laiymani, Philippe Selles, Azzedine Rahmani"},{"title":"Learning Cautiously in Federated Learning with Noisy and Heterogeneous Clients.","link":"http://arxiv.org/abs/2304.02892","abstract":"Federated learning (FL) is a distributed framework for collaboratively training with privacy guarantees. In real-world scenarios, clients may have Non-IID data (local class imbalance) with poor annotation quality (label noise). The co-existence of label noise and class imbalance in FL's small local datasets renders conventional FL methods and noisy-label learning methods both ineffective. To address the challenges, we propose FedCNI without using an additional clean proxy dataset. It includes a noise-resilient local solver and a robust global aggregator. For the local solver, we design a more robust prototypical noise detector to distinguish noisy samples. Further to reduce the negative impact brought by the noisy samples, we devise a curriculum pseudo labeling method and a denoise Mixup training strategy. For the global aggregator, we propose a switching re-weighted aggregation method tailored to different learning periods. Extensive experiments demonstrate our method can substantially outperform state-of-the-art solutions in mix-heterogeneous FL environments.","creator":"Chenrui Wu, Zexi Li, Fangxin Wang, Chao Wu"},{"title":"Object-centric Inference for Language Conditioned Placement: A Foundation Model based Approach.","link":"http://arxiv.org/abs/2304.02893","abstract":"We focus on the task of language-conditioned object placement, in which a robot should generate placements that satisfy all the spatial relational constraints in language instructions. Previous works based on rule-based language parsing or scene-centric visual representation have restrictions on the form of instructions and reference objects or require large amounts of training data. We propose an object-centric framework that leverages foundation models to ground the reference objects and spatial relations for placement, which is more sample efficient and generalizable. Experiments indicate that our model can achieve a 97.75% success rate of placement with only ~0.26M trainable parameters. Besides, our method generalizes better to both unseen objects and instructions. Moreover, with only 25% training data, we still outperform the top competing approach.","creator":"Zhixuan Xu, Kechun Xu, Yue Wang, Rong Xiong"},{"title":"The Governance of Physical Artificial Intelligence.","link":"http://arxiv.org/abs/2304.02924","abstract":"Physical artificial intelligence can prove to be one of the most important challenges of the artificial intelligence. The governance of physical artificial intelligence would define its responsible intelligent application in the society.","creator":"Yingbo Li, Anamaria-Beatrice Spulber, Yucong Duan"},{"title":"Quantifying and Defending against Privacy Threats on Federated Knowledge Graph Embedding.","link":"http://arxiv.org/abs/2304.02932","abstract":"Knowledge Graph Embedding (KGE) is a fundamental technique that extracts expressive representation from knowledge graph (KG) to facilitate diverse downstream tasks. The emerging federated KGE (FKGE) collaboratively trains from distributed KGs held among clients while avoiding exchanging clients' sensitive raw KGs, which can still suffer from privacy threats as evidenced in other federated model trainings (e.g., neural networks). However, quantifying and defending against such privacy threats remain unexplored for FKGE which possesses unique properties not shared by previously studied models. In this paper, we conduct the first holistic study of the privacy threat on FKGE from both attack and defense perspectives. For the attack, we quantify the privacy threat by proposing three new inference attacks, which reveal substantial privacy risk by successfully inferring the existence of the KG triple from victim clients. For the defense, we propose DP-Flames, a novel differentially private FKGE with private selection, which offers a better privacy-utility tradeoff by exploiting the entity-binding sparse gradient property of FKGE and comes with a tight privacy accountant by incorporating the state-of-the-art private selection technique. We further propose an adaptive privacy budget allocation policy to dynamically adjust defense magnitude across the training procedure. Comprehensive evaluations demonstrate that the proposed defense can successfully mitigate the privacy threat by effectively reducing the success rate of inference attacks from $83.1\\%$ to $59.4\\%$ on average with only a modest utility decrease.","creator":"Yuke Hu, Wei Liang, Ruofan Wu, Kai Xiao, Weiqiang Wang, Xiaochen Li, Jinfei Liu, Zhan Qin"},{"title":"Convolutional neural networks for crack detection on flexible road pavements.","link":"http://arxiv.org/abs/2304.02933","abstract":"Flexible road pavements deteriorate primarily due to traffic and adverse environmental conditions. Cracking is the most common deterioration mechanism; the surveying thereof is typically conducted manually using internationally defined classification standards. In South Africa, the use of high-definition video images has been introduced, which allows for safer road surveying. However, surveying is still a tedious manual process. Automation of the detection of defects such as cracks would allow for faster analysis of road networks and potentially reduce human bias and error. This study performs a comparison of six state-of-the-art convolutional neural network models for the purpose of crack detection. The models are pretrained on the ImageNet dataset, and fine-tuned using a new real-world binary crack dataset consisting of 14000 samples. The effects of dataset augmentation are also investigated. Of the six models trained, five achieved accuracy above 97%. The highest recorded accuracy was 98%, achieved by the ResNet and VGG16 models. The dataset is available at the following URL: https://zenodo.org/record/7795975","creator":"Hermann Tapamo, Anna Bosman, James Maina, Emile Horak"},{"title":"FengWu: Pushing the Skillful Global Medium-range Weather Forecast beyond 10 Days Lead.","link":"http://arxiv.org/abs/2304.02948","abstract":"We present FengWu, an advanced data-driven global medium-range weather forecast system based on Artificial Intelligence (AI). Different from existing data-driven weather forecast methods, FengWu solves the medium-range forecast problem from a multi-modal and multi-task perspective. Specifically, a deep learning architecture equipped with model-specific encoder-decoders and cross-modal fusion Transformer is elaborately designed, which is learned under the supervision of an uncertainty loss to balance the optimization of different predictors in a region-adaptive manner. Besides this, a replay buffer mechanism is introduced to improve medium-range forecast performance. With 39-year data training based on the ERA5 reanalysis, FengWu is able to accurately reproduce the atmospheric dynamics and predict the future land and atmosphere states at 37 vertical levels on a 0.25{\\deg} latitude-longitude resolution. Hindcasts of 6-hourly weather in 2018 based on ERA5 demonstrate that FengWu performs better than GraphCast in predicting 80\\% of the 880 reported predictands, e.g., reducing the root mean square error (RMSE) of 10-day lead global z500 prediction from 733 to 651 $m^{2}/s^2$. In addition, the inference cost of each iteration is merely 600ms on NVIDIA Tesla A100 hardware. The results suggest that FengWu can significantly improve the forecast skill and extend the skillful global medium-range weather forecast out to 10.75 days lead (with ACC of z500 &gt; 0.6) for the first time.","creator":"Kang Chen, Tao Han, Junchao Gong, Lei Bai, Fenghua Ling, Jing-Jia Luo, Xi Chen, Leiming Ma, Tianning Zhang, Rui Su, Yuanzheng Ci, Bin Li, Xiaokang Yang, Wanli Ouyang"},{"title":"Spritz-PS: Validation of Synthetic Face Images Using a Large Dataset of Printed Documents.","link":"http://arxiv.org/abs/2304.02982","abstract":"The capability of doing effective forensic analysis on printed and scanned (PS) images is essential in many applications. PS documents may be used to conceal the artifacts of images which is due to the synthetic nature of images since these artifacts are typically present in manipulated images and the main artifacts in the synthetic images can be removed after the PS. Due to the appeal of Generative Adversarial Networks (GANs), synthetic face images generated with GANs models are difficult to differentiate from genuine human faces and may be used to create counterfeit identities. Additionally, since GANs models do not account for physiological constraints for generating human faces and their impact on human IRISes, distinguishing genuine from synthetic IRISes in the PS scenario becomes extremely difficult. As a result of the lack of large-scale reference IRIS datasets in the PS scenario, we aim at developing a novel dataset to become a standard for Multimedia Forensics (MFs) investigation which is available at [45]. In this paper, we provide a novel dataset made up of a large number of synthetic and natural printed IRISes taken from VIPPrint Printed and Scanned face images. We extracted irises from face images and it is possible that the model due to eyelid occlusion captured the incomplete irises. To fill the missing pixels of extracted iris, we applied techniques to discover the complex link between the iris images. To highlight the problems involved with the evaluation of the dataset's IRIS images, we conducted a large number of analyses employing Siamese Neural Networks to assess the similarities between genuine and synthetic human IRISes, such as ResNet50, Xception, VGG16, and MobileNet-v2. For instance, using the Xception network, we achieved 56.76\\% similarity of IRISes for synthetic images and 92.77% similarity of IRISes for real images.","creator":"Ehsan Nowroozi, Yoosef Habibi, Mauro Conti"},{"title":"Revisiting Dense Retrieval with Unanswerable Counterfactuals.","link":"http://arxiv.org/abs/2304.03031","abstract":"The retriever-reader framework is popular for open-domain question answering (ODQA), where a retriever samples for the reader a set of relevant candidate passages from a large corpus. A key assumption behind this method is that high relevance scores from the retriever likely indicate high answerability from the reader, which implies a high probability that the retrieved passages contain answers to a given question. In this work, we empirically dispel this belief and observe that recent dense retrieval models based on DPR often rank unanswerable counterfactual passages higher than their answerable original passages. To address such answer-unawareness in dense retrievers, we seek to use counterfactual samples as additional training resources to better synchronize the relevance measurement of DPR with the answerability of question-passage pairs. Specifically, we present counterfactually-Pivoting Contrastive Learning (PiCL), a novel representation learning approach for passage retrieval that leverages counterfactual samples as pivots between positive and negative samples in their learned embedding space. We incorporate PiCL into the retriever training to show the effectiveness of PiCL on ODQA benchmarks and the robustness of the learned models.","creator":"Yongho Song, Dahyun Lee, Kyungjae Lee, Jinyeong Yeo"},{"title":"Almost optimal manipulation of a pair of alternatives.","link":"http://arxiv.org/abs/2304.03060","abstract":"The role of an expert in the decision-making process is crucial, as the final recommendation depends on his disposition, clarity of mind, experience, and knowledge of the problem. However, the recommendation also depends on their honesty. But what if the expert is dishonest? Then, the answer on how difficult it is to manipulate in a given case becomes essential. In the presented work, we consider manipulation of a ranking obtained by comparing alternatives in pairs. More specifically, we propose an algorithm for finding an almost optimal way to swap the positions of two selected alternatives. Thanks to this, it is possible to determine how difficult such manipulation is in a given case. Theoretical considerations are illustrated by a practical example.","creator":"Jacek Szybowski, Konrad Ku&#x142;akowski, Sebastian Ernst"},{"title":"An experimental study in Real-time Facial Emotion Recognition on new 3RL dataset.","link":"http://arxiv.org/abs/2304.03064","abstract":"Although real-time facial emotion recognition is a hot topic research domain in the field of human-computer interaction, state-of the-art available datasets still suffer from various problems, such as some unrelated photos such as document photos, unbalanced numbers of photos in each class, and misleading images that can negatively affect correct classification. The 3RL dataset was created, which contains approximately 24K images and will be publicly available, to overcome previously available dataset problems. The 3RL dataset is labelled with five basic emotions: happiness, fear, sadness, disgust, and anger. Moreover, we compared the 3RL dataset with other famous state-of-the-art datasets (FER dataset, CK+ dataset), and we applied the most commonly used algorithms in previous works, SVM and CNN. The results show a noticeable improvement in generalization on the 3RL dataset. Experiments have shown an accuracy of up to 91.4% on 3RL dataset using CNN where results on FER2013, CK+ are, respectively (approximately from 60% to 85%).","creator":"Rahmeh Abou Zafra, Lana Ahmad Abdullah, Rouaa Alaraj, Rasha Albezreh, Tarek Barhoum, Khloud Al Jallad"},{"title":"Data-driven HVAC Control Using Symbolic Regression: Design and Implementation.","link":"http://arxiv.org/abs/2304.03078","abstract":"The large amount of data collected in buildings makes energy management smarter and more energy efficient. This study proposes a design and implementation methodology of data-driven heating, ventilation, and air conditioning (HVAC) control. Building thermodynamics is modeled using a symbolic regression model (SRM) built from the collected data. Additionally, an HVAC system model is also developed with a data-driven approach. A model predictive control (MPC) based HVAC scheduling is formulated with the developed models to minimize energy consumption and peak power demand and maximize thermal comfort. The performance of the proposed framework is demonstrated in the workspace in the actual campus building. The HVAC system using the proposed framework reduces the peak power by 16.1\\% compared to the widely used thermostat controller.","creator":"Yuki Ozawa, Dafang Zhao, Daichi Watari, Ittetsu Taniguchi, Toshihiro Suzuki, Yoshiyuki Shimoda, Takao Onoye"},{"title":"Safe MDP Planning by Learning Temporal Patterns of Undesirable Trajectories and Averting Negative Side Effects.","link":"http://arxiv.org/abs/2304.03081","abstract":"In safe MDP planning, a cost function based on the current state and action is often used to specify safety aspects. In the real world, often the state representation used may lack sufficient fidelity to specify such safety constraints. Operating based on an incomplete model can often produce unintended negative side effects (NSEs). To address these challenges, first, we associate safety signals with state-action trajectories (rather than just an immediate state-action). This makes our safety model highly general. We also assume categorical safety labels are given for different trajectories, rather than a numerical cost function, which is harder to specify by the problem designer. We then employ a supervised learning model to learn such non-Markovian safety patterns. Second, we develop a Lagrange multiplier method, which incorporates the safety model and the underlying MDP model in a single computation graph to facilitate agent learning of safe behaviors. Finally, our empirical results on a variety of discrete and continuous domains show that this approach can satisfy complex non-Markovian safety constraints while optimizing an agent's total returns, is highly scalable, and is also better than the previous best approach for Markovian NSEs.","creator":"Siow Meng Low, Akshat Kumar, Scott Sanner"},{"title":"ChatGPT for Shaping the Future of Dentistry: The Potential of Multi-Modal Large Language Model.","link":"http://arxiv.org/abs/2304.03086","abstract":"The ChatGPT, as a lite and conversational variant of Generative Pretrained Transformer 4 (GPT-4) developed by OpenAI, is one of the milestone Large Language Models (LLMs) with billions of parameters. LLMs, in fact, have stirred up a lot of interest among researchers and practitioners by their impressive skills in natural language processing tasks, which have a profound impact on a wide range of fields. This paper mainly discusses the future applications of LLMs in dentistry. We introduce two primary LLM deployment methods in dentistry, including automated dental diagnosis and cross-modal dental diagnosis, and examine their potential applications. Especially, equipped with a cross-modal encoder, a single LLM can manage multi-source data and conduct advanced natural language reasoning to perform complex clinical operations. A use case is presented to demonstrate the potential of a fully automatic Multi-Modal LLM AI system for dentistry clinical application. While LLMs offer significant potential benefits, the challenges, such as data privacy, data quality, and model bias, need further study. Overall, LLMs have the potential to revolutionize dental diagnosis and treatment, which indicates a promising avenue for clinical application and research in dentistry.","creator":"Hanyao Huang, Ou Zheng, Dongdong Wang, Jiayi Yin, Zijin Wang, Shengxuan Ding, Heng Yin, Chuan Xu, Renjie Yang, Qian Zheng, Bing Shi"},{"title":"Retention Is All You Need.","link":"http://arxiv.org/abs/2304.03103","abstract":"Skilled employees are usually seen as the most important pillar of an organization. Despite this, most organizations face high attrition and turnover rates. While several machine learning models have been developed for analyzing attrition and its causal factors, the interpretations of those models remain opaque. In this paper, we propose the HR-DSS approach, which stands for Human Resource Decision Support System, and uses explainable AI for employee attrition problems. The system is designed to assist human resource departments in interpreting the predictions provided by machine learning models. In our experiments, eight machine learning models are employed to provide predictions, and the results achieved by the best-performing model are further processed by the SHAP explainability process. We optimize both the correctness and explanation of the results. Furthermore, using \"What-if-analysis\", we aim to observe plausible causes for attrition of an individual employee. The results show that by adjusting the specific dominant features of each individual, employee attrition can turn into employee retention through informative business decisions. Reducing attrition is not only a problem for any specific organization but also, in some countries, becomes a significant societal problem that impacts the well-being of both employers and employees.","creator":"Karishma Mohiuddin, Mirza Ariful Alam, Mirza Mohtashim Alam, Pascal Welke, Michael Martin, Jens Lehmann, Sahar Vahdati"},{"title":"Is it conceivable that neurogenesis, neural Darwinism, and species evolution could all serve as inspiration for the creation of evolutionary deep neural networks?.","link":"http://arxiv.org/abs/2304.03122","abstract":"Deep Neural Networks (DNNs) are built using artificial neural networks. They are part of machine learning methods that are capable of learning from data that have been used in a wide range of applications. DNNs are mainly handcrafted and they usually contain numerous layers. Research frontier has emerged that concerns automated construction of DNNs via evolutionary algorithms. This paper emphasizes the importance of what we call two-dimensional brain evolution and how it can inspire two dimensional DNN evolutionary modeling. We also highlight the connection between the dropout method which is widely-used in regularizing DNNs and neurogenesis of the brain, and how these concepts could benefit DNNs evolution.The paper concludes with several recommendations for enhancing the automatic construction of DNNs.","creator":"Mohammed Al-Rawi"},{"title":"VLPD: Context-Aware Pedestrian Detection via Vision-Language Semantic Self-Supervision.","link":"http://arxiv.org/abs/2304.03135","abstract":"Detecting pedestrians accurately in urban scenes is significant for realistic applications like autonomous driving or video surveillance. However, confusing human-like objects often lead to wrong detections, and small scale or heavily occluded pedestrians are easily missed due to their unusual appearances. To address these challenges, only object regions are inadequate, thus how to fully utilize more explicit and semantic contexts becomes a key problem. Meanwhile, previous context-aware pedestrian detectors either only learn latent contexts with visual clues, or need laborious annotations to obtain explicit and semantic contexts. Therefore, we propose in this paper a novel approach via Vision-Language semantic self-supervision for context-aware Pedestrian Detection (VLPD) to model explicitly semantic contexts without any extra annotations. Firstly, we propose a self-supervised Vision-Language Semantic (VLS) segmentation method, which learns both fully-supervised pedestrian detection and contextual segmentation via self-generated explicit labels of semantic classes by vision-language models. Furthermore, a self-supervised Prototypical Semantic Contrastive (PSC) learning method is proposed to better discriminate pedestrians and other classes, based on more explicit and semantic contexts obtained from VLS. Extensive experiments on popular benchmarks show that our proposed VLPD achieves superior performances over the previous state-of-the-arts, particularly under challenging circumstances like small scale and heavy occlusion. Code is available at https://github.com/lmy98129/VLPD.","creator":"Mengyin Liu, Jie Jiang, Chao Zhu, Xu-Cheng Yin"},{"title":"BotTriNet: A Unified and Efficient Embedding for Social Bots Detection via Metric Learning.","link":"http://arxiv.org/abs/2304.03144","abstract":"A persistently popular topic in online social networks is the rapid and accurate discovery of bot accounts to prevent their invasion and harassment of genuine users. We propose a unified embedding framework called BOTTRINET, which utilizes textual content posted by accounts for bot detection based on the assumption that contexts naturally reveal account personalities and habits. Content is abundant and valuable if the system efficiently extracts bot-related information using embedding techniques. Beyond the general embedding framework that generates word, sentence, and account embeddings, we design a triplet network to tune the raw embeddings (produced by traditional natural language processing techniques) for better classification performance. We evaluate detection accuracy and f1score on a real-world dataset CRESCI2017, comprising three bot account categories and five bot sample sets. Our system achieves the highest average accuracy of 98.34% and f1score of 97.99% on two content-intensive bot sets, outperforming previous work and becoming state-of-the-art. It also makes a breakthrough on four content-less bot sets, with an average accuracy improvement of 11.52% and an average f1score increase of 16.70%.","creator":"Jun Wu, Xuesong Ye, Man Yan Yuet"},{"title":"Improving Visual Question Answering Models through Robustness Analysis and In-Context Learning with a Chain of Basic Questions.","link":"http://arxiv.org/abs/2304.03147","abstract":"Deep neural networks have been critical in the task of Visual Question Answering (VQA), with research traditionally focused on improving model accuracy. Recently, however, there has been a trend towards evaluating the robustness of these models against adversarial attacks. This involves assessing the accuracy of VQA models under increasing levels of noise in the input, which can target either the image or the proposed query question, dubbed the main question. However, there is currently a lack of proper analysis of this aspect of VQA. This work proposes a new method that utilizes semantically related questions, referred to as basic questions, acting as noise to evaluate the robustness of VQA models. It is hypothesized that as the similarity of a basic question to the main question decreases, the level of noise increases. To generate a reasonable noise level for a given main question, a pool of basic questions is ranked based on their similarity to the main question, and this ranking problem is cast as a LASSO optimization problem. Additionally, this work proposes a novel robustness measure, R_score, and two basic question datasets to standardize the analysis of VQA model robustness. The experimental results demonstrate that the proposed evaluation method effectively analyzes the robustness of VQA models. Moreover, the experiments show that in-context learning with a chain of basic questions can enhance model accuracy.","creator":"Jia-Hong Huang, Modar Alfadly, Bernard Ghanem, Marcel Worring"},{"title":"CoT-MAE v2: Contextual Masked Auto-Encoder with Multi-view Modeling for Passage Retrieval.","link":"http://arxiv.org/abs/2304.03158","abstract":"Growing techniques have been emerging to improve the performance of passage retrieval. As an effective representation bottleneck pretraining technique, the contextual masked auto-encoder utilizes contextual embedding to assist in the reconstruction of passages. However, it only uses a single auto-encoding pre-task for dense representation pre-training. This study brings multi-view modeling to the contextual masked auto-encoder. Firstly, multi-view representation utilizes both dense and sparse vectors as multi-view representations, aiming to capture sentence semantics from different aspects. Moreover, multiview decoding paradigm utilizes both autoencoding and auto-regressive decoders in representation bottleneck pre-training, aiming to provide both reconstructive and generative signals for better contextual representation pretraining. We refer to this multi-view pretraining method as CoT-MAE v2. Through extensive experiments, we show that CoT-MAE v2 is effective and robust on large-scale passage retrieval benchmarks and out-of-domain zero-shot benchmarks.","creator":"Xing Wu, Guangyuan Ma, Peng Wang, Meng Lin, Zijia Lin, Fuzheng Zhang, Songlin Hu"},{"title":"HOTGP -- Higher-Order Typed Genetic Programming.","link":"http://arxiv.org/abs/2304.03200","abstract":"Program synthesis is the process of generating a computer program following a set of specifications, which can be a high-level description of the problem and/or a set of input-output examples. The synthesis can be modeled as a search problem in which the search space is the set of all the programs valid under a grammar. As the search space is vast, brute force is usually not viable and search heuristics, such as genetic programming, also have difficulty navigating it without any guidance. In this paper we present HOTGP, a new genetic programming algorithm that synthesizes pure, typed, and functional programs. HOTGP leverages the knowledge provided by the rich data-types associated with the specification and the built-in grammar to constrain the search space and improve the performance of the synthesis. The grammar is based on Haskell's standard base library (the synthesized code can be directly compiled using any standard Haskell compiler) and includes support for higher-order functions, $\\lambda$-functions, and parametric polymorphism. Experimental results show that, when compared to $6$ state-of-the-art algorithms using a standard set of benchmarks, HOTGP is competitive and capable of synthesizing the correct programs more frequently than any other of the evaluated algorithms.","creator":"Matheus Campos Fernandes, Fabr&#xed;cio Olivetti de Fran&#xe7;a, Emilio Francesquini"},{"title":"Implicit Anatomical Rendering for Medical Image Segmentation with Stochastic Experts.","link":"http://arxiv.org/abs/2304.03209","abstract":"Integrating high-level semantically correlated contents and low-level anatomical features is of central importance in medical image segmentation. Towards this end, recent deep learning-based medical segmentation methods have shown great promise in better modeling such information. However, convolution operators for medical segmentation typically operate on regular grids, which inherently blur the high-frequency regions, i.e., boundary regions. In this work, we propose MORSE, a generic implicit neural rendering framework designed at an anatomical level to assist learning in medical image segmentation. Our method is motivated by the fact that implicit neural representation has been shown to be more effective in fitting complex signals and solving computer graphics problems than discrete grid-based representation. The core of our approach is to formulate medical image segmentation as a rendering problem in an end-to-end manner. Specifically, we continuously align the coarse segmentation prediction with the ambiguous coordinate-based point representations and aggregate these features to adaptively refine the boundary region. To parallelly optimize multi-scale pixel-level features, we leverage the idea from Mixture-of-Expert (MoE) to design and train our MORSE with a stochastic gating mechanism. Our experiments demonstrate that MORSE can work well with different medical segmentation backbones, consistently achieving competitive performance improvements in both 2D and 3D supervised medical segmentation methods. We also theoretically analyze the superiority of MORSE.","creator":"Chenyu You, Weicheng Dai, Yifei Min, Lawrence Staib, James S. Duncan"},{"title":"Hierarchical Graph Neural Network with Cross-Attention for Cross-Device User Matching.","link":"http://arxiv.org/abs/2304.03215","abstract":"Cross-device user matching is a critical problem in numerous domains, including advertising, recommender systems, and cybersecurity. It involves identifying and linking different devices belonging to the same person, utilizing sequence logs. Previous data mining techniques have struggled to address the long-range dependencies and higher-order connections between the logs. Recently, researchers have modeled this problem as a graph problem and proposed a two-tier graph contextual embedding (TGCE) neural network architecture, which outperforms previous methods. In this paper, we propose a novel hierarchical graph neural network architecture (HGNN), which has a more computationally efficient second level design than TGCE. Furthermore, we introduce a cross-attention (Cross-Att) mechanism in our model, which improves performance by 5% compared to the state-of-the-art TGCE method.","creator":"Ali Taghibakhshi, Mingyuan Ma, Ashwath Aithal, Onur Yilmaz, Haggai Maron, Matthew West"},{"title":"On the Pareto Front of Multilingual Neural Machine Translation.","link":"http://arxiv.org/abs/2304.03216","abstract":"In this work, we study how the generalization performance of a given direction changes with its sampling ratio in Multilingual Neural Machine Translation (MNMT). By training over 200 multilingual models with various model sizes, directions, and total numbers of tasks, we find that scalarization leads to a multitask trade-off front that deviates from the traditional Pareto front when there exists data imbalance in the training corpus. That is, the performance of certain translation directions does not improve with the increase of its weight in the multi-task optimization objective, which poses greater challenge to improve the overall performance of all directions. Based on our observations, we propose the Double Power Law to predict the unique performance trade-off front in MNMT, which is robust across various languages, data adequacy and number of tasks. Finally, we formulate sample ratio selection in MNMT as an optimization problem based on the Double Power Law, which achieves better performance than temperature searching and gradient manipulation methods using up to half of the total training budget in our experiments.","creator":"Liang Chen, Shuming Ma, Dongdong Zhang, Furu Wei, Baobao Chang"},{"title":"Anomaly Detection via Gumbel Noise Score Matching.","link":"http://arxiv.org/abs/2304.03220","abstract":"We propose Gumbel Noise Score Matching (GNSM), a novel unsupervised method to detect anomalies in categorical data. GNSM accomplishes this by estimating the scores, i.e. the gradients of log likelihoods w.r.t.~inputs, of continuously relaxed categorical distributions. We test our method on a suite of anomaly detection tabular datasets. GNSM achieves a consistently high performance across all experiments. We further demonstrate the flexibility of GNSM by applying it to image data where the model is tasked to detect poor segmentation predictions. Images ranked anomalous by GNSM show clear segmentation failures, with the outputs of GNSM strongly correlating with segmentation metrics computed on ground-truth. We outline the score matching training objective utilized by GNSM and provide an open-source implementation of our work.","creator":"Ahsan Mahmood, Junier Oliva, Martin Styner"},{"title":"DexDeform: Dexterous Deformable Object Manipulation with Human Demonstrations and Differentiable Physics.","link":"http://arxiv.org/abs/2304.03223","abstract":"In this work, we aim to learn dexterous manipulation of deformable objects using multi-fingered hands. Reinforcement learning approaches for dexterous rigid object manipulation would struggle in this setting due to the complexity of physics interaction with deformable objects. At the same time, previous trajectory optimization approaches with differentiable physics for deformable manipulation would suffer from local optima caused by the explosion of contact modes from hand-object interactions. To address these challenges, we propose DexDeform, a principled framework that abstracts dexterous manipulation skills from human demonstration and refines the learned skills with differentiable physics. Concretely, we first collect a small set of human demonstrations using teleoperation. And we then train a skill model using demonstrations for planning over action abstractions in imagination. To explore the goal space, we further apply augmentations to the existing deformable shapes in demonstrations and use a gradient optimizer to refine the actions planned by the skill model. Finally, we adopt the refined trajectories as new demonstrations for finetuning the skill model. To evaluate the effectiveness of our approach, we introduce a suite of six challenging dexterous deformable object manipulation tasks. Compared with baselines, DexDeform is able to better explore and generalize across novel goals unseen in the initial human demonstrations.","creator":"Sizhe Li, Zhiao Huang, Tao Chen, Tao Du, Hao Su, Joshua B. Tenenbaum, Chuang Gan"},{"title":"FedBot: Enhancing Privacy in Chatbots with Federated Learning.","link":"http://arxiv.org/abs/2304.03228","abstract":"Chatbots are mainly data-driven and usually based on utterances that might be sensitive. However, training deep learning models on shared data can violate user privacy. Such issues have commonly existed in chatbots since their inception. In the literature, there have been many approaches to deal with privacy, such as differential privacy and secure multi-party computation, but most of them need to have access to users' data. In this context, Federated Learning (FL) aims to protect data privacy through distributed learning methods that keep the data in its location. This paper presents Fedbot, a proof-of-concept (POC) privacy-preserving chatbot that leverages large-scale customer support data. The POC combines Deep Bidirectional Transformer models and federated learning algorithms to protect customer data privacy during collaborative model training. The results of the proof-of-concept showcase the potential for privacy-preserving chatbots to transform the customer support industry by delivering personalized and efficient customer service that meets data privacy regulations and legal requirements. Furthermore, the system is specifically designed to improve its performance and accuracy over time by leveraging its ability to learn from previous interactions.","creator":"Addi Ait-Mlouk, Sadi Alawadi, Salman Toor, Andreas Hellander"},{"title":"Synthetic Data in Healthcare.","link":"http://arxiv.org/abs/2304.03243","abstract":"Synthetic data are becoming a critical tool for building artificially intelligent systems. Simulators provide a way of generating data systematically and at scale. These data can then be used either exclusively, or in conjunction with real data, for training and testing systems. Synthetic data are particularly attractive in cases where the availability of ``real'' training examples might be a bottleneck. While the volume of data in healthcare is growing exponentially, creating datasets for novel tasks and/or that reflect a diverse set of conditions and causal relationships is not trivial. Furthermore, these data are highly sensitive and often patient specific. Recent research has begun to illustrate the potential for synthetic data in many areas of medicine, but no systematic review of the literature exists. In this paper, we present the cases for physical and statistical simulations for creating data and the proposed applications in healthcare and medicine. We discuss that while synthetics can promote privacy, equity, safety and continual and causal learning, they also run the risk of introducing flaws, blind spots and propagating or exaggerating biases.","creator":"Daniel McDuff, Theodore Curran, Achuta Kadambi"},{"title":"When do you need Chain-of-Thought Prompting for ChatGPT?.","link":"http://arxiv.org/abs/2304.03262","abstract":"Chain-of-Thought (CoT) prompting can effectively elicit complex multi-step reasoning from Large Language Models~(LLMs). For example, by simply adding CoT instruction ``Let's think step-by-step'' to each input query of MultiArith dataset, GPT-3's accuracy can be improved from 17.7\\% to 78.7\\%. However, it is not clear whether CoT is still effective on more recent instruction finetuned (IFT) LLMs such as ChatGPT. Surprisingly, on ChatGPT, CoT is no longer effective for certain tasks such as arithmetic reasoning while still keeping effective on other reasoning tasks. Moreover, on the former tasks, ChatGPT usually achieves the best performance and can generate CoT even without being instructed to do so. Hence, it is plausible that ChatGPT has already been trained on these tasks with CoT and thus memorized the instruction so it implicitly follows such an instruction when applied to the same queries, even without CoT. Our analysis reflects a potential risk of overfitting/bias toward instructions introduced in IFT, which becomes more common in training LLMs. In addition, it indicates possible leakage of the pretraining recipe, e.g., one can verify whether a dataset and instruction were used in training ChatGPT. Our experiments report new baseline results of ChatGPT on a variety of reasoning tasks and shed novel insights into LLM's profiling, instruction memorization, and pretraining dataset leakage.","creator":"Jiuhai Chen, Lichang Chen, Heng Huang, Tianyi Zhou"},{"title":"Making AI Less \"Thirsty\": Uncovering and Addressing the Secret Water Footprint of AI Models.","link":"http://arxiv.org/abs/2304.03271","abstract":"The growing carbon footprint of artificial intelligence (AI) models, especially large ones such as GPT-3 and GPT-4, has been undergoing public scrutiny. Unfortunately, however, the equally important and enormous water footprint of AI models has remained under the radar. For example, training GPT-3 in Microsoft's state-of-the-art U.S. data centers can directly consume 700,000 liters of clean freshwater (enough for producing 370 BMW cars or 320 Tesla electric vehicles) and the water consumption would have been tripled if training were done in Microsoft's Asian data centers, but such information has been kept as a secret. This is extremely concerning, as freshwater scarcity has become one of the most pressing challenges shared by all of us in the wake of the rapidly growing population, depleting water resources, and aging water infrastructures. To respond to the global water challenges, AI models can, and also should, take social responsibility and lead by example by addressing their own water footprint. In this paper, we provide a principled methodology to estimate fine-grained water footprint of AI models, and also discuss the unique spatial-temporal diversities of AI models' runtime water efficiency. Finally, we highlight the necessity of holistically addressing water footprint along with carbon footprint to enable truly sustainable AI.","creator":"Pengfei Li, Jianyi Yang, Mohammad A. Islam, Shaolei Ren"},{"title":"DiffMimic: Efficient Motion Mimicking with Differentiable Physics.","link":"http://arxiv.org/abs/2304.03274","abstract":"Motion mimicking is a foundational task in physics-based character animation. However, most existing motion mimicking methods are built upon reinforcement learning (RL) and suffer from heavy reward engineering, high variance, and slow convergence with hard explorations. Specifically, they usually take tens of hours or even days of training to mimic a simple motion sequence, resulting in poor scalability. In this work, we leverage differentiable physics simulators (DPS) and propose an efficient motion mimicking method dubbed DiffMimic. Our key insight is that DPS casts a complex policy learning task to a much simpler state matching problem. In particular, DPS learns a stable policy by analytical gradients with ground-truth physical priors hence leading to significantly faster and stabler convergence than RL-based methods. Moreover, to escape from local optima, we utilize a Demonstration Replay mechanism to enable stable gradient backpropagation in a long horizon. Extensive experiments on standard benchmarks show that DiffMimic has a better sample efficiency and time efficiency than existing methods (e.g., DeepMimic). Notably, DiffMimic allows a physically simulated character to learn Backflip after 10 minutes of training and be able to cycle it after 3 hours of training, while the existing approach may require about a day of training to cycle Backflip. More importantly, we hope DiffMimic can benefit more differentiable animation systems with techniques like differentiable clothes simulation in future research.","creator":"Jiawei Ren, Cunjun Yu, Siwei Chen, Xiao Ma, Liang Pan, Ziwei Liu"},{"title":"Instruction Tuning with GPT-4.","link":"http://arxiv.org/abs/2304.03277","abstract":"Prior work has shown that finetuning large language models (LLMs) using machine-generated instruction-following data enables such models to achieve remarkable zero-shot capabilities on new tasks, and no human-written instructions are needed. In this paper, we present the first attempt to use GPT-4 to generate instruction-following data for LLM finetuning. Our early experiments on instruction-tuned LLaMA models show that the 52K English and Chinese instruction-following data generated by GPT-4 leads to superior zero-shot performance on new tasks to the instruction-following data generated by previous state-of-the-art models. We also collect feedback and comparison data from GPT-4 to enable a comprehensive evaluation and reward model training. We make our data generated using GPT-4 as well as our codebase publicly available.","creator":"Baolin Peng, Chunyuan Li, Pengcheng He, Michel Galley, Jianfeng Gao"},{"title":"Do the Rewards Justify the Means? Measuring Trade-Offs Between Rewards and Ethical Behavior in the MACHIAVELLI Benchmark.","link":"http://arxiv.org/abs/2304.03279","abstract":"Artificial agents have traditionally been trained to maximize reward, which may incentivize power-seeking and deception, analogous to how next-token prediction in language models (LMs) may incentivize toxicity. So do agents naturally learn to be Machiavellian? And how do we measure these behaviors in general-purpose models such as GPT-4? Towards answering these questions, we introduce MACHIAVELLI, a benchmark of 134 Choose-Your-Own-Adventure games containing over half a million rich, diverse scenarios that center on social decision-making. Scenario labeling is automated with LMs, which are more performant than human annotators. We mathematize dozens of harmful behaviors and use our annotations to evaluate agents' tendencies to be power-seeking, cause disutility, and commit ethical violations. We observe some tension between maximizing reward and behaving ethically. To improve this trade-off, we investigate LM-based methods to steer agents' towards less harmful behaviors. Our results show that agents can both act competently and morally, so concrete progress can currently be made in machine ethics--designing agents that are Pareto improvements in both safety and capabilities.","creator":"Alexander Pan, Chan Jun Shern, Andy Zou, Nathaniel Li, Steven Basart, Thomas Woodside, Jonathan Ng, Hanlin Zhang, Scott Emmons, Dan Hendrycks"},{"title":"Road Network Guided Fine-Grained Urban Traffic Flow Inference.","link":"http://arxiv.org/abs/2109.14251","abstract":"Accurate inference of fine-grained traffic flow from coarse-grained one is an emerging yet crucial problem, which can help greatly reduce the number of the required traffic monitoring sensors for cost savings. In this work, we notice that traffic flow has a high correlation with road network, which was either completely ignored or simply treated as an external factor in previous works.To facilitate this problem, we propose a novel Road-Aware Traffic Flow Magnifier (RATFM) that explicitly exploits the prior knowledge of road networks to fully learn the road-aware spatial distribution of fine-grained traffic flow. Specifically, a multi-directional 1D convolutional layer is first introduced to extract the semantic feature of the road network. Subsequently, we incorporate the road network feature and coarse-grained flow feature to regularize the short-range spatial distribution modeling of road-relative traffic flow. Furthermore, we take the road network feature as a query to capture the long-range spatial distribution of traffic flow with a transformer architecture. Benefiting from the road-aware inference mechanism, our method can generate high-quality fine-grained traffic flow maps. Extensive experiments on three real-world datasets show that the proposed RATFM outperforms state-of-the-art models under various scenarios. Our code and datasets are released at {\\url{https://github.com/luimoli/RATFM}}.","creator":"Lingbo Liu, Mengmeng Liu, Guanbin Li, Ziyi Wu, Junfan Lin, Liang Lin"},{"title":"Sparse*BERT: Sparse Models Generalize To New tasks and Domains.","link":"http://arxiv.org/abs/2205.12452","abstract":"Large Language Models have become the core architecture upon which most modern natural language processing (NLP) systems build. These models can consistently deliver impressive accuracy and robustness across tasks and domains, but their high computational overhead can make inference difficult and expensive. To make using these models less costly, recent work has explored leveraging structured and unstructured pruning, quantization, and distillation to improve inference speed and decrease size. This paper studies how models pruned using Gradual Unstructured Magnitude Pruning can transfer between domains and tasks. Our experimentation shows that models that are pruned during pretraining using general domain masked language models can transfer to novel domains and tasks without extensive hyperparameter exploration or specialized approaches. We demonstrate that our general sparse model Sparse*BERT can become SparseBioBERT simply by pretraining the compressed architecture on unstructured biomedical text. Moreover, we show that SparseBioBERT can match the quality of BioBERT with only 10\\% of the parameters.","creator":"Daniel Campos, Alexandre Marques, Tuan Nguyen, Mark Kurtz, ChengXiang Zhai"},{"title":"Fast and Precise: Adjusting Planning Horizon with Adaptive Subgoal Search.","link":"http://arxiv.org/abs/2206.00702","abstract":"Complex reasoning problems contain states that vary in the computational cost required to determine a good action plan. Taking advantage of this property, we propose Adaptive Subgoal Search (AdaSubS), a search method that adaptively adjusts the planning horizon. To this end, AdaSubS generates diverse sets of subgoals at different distances. A verification mechanism is employed to filter out unreachable subgoals swiftly, allowing to focus on feasible further subgoals. In this way, AdaSubS benefits from the efficiency of planning with longer subgoals and the fine control with the shorter ones, and thus scales well to difficult planning problems. We show that AdaSubS significantly surpasses hierarchical planning algorithms on three complex reasoning tasks: Sokoban, the Rubik's Cube, and inequality proving benchmark INT.","creator":"Micha&#x142; Zawalski, Micha&#x142; Tyrolski, Konrad Czechowski, Tomasz Odrzyg&#xf3;&#x17a;d&#x17a;, Damian Stachura, Piotr Pi&#x119;kos, Yuhuai Wu, &#x141;ukasz Kuci&#x144;ski, Piotr Mi&#x142;o&#x15b;"},{"title":"Personalized Showcases: Generating Multi-Modal Explanations for Recommendations.","link":"http://arxiv.org/abs/2207.00422","abstract":"Existing explanation models generate only text for recommendations but still struggle to produce diverse contents. In this paper, to further enrich explanations, we propose a new task named personalized showcases, in which we provide both textual and visual information to explain our recommendations. Specifically, we first select a personalized image set that is the most relevant to a user's interest toward a recommended item. Then, natural language explanations are generated accordingly given our selected images. For this new task, we collect a large-scale dataset from Google Local (i.e.,~maps) and construct a high-quality subset for generating multi-modal explanations. We propose a personalized multi-modal framework which can generate diverse and visually-aligned explanations via contrastive learning. Experiments show that our framework benefits from different modalities as inputs, and is able to produce more diverse and expressive explanations compared to previous methods on a variety of evaluation metrics.","creator":"An Yan, Zhankui He, Jiacheng Li, Tianyang Zhang, Julian McAuley"},{"title":"Sound and Relatively Complete Belief Hoare Logic for Statistical Hypothesis Testing Programs.","link":"http://arxiv.org/abs/2208.07074","abstract":"We propose a new approach to formally describing the requirement for statistical inference and checking whether a program uses the statistical method appropriately. Specifically, we define belief Hoare logic (BHL) for formalizing and reasoning about the statistical beliefs acquired via hypothesis testing. This program logic is sound and relatively complete with respect to a Kripke model for hypothesis tests. We demonstrate by examples that BHL is useful for reasoning about practical issues in hypothesis testing. In our framework, we clarify the importance of prior beliefs in acquiring statistical beliefs through hypothesis testing, and discuss the whole picture of the justification of statistical inference inside and outside the program logic.","creator":"Yusuke Kawamoto, Tetsuya Sato, Kohei Suenaga"},{"title":"Real2Sim2Real Transfer for Control of Cable-driven Robots via a Differentiable Physics Engine.","link":"http://arxiv.org/abs/2209.06261","abstract":"Tensegrity robots, composed of rigid rods and flexible cables, exhibit high strength-to-weight ratios and significant deformations, which enable them to navigate unstructured terrains and survive harsh impacts. They are hard to control, however, due to high dimensionality, complex dynamics, and a coupled architecture. Physics-based simulation is a promising avenue for developing locomotion policies that can be transferred to real robots. Nevertheless, modeling tensegrity robots is a complex task due to a substantial sim2real gap. To address this issue, this paper describes a Real2Sim2Real (R2S2R) strategy for tensegrity robots. This strategy is based on a differentiable physics engine that can be trained given limited data from a real robot. These data include offline measurements of physical properties, such as mass and geometry for various robot components, and the observation of a trajectory using a random control policy. With the data from the real robot, the engine can be iteratively refined and used to discover locomotion policies that are directly transferable to the real robot. Beyond the R2S2R pipeline, key contributions of this work include computing non-zero gradients at contact points, a loss function for matching tensegrity locomotion gaits, and a trajectory segmentation technique that avoids conflicts in gradient evaluation during training. Multiple iterations of the R2S2R process are demonstrated and evaluated on a real 3-bar tensegrity robot.","creator":"Kun Wang, William R. Johnson III, Shiyang Lu, Xiaonan Huang, Joran Booth, Rebecca Kramer-Bottiglio, Mridul Aanjaneya, Kostas Bekris"},{"title":"Non-contrastive representation learning for intervals from well logs.","link":"http://arxiv.org/abs/2209.14750","abstract":"The representation learning problem in the oil &amp; gas industry aims to construct a model that provides a representation based on logging data for a well interval. Previous attempts are mainly supervised and focus on similarity task, which estimates closeness between intervals. We desire to build informative representations without using supervised (labelled) data. One of the possible approaches is self-supervised learning (SSL). In contrast to the supervised paradigm, this one requires little or no labels for the data. Nowadays, most SSL approaches are either contrastive or non-contrastive. Contrastive methods make representations of similar (positive) objects closer and distancing different (negative) ones. Due to possible wrong marking of positive and negative pairs, these methods can provide an inferior performance. Non-contrastive methods don't rely on such labelling and are widespread in computer vision. They learn using only pairs of similar objects that are easier to identify in logging data.  We are the first to introduce non-contrastive SSL for well-logging data. In particular, we exploit Bootstrap Your Own Latent (BYOL) and Barlow Twins methods that avoid using negative pairs and focus only on matching positive pairs. The crucial part of these methods is an augmentation strategy. Our augmentation strategies and adaption of BYOL and Barlow Twins together allow us to achieve superior quality on clusterization and mostly the best performance on different classification tasks. Our results prove the usefulness of the proposed non-contrastive self-supervised approaches for representation learning and interval similarity in particular.","creator":"Alexander Marusov, Alexey Zaytsev"},{"title":"RITA: Boost Autonomous Driving Simulators with Realistic Interactive Traffic Flow.","link":"http://arxiv.org/abs/2211.03408","abstract":"High-quality traffic flow generation is the core module in building simulators for autonomous driving. However, the majority of available simulators are incapable of replicating traffic patterns that accurately reflect the various features of real-world data while also simulating human-like reactive responses to the tested autopilot driving strategies. Taking one step forward to addressing such a problem, we propose Realistic Interactive TrAffic flow (RITA) as an integrated component of existing driving simulators to provide high-quality traffic flow for the evaluation and optimization of the tested driving strategies. RITA is developed with consideration of three key features, i.e., fidelity, diversity, and controllability, and consists of two core modules called RITABackend and RITAKit. RITABackend is built to support vehicle-wise control and provide traffic generation models from real-world datasets, while RITAKit is developed with easy-to-use interfaces for controllable traffic generation via RITABackend. We demonstrate RITA's capacity to create diversified and high-fidelity traffic simulations in several highly interactive highway scenarios. The experimental findings demonstrate that our produced RITA traffic flows exhibit all three key features, hence enhancing the completeness of driving strategy evaluation. Moreover, we showcase the possibility for further improvement of baseline strategies through online fine-tuning with RITA traffic flows.","creator":"Zhengbang Zhu, Shenyu Zhang, Yuzheng Zhuang, Yuecheng Liu, Minghuan Liu, Liyuan Mao, Ziqing Gong, Weinan Zhang, Shixiong Kai, Qiang Gu, Bin Wang, Siyuan Cheng, Xinyu Wang, Jianye Hao, Yong Yu"},{"title":"Denoising diffusion probabilistic models for probabilistic energy forecasting.","link":"http://arxiv.org/abs/2212.02977","abstract":"Scenario-based probabilistic forecasts have become vital for decision-makers in handling intermittent renewable energies. This paper presents a recent promising deep learning generative approach called denoising diffusion probabilistic models. It is a class of latent variable models which have recently demonstrated impressive results in the computer vision community. However, to our knowledge, there has yet to be a demonstration that they can generate high-quality samples of load, PV, or wind power time series, crucial elements to face the new challenges in power systems applications. Thus, we propose the first implementation of this model for energy forecasting using the open data of the Global Energy Forecasting Competition 2014. The results demonstrate this approach is competitive with other state-of-the-art deep learning generative models, including generative adversarial networks, variational autoencoders, and normalizing flows.","creator":"Esteban Hernandez Capel, Jonathan Dumas"},{"title":"Classifying Mental-Disorders through Clinicians Subjective Approach based on Three-way Decision.","link":"http://arxiv.org/abs/2301.03351","abstract":"In psychiatric diagnosis, a contemporary data-driven, manual-based method for mental disorders classification is the most popular technique; however, it has several inevitable flaws. Using the three-way decision as a framework, we propose a unified model that stands for clinicians' subjective approach (CSA) analysis consisting of three parts: quantitative analysis, quantitative analysis, and evaluation-based analysis. A ranking list and a set of numerical weights based on illness magnitude levels according to the clinician's greatest degree of assumptions are the findings of the qualitative and quantitative investigation. We further create a comparative classification of illnesses into three groups with varying important levels; a three-way evaluation-based model is utilized in this study for the aim of understanding and portraying these results in a more clear way. This proposed method might be integrated with the manual-based process as a complementary tool to improve precision while diagnosing mental disorders","creator":"Md Sakib Ullah Sourav, Huidong Wang, Mengdi Yang, Jiaping Zhang"},{"title":"Explaining wall-bounded turbulence through deep learning.","link":"http://arxiv.org/abs/2302.01250","abstract":"Despite its great scientific and technological importance, wall-bounded turbulence is an unresolved problem that requires new perspectives to be tackled. One of the key strategies has been to study interactions among the coherent structures in the flow. Such interactions are explored in this study for the first time using an explainable deep-learning method. The instantaneous velocity field in a turbulent channel is used to predict the velocity field in time through a convolutional neural network. Based on the predicted flow, we assess the importance of each structure for this prediction using the game-theoretic algorithm of SHapley Additive exPlanations (SHAP). This work provides results in agreement with previous observations in the literature and extends them by quantifying the importance of the Reynolds-stress structures, finding a connection between these structures and the dynamics of the flow. The process, based on deep-learning explainability, has the potential to shed light on numerous fundamental phenomena of wall-bounded turbulence, including the objective definition of new types of flow structures.","creator":"Andres Cremades, Sergio Hoyas, Pedro Quintero, Martin Lellep, Moritz Linkmann, Ricardo Vinuesa"},{"title":"Perfect is the enemy of test oracle.","link":"http://arxiv.org/abs/2302.01488","abstract":"Automation of test oracles is one of the most challenging facets of software testing, but remains comparatively less addressed compared to automated test input generation. Test oracles rely on a ground-truth that can distinguish between the correct and buggy behavior to determine whether a test fails (detects a bug) or passes. What makes the oracle problem challenging and undecidable is the assumption that the ground-truth should know the exact expected, correct, or buggy behavior. However, we argue that one can still build an accurate oracle without knowing the exact correct or buggy behavior, but how these two might differ. This paper presents SEER, a learning-based approach that in the absence of test assertions or other types of oracle, can determine whether a unit test passes or fails on a given method under test (MUT). To build the ground-truth, SEER jointly embeds unit tests and the implementation of MUTs into a unified vector space, in such a way that the neural representation of tests are similar to that of MUTs they pass on them, but dissimilar to MUTs they fail on them. The classifier built on top of this vector representation serves as the oracle to generate \"fail\" labels, when test inputs detect a bug in MUT or \"pass\" labels, otherwise. Our extensive experiments on applying SEER to more than 5K unit tests from a diverse set of open-source Java projects show that the produced oracle is (1) effective in predicting the fail or pass labels, achieving an overall accuracy, precision, recall, and F1 measure of 93%, 86%, 94%, and 90%, (2) generalizable, predicting the labels for the unit test of projects that were not in training or validation set with negligible performance drop, and (3) efficient, detecting the existence of bugs in only 6.5 milliseconds on average.","creator":"Ali Reza Ibrahimzada, Yigit Varli, Dilara Tekinoglu, Reyhaneh Jabbarvand"},{"title":"Data Mesh: Motivational Factors, Challenges, and Best Practices.","link":"http://arxiv.org/abs/2302.01713","abstract":"With the increasing importance of data and artificial intelligence, organizations strive to become more data-driven. However, current data architectures are not necessarily designed to keep up with the scale and scope of data and analytics use cases. In fact, existing architectures often fail to deliver the promised value associated with them. Data mesh is a socio-technical concept that includes architectural aspects to promote data democratization and enables organizations to become truly data-driven. As the concept of data mesh is still novel, it lacks empirical insights from the field. Specifically, an understanding of the motivational factors for introducing data mesh, the associated challenges, best practices, its business impact, and potential archetypes, is missing. To address this gap, we conduct 15 semi-structured interviews with industry experts. Our results show, among other insights, that industry experts have difficulties with the transition toward federated governance associated with the data mesh concept, the shift of responsibility for the development, provision, and maintenance of data products, and the concept of a data product model. In our work, we derive multiple best practices and suggest organizations embrace elements of data fabric, observe the data product usage, create quick wins in the early phases, and favor small dedicated teams that prioritize data products. While we acknowledge that organizations need to apply best practices according to their individual needs, we also deduct two archetypes that provide suggestions in more detail. Our findings synthesize insights from industry experts and provide researchers and professionals with guidelines for the successful adoption of data mesh.","creator":"Jan Bode, Niklas K&#xfc;hl, Dominik Kreuzberger, Sebastian Hirschl, Carsten Holtmann"},{"title":"Friend Ranking in Online Games via Pre-training Edge Transformers.","link":"http://arxiv.org/abs/2302.10043","abstract":"Friend recall is an important way to improve Daily Active Users (DAU) in online games. The problem is to generate a proper lost friend ranking list essentially. Traditional friend recall methods focus on rules like friend intimacy or training a classifier for predicting lost players' return probability, but ignore feature information of (active) players and historical friend recall events. In this work, we treat friend recall as a link prediction problem and explore several link prediction methods which can use features of both active and lost players, as well as historical events. Furthermore, we propose a novel Edge Transformer model and pre-train the model via masked auto-encoders. Our method achieves state-of-the-art results in the offline experiments and online A/B Tests of three Tencent games.","creator":"Liang Yao, Jiazhen Peng, Shenggong Ji, Qiang Liu, Hongyun Cai, Feng He, Xu Cheng"},{"title":"Zero-Shot Cross-Lingual Summarization via Large Language Models.","link":"http://arxiv.org/abs/2302.14229","abstract":"Given a document in a source language, cross-lingual summarization (CLS) aims to generate a summary in a different target language. Recently, the emergence of Large Language Models (LLMs), such as GPT-3.5, ChatGPT and GPT-4, has attracted wide attention from the computational linguistics community. However, it is not yet known the performance of LLMs on CLS. In this report, we empirically use various prompts to guide LLMs to perform zero-shot CLS from different paradigms (i.e., end-to-end and pipeline), and provide a preliminary evaluation on the generated summaries. We find that ChatGPT and GPT-4 originally prefer to produce lengthy summaries with detailed information. These two LLMs can further balance informativeness and conciseness with the help of an interactive prompt, significantly improving their CLS performance. Experimental results on three widely-used CLS datasets show that GPT-4 achieves state-of-the-art zero-shot CLS performance, and performs competitively compared with the fine-tuned mBART-50. Moreover, we also find some multi-lingual and bilingual LLMs (i.e., BLOOMZ, ChatGLM-6B, Vicuna-13B and ChatYuan) have limited zero-shot CLS ability. Due to the composite nature of CLS, which requires models to perform summarization and translation simultaneously, accomplishing this task in a zero-shot manner is even a challenge for LLMs. Therefore, we sincerely hope and recommend future LLM research could use CLS as a testbed.","creator":"Jiaan Wang, Yunlong Liang, Fandong Meng, Beiqi Zou, Zhixu Li, Jianfeng Qu, Jie Zhou"},{"title":"AR3n: A Reinforcement Learning-based Assist-As-Needed Controller for Robotic Rehabilitation.","link":"http://arxiv.org/abs/2303.00085","abstract":"In this paper, we present AR3n (pronounced as Aaron), an assist-as-needed (AAN) controller that utilizes reinforcement learning to supply adaptive assistance during a robot assisted handwriting rehabilitation task. Unlike previous AAN controllers, our method does not rely on patient specific controller parameters or physical models. We propose the use of a virtual patient model to generalize AR3n across multiple subjects. The system modulates robotic assistance in realtime based on a subject's tracking error, while minimizing the amount of robotic assistance. The controller is experimentally validated through a set of simulations and human subject experiments. Finally, a comparative study with a traditional rule-based controller is conducted to analyze differences in assistance mechanisms of the two controllers.","creator":"Shrey Pareek, Harris NIsar, Thenkurussi Kesavadas"},{"title":"Semi-decentralized Inference in Heterogeneous Graph Neural Networks for Traffic Demand Forecasting: An Edge-Computing Approach.","link":"http://arxiv.org/abs/2303.00524","abstract":"Prediction of taxi service demand and supply is essential for improving customer's experience and provider's profit. Recently, graph neural networks (GNNs) have been shown promising for this application. This approach models city regions as nodes in a transportation graph and their relations as edges. GNNs utilize local node features and the graph structure in the prediction. However, more efficient forecasting can still be achieved by following two main routes; enlarging the scale of the transportation graph, and simultaneously exploiting different types of nodes and edges in the graphs. However, both approaches are challenged by the scalability of GNNs. An immediate remedy to the scalability challenge is to decentralize the GNN operation. However, this creates excessive node-to-node communication. In this paper, we first characterize the excessive communication needs for the decentralized GNN approach. Then, we propose a semi-decentralized approach utilizing multiple cloudlets, moderately sized storage and computation devices, that can be integrated with the cellular base stations. This approach minimizes inter-cloudlet communication thereby alleviating the communication overhead of the decentralized approach while promoting scalability due to cloudlet-level decentralization. Also, we propose a heterogeneous GNN-LSTM algorithm for improved taxi-level demand and supply forecasting for handling dynamic taxi graphs where nodes are taxis. Extensive experiments over real data show the advantage of the semi-decentralized approach as tested over our heterogeneous GNN-LSTM algorithm. Also, the proposed semi-decentralized GNN approach is shown to reduce the overall inference time by about an order of magnitude compared to centralized and decentralized inference schemes.","creator":"Mahmoud Nazzal, Abdallah Khreishah, Joyoung Lee, Shaahin Angizi, Ala Al-Fuqaha, Mohsen Guizani"},{"title":"Planning for Attacker Entrapment in Adversarial Settings.","link":"http://arxiv.org/abs/2303.00822","abstract":"In this paper, we propose a planning framework to generate a defense strategy against an attacker who is working in an environment where a defender can operate without the attacker's knowledge. The objective of the defender is to covertly guide the attacker to a trap state from which the attacker cannot achieve their goal. Further, the defender is constrained to achieve its goal within K number of steps, where K is calculated as a pessimistic lower bound within which the attacker is unlikely to suspect a threat in the environment. Such a defense strategy is highly useful in real world systems like honeypots or honeynets, where an unsuspecting attacker interacts with a simulated production system while assuming it is the actual production system. Typically, the interaction between an attacker and a defender is captured using game theoretic frameworks. Our problem formulation allows us to capture it as a much simpler infinite horizon discounted MDP, in which the optimal policy for the MDP gives the defender's strategy against the actions of the attacker. Through empirical evaluation, we show the merits of our problem formulation.","creator":"Brittany Cates, Anagha Kulkarni, Sarath Sreedharan"},{"title":"Time series anomaly detection with reconstruction-based state-space models.","link":"http://arxiv.org/abs/2303.03324","abstract":"Recent advances in digitization have led to the availability of multivariate time series data in various domains, enabling real-time monitoring of operations. Identifying abnormal data patterns and detecting potential failures in these scenarios are important yet rather challenging. In this work, we propose a novel unsupervised anomaly detection method for time series data. The proposed framework jointly learns the observation model and the dynamic model, and model uncertainty is estimated from normal samples. Specifically, a long short-term memory (LSTM)-based encoder-decoder is adopted to represent the mapping between the observation space and the latent space. Bidirectional transitions of states are simultaneously modeled by leveraging backward and forward temporal information. Regularization of the latent space places constraints on the states of normal samples, and Mahalanobis distance is used to evaluate the abnormality level. Empirical studies on synthetic and real-world datasets demonstrate the superior performance of the proposed method in anomaly detection tasks.","creator":"Fan Wang, Keli Wang, Boyu Yao"},{"title":"Agave crop segmentation and maturity classification with deep learning data-centric strategies using very high-resolution satellite imagery.","link":"http://arxiv.org/abs/2303.11564","abstract":"The responsible and sustainable agave-tequila production chain is fundamental for the social, environment and economic development of Mexico's agave regions. It is therefore relevant to develop new tools for large scale automatic agave region monitoring. In this work, we present an Agave tequilana Weber azul crop segmentation and maturity classification using very high resolution satellite imagery, which could be useful for this task. To achieve this, we solve real-world deep learning problems in the very specific context of agave crop segmentation such as lack of data, low quality labels, highly imbalanced data, and low model performance. The proposed strategies go beyond data augmentation and data transfer combining active learning and the creation of synthetic images with human supervision. As a result, the segmentation performance evaluated with Intersection over Union (IoU) value increased from 0.72 to 0.90 in the test set. We also propose a method for classifying agave crop maturity with 95% accuracy. With the resulting accurate models, agave production forecasting can be made available for large regions. In addition, some supply-demand problems such excessive supplies of agave or, deforestation, could be detected early.","creator":"Abraham S&#xe1;nchez, Ra&#xfa;l Nanclares, Alexander Quevedo, Ulises Pelagio, Alejandra Aguilar, Gabriela Calvario, E. Ulises Moya-S&#xe1;nchez"},{"title":"ViewRefer: Grasp the Multi-view Knowledge for 3D Visual Grounding with GPT and Prototype Guidance.","link":"http://arxiv.org/abs/2303.16894","abstract":"Understanding 3D scenes from multi-view inputs has been proven to alleviate the view discrepancy issue in 3D visual grounding. However, existing methods normally neglect the view cues embedded in the text modality and fail to weigh the relative importance of different views. In this paper, we propose ViewRefer, a multi-view framework for 3D visual grounding exploring how to grasp the view knowledge from both text and 3D modalities. For the text branch, ViewRefer leverages the diverse linguistic knowledge of large-scale language models, e.g., GPT, to expand a single grounding text to multiple geometry-consistent descriptions. Meanwhile, in the 3D modality, a transformer fusion module with inter-view attention is introduced to boost the interaction of objects across views. On top of that, we further present a set of learnable multi-view prototypes, which memorize scene-agnostic knowledge for different views, and enhance the framework from two perspectives: a view-guided attention module for more robust text features, and a view-guided scoring strategy during the final prediction. With our designed paradigm, ViewRefer achieves superior performance on three benchmarks and surpasses the second-best by +2.8%, +1.2%, and +0.73% on Sr3D, Nr3D, and ScanRefer. Code will be released at https://github.com/ZiyuGuo99/ViewRefer3D.","creator":"Ziyu Guo, Yiwen Tang, Renrui Zhang, Dong Wang, Zhigang Wang, Bin Zhao, Xuelong Li"},{"title":"3D Human Pose Estimation via Intuitive Physics.","link":"http://arxiv.org/abs/2303.18246","abstract":"Estimating 3D humans from images often produces implausible bodies that lean, float, or penetrate the floor. Such methods ignore the fact that bodies are typically supported by the scene. A physics engine can be used to enforce physical plausibility, but these are not differentiable, rely on unrealistic proxy bodies, and are difficult to integrate into existing optimization and learning frameworks. In contrast, we exploit novel intuitive-physics (IP) terms that can be inferred from a 3D SMPL body interacting with the scene. Inspired by biomechanics, we infer the pressure heatmap on the body, the Center of Pressure (CoP) from the heatmap, and the SMPL body's Center of Mass (CoM). With these, we develop IPMAN, to estimate a 3D body from a color image in a \"stable\" configuration by encouraging plausible floor contact and overlapping CoP and CoM. Our IP terms are intuitive, easy to implement, fast to compute, differentiable, and can be integrated into existing optimization and regression methods. We evaluate IPMAN on standard datasets and MoYo, a new dataset with synchronized multi-view images, ground-truth 3D bodies with complex poses, body-floor contact, CoM and pressure. IPMAN produces more plausible results than the state of the art, improving accuracy for static poses, while not hurting dynamic ones. Code and data are available for research at https://ipman.is.tue.mpg.de.","creator":"Shashank Tripathi, Lea M&#xfc;ller, Chun-Hao P. Huang, Omid Taheri, Michael J. Black, Dimitrios Tzionas"},{"title":"Interpretable Symbolic Regression for Data Science: Analysis of the 2022 Competition.","link":"http://arxiv.org/abs/2304.01117","abstract":"Symbolic regression searches for analytic expressions that accurately describe studied phenomena. The main attraction of this approach is that it returns an interpretable model that can be insightful to users. Historically, the majority of algorithms for symbolic regression have been based on evolutionary algorithms. However, there has been a recent surge of new proposals that instead utilize approaches such as enumeration algorithms, mixed linear integer programming, neural networks, and Bayesian optimization. In order to assess how well these new approaches behave on a set of common challenges often faced in real-world data, we hosted a competition at the 2022 Genetic and Evolutionary Computation Conference consisting of different synthetic and real-world datasets which were blind to entrants. For the real-world track, we assessed interpretability in a realistic way by using a domain expert to judge the trustworthiness of candidate models.We present an in-depth analysis of the results obtained in this competition, discuss current challenges of symbolic regression algorithms and highlight possible improvements for future competitions.","creator":"F. O. de Franca, M. Virgolin, M. Kommenda, M. S. Majumder, M. Cranmer, G. Espada, L. Ingelse, A. Fonseca, M. Landajuela, B. Petersen, R. Glatt, N. Mundhenk, C. S. Lee, J. D. Hochhalter, D. L. Randall, P. Kamienny, H. Zhang, G. Dick, A. Simon, B. Burlacu, Jaan Kasak, Meera Machado, Casper Wilstrup, W. G. La Cava"},{"title":"POLAR-Express: Efficient and Precise Formal Reachability Analysis of Neural-Network Controlled Systems.","link":"http://arxiv.org/abs/2304.01218","abstract":"Neural networks (NNs) playing the role of controllers have demonstrated impressive empirical performances on challenging control problems. However, the potential adoption of NN controllers in real-life applications also gives rise to a growing concern over the safety of these neural-network controlled systems (NNCSs), especially when used in safety-critical applications. In this work, we present POLAR-Express, an efficient and precise formal reachability analysis tool for verifying the safety of NNCSs. POLAR-Express uses Taylor model arithmetic to propagate Taylor models (TMs) across a neural network layer-by-layer to compute an overapproximation of the neural-network function. It can be applied to analyze any feed-forward neural network with continuous activation functions. We also present a novel approach to propagate TMs more efficiently and precisely across ReLU activation functions. In addition, POLAR-Express provides parallel computation support for the layer-by-layer propagation of TMs, thus significantly improving the efficiency and scalability over its earlier prototype POLAR. Across the comparison with six other state-of-the-art tools on a diverse set of benchmarks, POLAR-Express achieves the best verification efficiency and tightness in the reachable set analysis.","creator":"Yixuan Wang, Weichao Zhou, Jiameng Fan, Zhilu Wang, Jiajun Li, Xin Chen, Chao Huang, Wenchao Li, Qi Zhu"},{"title":"RARE: Robust Masked Graph Autoencoder.","link":"http://arxiv.org/abs/2304.01507","abstract":"Masked graph autoencoder (MGAE) has emerged as a promising self-supervised graph pre-training (SGP) paradigm due to its simplicity and effectiveness. However, existing efforts perform the mask-then-reconstruct operation in the raw data space as is done in computer vision (CV) and natural language processing (NLP) areas, while neglecting the important non-Euclidean property of graph data. As a result, the highly unstable local connection structures largely increase the uncertainty in inferring masked data and decrease the reliability of the exploited self-supervision signals, leading to inferior representations for downstream evaluations. To address this issue, we propose a novel SGP method termed Robust mAsked gRaph autoEncoder (RARE) to improve the certainty in inferring masked data and the reliability of the self-supervision mechanism by further masking and reconstructing node samples in the high-order latent feature space. Through both theoretical and empirical analyses, we have discovered that performing a joint mask-then-reconstruct strategy in both latent feature and raw data spaces could yield improved stability and performance. To this end, we elaborately design a masked latent feature completion scheme, which predicts latent features of masked nodes under the guidance of high-order sample correlations that are hard to be observed from the raw data perspective. Specifically, we first adopt a latent feature predictor to predict the masked latent features from the visible ones. Next, we encode the raw data of masked samples with a momentum graph encoder and subsequently employ the resulting representations to improve predicted results through latent feature matching. Extensive experiments on seventeen datasets have demonstrated the effectiveness and robustness of RARE against state-of-the-art (SOTA) competitors across three downstream tasks.","creator":"Wenxuan Tu, Qing Liao, Sihang Zhou, Xin Peng, Chuan Ma, Zhe Liu, Xinwang Liu, Zhiping Cai"},{"title":"MEnsA: Mix-up Ensemble Average for Unsupervised Multi Target Domain Adaptation on 3D Point Clouds.","link":"http://arxiv.org/abs/2304.01554","abstract":"Unsupervised domain adaptation (UDA) addresses the problem of distribution shift between the unlabelled target domain and labelled source domain. While the single target domain adaptation (STDA) is well studied in the literature for both 2D and 3D vision tasks, multi-target domain adaptation (MTDA) is barely explored for 3D data despite its wide real-world applications such as autonomous driving systems for various geographical and climatic conditions. We establish an MTDA baseline for 3D point cloud data by proposing to mix the feature representations from all domains together to achieve better domain adaptation performance by an ensemble average, which we call Mixup Ensemble Average or MEnsA. With the mixed representation, we use a domain classifier to improve at distinguishing the feature representations of source domain from those of target domains in a shared latent space. In empirical validations on the challenging PointDA-10 dataset, we showcase a clear benefit of our simple method over previous unsupervised STDA and MTDA methods by large margins (up to 17.10% and 4.76% on averaged over all domain shifts).","creator":"Ashish Sinha, Jonghyun Choi"},{"title":"Large Language Models as Master Key: Unlocking the Secrets of Materials Science with GPT.","link":"http://arxiv.org/abs/2304.02213","abstract":"This article presents a new NLP task called structured information inference (SII) to address the complexities of information extraction at the device level in materials science. We accomplished this task by tuning GPT-3 on an existed perovskite solar cell FAIR(Findable, Accessible, Interoperable, Reusable) dataset with 91.8 F1-score and we updated the dataset with all related scientific papers up to now. The produced dataset is formatted and normalized, enabling its direct utilization as input in subsequent data analysis. This feature will enable materials scientists to develop their own models by selecting high-quality review papers within their domain. Furthermore, we designed experiments to predict solar cells' electrical performance and reverse-predict parameters on both material gene and FAIR datesets through LLM. We obtained comparable performance with traditional machine learning methods without feature selection, which demonstrates the potential of large language models to judge materials and design new materials like a materials scientist.","creator":"Tong Xie, Yuwei Wan, Wei Huang, Yufei Zhou, Yixuan Liu, Qingyuan Linghu, Shaozhou Wang, Chunyu Kit, Clara Grazian, Bram Hoex"},{"title":"Quiz-based Knowledge Tracing.","link":"http://arxiv.org/abs/2304.02413","abstract":"Knowledge tracing (KT) aims to assess individuals' evolving knowledge states according to their learning interactions with different exercises in online learning systems (OIS), which is critical in supporting decision-making for subsequent intelligent services, such as personalized learning source recommendation. Existing researchers have broadly studied KT and developed many effective methods. However, most of them assume that students' historical interactions are uniformly distributed in a continuous sequence, ignoring the fact that actual interaction sequences are organized based on a series of quizzes with clear boundaries, where interactions within a quiz are consecutively completed, but interactions across different quizzes are discrete and may be spaced over days. In this paper, we present the Quiz-based Knowledge Tracing (QKT) model to monitor students' knowledge states according to their quiz-based learning interactions. Specifically, as students' interactions within a quiz are continuous and have the same or similar knowledge concepts, we design the adjacent gate followed by a global average pooling layer to capture the intra-quiz short-term knowledge influence. Then, as various quizzes tend to focus on different knowledge concepts, we respectively measure the inter-quiz knowledge substitution by the gated recurrent unit and the inter-quiz knowledge complementarity by the self-attentive encoder with a novel recency-aware attention mechanism. Finally, we integrate the inter-quiz long-term knowledge substitution and complementarity across different quizzes to output students' evolving knowledge states. Extensive experimental results on three public real-world datasets demonstrate that QKT achieves state-of-the-art performance compared to existing methods. Further analyses confirm that QKT is promising in designing more effective quizzes.","creator":"Shuanghong Shen, Enhong Chen, Bihan Xu, Qi Liu, Zhenya Huang, Linbo Zhu, Yu Su"}]},{"name":"Plant Biology","feed":[{"title":"Effect of hexanal treatment on fruit qualities and antioxidant activities on 'Umran' Indian jujube fruit during cold storage","link":"http://biorxiv.org/cgi/content/short/2023.04.06.535963v1?rss=1","abstract":"'Umran' Indian jujube is a widely grown cultivar due to its marketable quality and productivity, resulting in excellent market value. Despite its high quality, the product's short shelf life poses a challenge for transportation, even within the domestic market. Hexanal with three concentrations (0.15%, 0.20%, and 0.25%) was applied to the fruit of 'Umran' Indian jujube at both pit hardening and color break stages. Harvested fruits were stored for 28 days in a cold chamber of 7.5{+/-}1{degrees}C and 90-95% RH. The changes in fruit qualities were assessed with physicochemical characteristics, bioactive compounds, and enzymatic antioxidant activities every seven days. Fruits treated with hexanal of 0.20% reduced fruit weight loss and spoilage and maintained fruit firmness, soluble solids content, carotenoid content, and antioxidant activity. The activities of cell wall degrading enzymes investigated were suppressed. Of the antioxidant activities, superoxide dismutase and peroxidase were positively activated. Therefore, these results indicated that pre-harvest application of hexanal 0.20% improved physiochemical characteristics, maintained bioactive compounds, antioxidant enzyme activities, and extended the shelf life of Indian jujube fruits up to 21 days during cold storage.","creator":"Sharma, A., Bons, H. K., Jawandha, S. K., Chung, S. W."},{"title":"Embryo-specific epigenetic mechanisms reconstitute the CHH methylation landscape during Arabidopsis embryogenesis","link":"http://biorxiv.org/cgi/content/short/2023.04.06.535361v1?rss=1","abstract":"The modification of flowering plant DNA by CHH methylation acts primarily to silence transposable elements, of which many active copies are present in Arabidopsis thaliana. During embryogenesis, the CHH methylation landscape is dramatically reprogrammed, resulting in exceedingly high levels of this modification upon mature embryo formation. The mechanisms constituting the remodeling process, and its function in embryos, are unclear. Here, we isolate embryos from Arabidopsis plants harboring mutations for key components of the pathways that confer CHH methylation, namely RNA-directed DNA methylation (RdDM) and the Chromomethylase 2 (CMT2) pathways. We reveal that embryos are more methylated than leaves at shared CMT2 and RdDM targeting loci, accounting for most embryonic CHH hypermethylation. While the majority of embryo CHH methylated loci overlap with those in somatic tissues, a subset of conventional pericentric CMT2-methylated loci are instead targeted by RdDM in embryos. These loci, termed embRdDM exhibit intermediate H3K9me2 levels, associated with increased chromatin accessibility. Strikingly, more than 50% of the embRdDM loci in pollen vegetative (nurse) cells and ddm1 mutant somatic tissues are also targeted by RdDM, and these tissues were also reported to exhibit increased chromatin accessibility in pericentric heterochromatin. Furthermore, the root columella stem cell niche also displays CHH hypermethylation and an enriched presence of small RNAs at embRdDM loci. Finally, we observe a significant overlap of CHH hypermethylated loci with endosperm DEMETER targeting sites, suggesting that non-cell autonomous communication within the seed may contribute to the epigenetic landscape of the embryo. However, similar overlap with vegetative cell DEMETER targets indicates that the chromatin landscape that allows DEMETER access is mirrored in developing embryos, permitting CHH methylation catalysis at the same loci. Our findings demonstrate that both conserved and embryo-specific epigenetic mechanisms reshape CHH methylation profiles in the dynamic chromatin environment of embryogenesis.","creator":"Hsieh, P.-H., Frost, J. M., Choi, Y., Hsieh, T.-F., Zilberman, D., Fischer, R. L."},{"title":"Phytohormone profiling in an evolutionary framework","link":"http://biorxiv.org/cgi/content/short/2023.04.06.534998v1?rss=1","abstract":"Multiple phytohormones act as conserved developmental regulators in land plants. Although the closely related streptophyte green algae typically lack full complements of molecular pathways underlying these responses, scattered reports of endogenous phytohormone production in these organisms exist. In this study, we performed a detailed LC/MS-based analysis of several phytohormones, their precursors and metabolites in all lineages of streptophyte algae. We also included chlorophyte algae and early-diverging land plants as outgroups. Free auxin, tRNA-derived cytokinins and certain phenolics including salicylic acid were found ubiquitously. However, land plants differed from green algae by the consistent detection of abscisic acid and the presence of auxin and cytokinin conjugates and trans-zeatin, supporting the hypotheses that these three phytohormones likely came to regulate development in the ancestral land plant. By contrast, we observed a patchy distribution of jasmonates among streptophytes. We additionaly analyzed the corresponding culture and empty media to account for phytohormone excretion and environmental contamination. Extracellular auxins and cytokinins were frequently detected, while agar constituted a major external source of phenolic compounds. We provide a highly comprehensive evolution-directed screen of phytohormone compound occurrence and thoroughly discuss our data in the context of current plant hormonomics and phylogenomics.","creator":"Schmidt, V., Skokan, R., Kurtovic, K., Vosolsobe, S., Filepova, R., Haluska, S., Dobrev, P., Motyka, V., Petrasek, J."},{"title":"Lessons from relatives: C4 photosynthesis enhances CO2 assimilation during the low-light phase of fluctuations.","link":"http://biorxiv.org/cgi/content/short/2023.04.03.535443v1?rss=1","abstract":"Despite the global importance of species with C4 photosynthesis, there is a lack of consensus regarding C4 performance under fluctuating light. Contrasting hypotheses and experimental evidence suggest that C4 photosynthesis is either less, or more efficient in fixing carbon under fluctuating light than the ancestral C3 form. Two main issues were identified that may underly the lack of consensus: neglect of evolutionary distance between selected C3 and C4 species and use of contrasting fluctuating light treatments. To circumvent these issues, we compared photosynthetic responses to fluctuating light across three independent phylogenetically controlled comparisons between C3 and C4 species from Alloteropsis, Flaveria, and Cleome genera under 21% and 2% O2. Leaves were subjected to repetitive stepwise changes in light intensity (800 and 100 mol m-2 s-1 PFD) with three contrasting durations: 6, 30 and 300 seconds. These experiments reconcile the opposing results found across previous studies showing that 1) stimulation of CO2 assimilation in C4 species during the low light phase was both stronger and more sustained than in C3 species; 2) CO2 assimilation patterns during the high light phase were genus-specific rather than impacted by photosynthetic pathway; and 3) the duration of each light step in the fluctuation regime can strongly influence experimental outcomes.","creator":"Kromdijk, J., Arce Cubas, L., Rodrigues Gabriel Sales, C., Vath, R. L., Bernardo, E. L., Burnett, A. C."},{"title":"Development of a marker within the candidate Un8 true loose smut resistance gene for use in barley breeding","link":"http://biorxiv.org/cgi/content/short/2023.04.06.535815v1?rss=1","abstract":"Breeding for resistance to true loose smut infection caused by the pathogen (Ustilago nuda (Jens.) Rostr.) is an economical and environmentally safe way to limit the effect of this pathogen on barley. However, screening for resistance using natural infection can lead to inconsistent results and artificial inoculation is labour intensive, and can fail, leading to erroneous phenotyping. Marker assisted selection of genes conferring disease resistance can increase the efficiency of breeding programs. A candidate gene for Un8 resistance was used to develop a genetic marker which was tested on a recombinant inbred line (RIL) population derived from the resistant 'CDC Freedom' and the susceptible 'Samson' varieties. The RIL population (98 lines) was phenotyped for resistance to true loose smut by artificial inoculation and genotyped with the newly developed marker. The genotyping results obtained with the marker developed in this study were mostly consistent with true loose smut resistance determined by artificial inoculation. The markers was also tested in additional barley cultivars and breeding material. Repeated analysis of inconsistent results is required to confirm or revise these results, as well as further investigation of the candidate gene to confirm its role in barley true loose smut resistance is being planned.","creator":"Skipars, V., Sokolova, E., Seile, S., Rungis, D. E., Legzdina, L."},{"title":"Substrate specificity and functional conservation of SWEET10 transporter in pineapple","link":"http://biorxiv.org/cgi/content/short/2023.04.06.535793v1?rss=1","abstract":"SWEET transporters are a unique class of sugar transporters that play vital roles in various developmental and physiological processes in plants. While the functions of SWEETs have been well established in model plants such as Arabidopsis, their functions in economically important fruit crops like pineapple have not been well studied. Here, we aimed to investigate the substrate specificity of pineapple SWEETs by comparing the protein sequences of known glucose and sucrose transporters in Arabidopsis to those in pineapple. Our genome-wide approach and 3D structure comparison showed that the Arabidopsis SWEET8 homolog in pineapple, AcSWEET10, shares similar sequences and protein properties responsible for glucose transport. To determine the functional conservation of AcSWEET10, we tested its ability to complement glucose transport mutants in yeast and analyzed its expression in stamens and impact on the microspore phenotype and seed set in transgenic Arabidopsis. The results showed that AcSWEET10 is functionally equivalent to AtSWEET8 and plays a critical role in regulating microspore formation through the regulation of the Callose synthase5 (CalS5), which highlights the importance of SWEET transporters in pineapple. This information could have important implications for improving fruit crop yield and quality by manipulating SWEET transporter activity.","creator":"Fakher, B., Ashraf, M. A., Wang, L., Wang, X., Zheng, P., Aslam, M., Qin, Y."},{"title":"In planta exploitation of leaf apoplastic compounds: a window of opportunity for spatiotemporal studies of apoplastic metabolites, hormones and physiology","link":"http://biorxiv.org/cgi/content/short/2023.04.05.535553v1?rss=1","abstract":"Processes in the leaf apoplast are relevant for development, cell wall rheological properties, plant nutrition, sink-source portioning, microbe-host plant-interactions or intercellular information exchange and signaling and are therefore regulated or influenced by the composition of the leaf apoplastic solute. In contrast to the traditional methods for the extraction of apoplastic solutes that are more or less destructive, we propose a new method that allows extraction of leaf apoplastic solutes (i) non-invasively and, thus, (ii) over time. Moreover, the method has (iii) a high spatial resolution that allows identification of solute-microdomains in the leaf apoplast. The method was established for Arabidopsis thaliana and Vicia faba leaves but should also be applicable to other plants species with similar leaf morphologies. It is based on the infiltration of an aqueous extraction solution into the apoplast followed by its recovery seconds later, both through the stomata. By this, the apoplast (and its solutes) of an identical leaf can be sampled on successive days with negligible symplastic contamination. A spatiotemporal mapping of leaf apoplastic ion and metabolite patterns within the identical leaf opens a window of opportunity for understanding apoplast biology. As for example, the existence of apoplastic abscisic acid gradients within a leaf in response to salinity was witnessed in this study, as was the unsuspected accumulation of kaempferol glycosides in the leaf apoplast. The presented method is relevant for plant developmental biologists, phytopathologists, plant physiologists, plant nutritionists and others that need to integrate apoplast biology into their research approaches.","creator":"Franzisky, B. L., Solter, J., Xue, C., Harter, K., Stahl, M., Geilfus, C.-M."},{"title":"Strigolactones optimise plant water usage by modulating vessel formation","link":"http://biorxiv.org/cgi/content/short/2023.04.05.535530v1?rss=1","abstract":"Wood formation is fundamental for the remarkable growth of plant bodies by continuously providing cells for long-distance transport of water and nutrients. Vessel elements, the water transporting units within woody tissues, are generated from a cylindrical domain of cambium stem cells (CSCs) producing different vascular cell types in a bidirectional manner. However, knowledge on the regulation of CSC activity is limited with unclear cell fate trajectories as the most obscure aspect in this context. Here, via revealing transcriptome signatures of CSCs and their derivatives with single cell resolution in Arabidopsis thaliana, we discover that the strigolactone (SL) signalling pathway modulates cell type composition in vascular tissues and thereby increases drought resistance. In particular, we find that SL signalling negatively regulates vessel element formation and thereby plant water usage. SL signalling is generally associated with differentiating vascular tissues but low in developing vessels and in CSCs implying a local role during fate decisions in CSC-derived cells. Highlighting the importance of vascular tissue composition for the overall plant water balance, alteration of vessel element formation has a direct impact on transpiration rates through leaf stomata. Our results demonstrate the importance of structural alignment of water transporting tissues to unstable water regimes and provide perspectives for a long-term modulation of drought resistance in plants.","creator":"Zhao, J., Shi, D., Kaeufer, K., Song, C., Xu, X., Luzzietti, L., Bennett, T., Kaufmann, K., Greb, T."},{"title":"A single amino acid substitution in MdLAZY1A dominantly impairs shoot gravitropism in Malus","link":"http://biorxiv.org/cgi/content/short/2023.04.05.535771v1?rss=1","abstract":"Plant architecture is one of the most important factors that determines crop yield potential and productivity. In apple (Malus), genetic improvement of tree architecture has been challenging due to a long juvenile phase and their growth as complex trees composed of a distinct scion and a rootstock. To better understand the genetic control of apple tree architecture, the dominant weeping growth phenotype was investigated. We report the identification of MdLAZY1A (MD13G1122400) as the genetic determinant underpinning the Weeping (W) locus that largely controls weeping growth in Malus. MdLAZY1A is one of the four paralogs in apple that are most closely related to AtLAZY1 involved in gravitropism in Arabidopsis. The weeping allele (MdLAZY1A-W) contains a single nucleotide mutation c.584T>C that leads to a leucine to proline (L195P) substitution within a predicted transmembrane domain that co-localizes with Region III, one of the five conserved regions in LAZY1-like proteins. Subcellular localization revealed that MdLAZY1A localizes to the plasma membrane and nucleus in plant cells. Over-expressing the weeping allele in apple cultivar Royal Gala (RG) with standard growth habit impaired its gravitropic response and altered the growth to weeping-like. Suppressing the standard allele (MdLAZY1A-S) by RNA interference (RNAi) in RG similarly changed the branch growth direction to downward. Overall, the L195P mutation in MdLAZY1A is genetically causal for weeping growth, underscoring not only the crucial roles of residue L195 and Region III in MdLAZY1A-mediated gravitropic response, but also a potential DNA base editing target for tree architecture improvement in Malus and other crops.","creator":"Dougherty, L., Borejsza-Wysocka, E., Miaule, A., Wang, P., Zheng, D., Jansen, M., BROWN, S. K., Pineros, M. A., Dardick, C. D., Xu, K."},{"title":"A soybean pattern recognition receptor conferring broad-spectrum pathogen and pest resistance regulates expression of several NLR receptor proteins","link":"http://biorxiv.org/cgi/content/short/2023.04.04.535565v1?rss=1","abstract":"Overexpressors of Glycine max disease resistant 1 (GmDR1) exhibits broad-spectrum resistance against Fusarium virguliforme, soybean cyst nematode (SCN), spider mites, and soybean aphids in soybean. To understand the mechanisms of broad-spectrum immunity mediated by GmDR1, we investigated the transcriptomes of a strong and a weak GmDR1-overexpressors following treatment with chitin, a pathogen- and pest-associated molecular pattern (PAMP) found in these organisms. The strong and weak GmDR1-overexpressors exhibited altered expression of 6,098 and 992 genes, respectively, as compared to the nontransgenic control following chitin treatment. However, only 192 of these genes exhibited over two-fold changes in expression levels in both strong and weak GmDR1-overexpressors as compared to the control. MapMan analysis of the 192 genes revealed 64 biotic stress-related genes, of which 53 were induced and 11 repressed as compared to the control. The 53 chitin-induced genes include nine that encode receptor kinases, 13 encode nucleotide-binding leucine-rich repeat (NLR) receptor proteins, seven encoding WRKY transcription factors, four ethylene response factors, and three MYB-like transcription factors. Investigation of a subset of these genes revealed three receptor protein kinases, seven NLR proteins, and one WRKY transcription factor genes that are induced following F. virguliforme and SCN infection. The integral plasma membrane GmDR1 protein most likely recognizes PAMPs including chitin and activates transcription of genes encoding receptor kinases and NLR proteins. GmDR1 could be a pattern recognition receptor that regulates the expression of several NLRs for expression of PAMP-triggered immunity and/or priming the effector triggered immunity.","creator":"Ngaki, M. N., Srivastava, S. K., Wang, F., Bhattacharyya, M. K."},{"title":"Caleosin 1 contributes to seed lipid droplet degradation by interaction with autophagy-related protein ATG8","link":"http://biorxiv.org/cgi/content/short/2023.04.04.535563v1?rss=1","abstract":"Triacylglycerols (TAGs) accumulate in lipid droplets (LDs) of seed tissues to provide energy and carbon for seedling establishment. In the major route of LD degradation (lipolysis), TAGs are mobilized by lipases. However, LDs may be also degraded via lipophagy, a type of selective autophagy, which mediates LDs delivery to vacuoles or lysosomes. The exact mechanism of this process in plants still remains unresolved. Here, we provide evidence that during Arabidopsis thaliana seed germination, LDs are degraded by microlipophagy and that this process requires caleosin 1 (CLO1), a LD surface protein. We show co-localization of autophagy-related protein 8b (ATG8b) and LDs during seed germination and localization of lipidated ATG8 (ATG8-PE) to the LD fraction. We further demonstrate that CLO1, CLO2 and CLO3 interact with ATG8 proteins via their ATG8-interacting motifs (AIMs). Deletion of AIM localized directly before the proline knot disrupts CLO1 interaction with ATG8b, suggesting the essential role of this region in the interaction between the two proteins. Collectively, we provide new insights into the molecular mechanisms governing the interaction of LDs with the autophagy machinery in plant cells, contributing to understanding of the role of structural LD proteins in lipid mobilization.","creator":"Miklaszewska, M., Zienkiewicz, K., Klugier-Borowska, E., Rygielski, M., Feussner, I., Zienkiewicz, A."},{"title":"Importance of Leaf Age in Grapevines Under Salt Stress","link":"http://biorxiv.org/cgi/content/short/2023.04.02.535264v1?rss=1","abstract":"The combined effects of salt stress and leaf age on photosynthesis and stomatal conductance are not fully understood. Salt stress develops at different rates in various plant organs and tissues, leading to osmotic and ionic stresses. We studied the development of salt stress (30 mM NaCl) in two grapevine rootstocks by examining the gas exchange, photochemistry, and salt accumulation of leaves at different ages. Our results indicate that leaf age strongly affected photosynthesis but had a minor effect on stomatal conductance in both control and salinity conditions. Surprisingly, salt stress lowered stomatal conductance but had little effect on photosynthesis, opposite to the leaf age effects. Reduction in photosystem II efficiency explained the age-associated decline in photosynthesis, suggesting that the light-dependent phase of photosynthesis is the first process affected by leaf aging. We also found that the sodium exclusion capacity decreased as leaves matured and was age and variety dependent, indicating the importance of leaf age when sampling for salt tolerance studies. Therefore, we suggest that sampling only young leaves is missing critical information in the evaluation of salt-tolerant traits in grapevines.","creator":"Lupo, Y., Prashanth, K., Lazarovitch, N., Fait, A., Rachmilevitch, S."},{"title":"An efficient hairy root system for genome editing of a -ODAP pathway gene in Lathyrus sativus","link":"http://biorxiv.org/cgi/content/short/2023.04.03.535460v1?rss=1","abstract":"Grass pea (Lathyrus sativus) is an ideal legume crop for resource-poor farmers, having resistance to various biotic and abiotic stresses. The seeds of this plant are rich in protein and are the only known dietary source of L-homoarginine. Moreover, it thrives with minimal inputs making it a promising crop in grain legume breeding programs with immense potential for food security. Despite these advantages, the global area under its cultivation has decreased because of the presence of an antinutrient compound, {beta}-N-oxalyl-L-,{beta}-diamino propionic acid ({beta}-ODAP), which results in neurolathyrism both in humans and animals. Multiple efforts in the past have resulted in the development of improved varieties with low ODAP. Still, due to variations in response to the environment, stable low-ODAP lines have not been developed for large-scale cultivation. In this paper, we report in planta characterization of Oxalyl-CoA Synthetase (OCS) involved in the oxalylating step leading to {beta}-ODAP production. We established a hairy root transformation system for Lathyrus and demonstrated the genome editing of LsOCS. Further, we show that oxalate accumulates in these hairy roots due to loss-of-function of the OCS gene. This is the first report of functional analysis of a Lathyrus gene in Lathyrus. The hairy root genome editing system we developed can be used as a quick system for functional studies of Lathyrus genes.","creator":"Verma, A., Kaur, L., Kaur, N., Bhardwaj, A., PANDEY, A. K., Kandoth, P. K."},{"title":"Alphafold-multimer predicts cross-kingdom interactions at the plant-pathogen interface","link":"http://biorxiv.org/cgi/content/short/2023.04.03.535425v1?rss=1","abstract":"Adapted plant pathogens from various microbial kingdoms produce hundreds of unrelated small secreted proteins (SSPs) with elusive roles. Some of these SSPs might be inhibitors targeting the most harmful hydrolases secreted by the host. Here, we used Alphafold-Multimer (AFM) to screen 1,879 SSPs of seven tomato pathogens for interacting with six defence-related hydrolases of tomato that accumulate to high levels in the apoplast during infection. This screen of 11,274 protein pairs identified 15 SSPs that are predicted to obstruct the active site of chitinases and proteases with an intrinsic fold. Four SSPs were experimentally verified to be inhibitors of pathogenesis-related subtilase P69B, including extracellular protein-36 (Ecp36) and secreted-into-xylem-15 (Six15) of the fungal tomato pathogens Cladosporium fulvum and Fusarium oxysporum, respectively. Together with a novel P69B inhibitor from the bacterial pathogen Xanthomonas perforans and the previously reported Kazal-like inhibitors of the oomycete pathogen Phytophthora infestans, P69B emerges as an important effector hub targeted by different microbial kingdoms, consistent with the presence of a hyper-variant residue in P69B orthologs and gene duplication and diversification of P69B paralogs that could avoid inhibitor binding. This study demonstrates the power of artificial intelligence to accurately predict novel cross-kingdom interactions at the plant-pathogen interface.","creator":"Homma, F., Huang, J., van der Hoorn, R. A. L."},{"title":"Plant Arbovirus Mobilizes a Vector Salivary Protein to Initiate Plant Infection","link":"http://biorxiv.org/cgi/content/short/2023.04.04.535507v1?rss=1","abstract":"Plant arboviruses rely heavily on insects feeding activities for successful transmission. Insect salivary proteins have been suggested to be essential for successful viral infection, but their exact mechanisms are largely unknown. In this study, we reveal that salivary factors from Laodelphax striatellus are necessary for infection of Rice stripe virus (RSV) in plants. A salivary carbonic anhydrase (LssaCA) is identified as an essential factor in promoting RSV infection. LssaCA interacts with a rice thaumatin-like protein (OsTLP) that has endo-{beta}-1,3-glucanase activity and can degrade callose in plants. RSV infection induces callose deposition, which can be reversed by LssaCA. Furthermore, LssaCA directly binds to the RSV nucleocapsid protein (NP) in salivary glands, and the LssaCA-RSV NP complex still binds OsTLP and further increases its glucanase activity. This study provides new insights into the tripartite virus-insect vector-plant interaction, which is relevant to many agriculturally important plant arboviruses whose transmission is facilitated by insect salivary proteins.","creator":"Zhao, J., Yang, J., Meng, X., Fang, R., Huo, Y., Zhang, L."},{"title":"Lectins in pistils play a key role in self-incompatibility in the heterostylous Linum perenne","link":"http://biorxiv.org/cgi/content/short/2023.04.02.535286v1?rss=1","abstract":"Self-incompatibility is one of the mechanisms preventing inbreeding in populations, based on the failure of pollen grains to germinate or of pollen tubes to grow normally in incompatible crosses. A unique model for studying this process are heterostylous species, in which self-incompatibility alleles are closely linked to flower morphological traits. One such species is L. perenne, a classic distylous species with reciprocal herkogamy and complete self-incompatibility strongly linked. The mechanism of self-pollen recognition is poorly understood in most heterostylous species, including L. perenne. As self-incompatibility in other systems is based on protein-protein interactions and many extracellular proteins are glycosylated, one of the possible participants in this process may be lectins. Therefore, we aimed to investigate the lectin activity in pistils and stamens of L. perenne L-morph and S-morph plants and to establish whether these lectins take part in self-incompatibility. We show that pistil-derived galactose-specific Ca2+-independent lectins from the respective other morph can overcome self-incompatibility in heterostylous L. perenne. This may be due to the presence of some lectins that are specific for arabinose and xylose. Our results suggest that lectins participate in signaling pathways for recognition at the pollen-stigma interface and are involved in the regulation of the self-incompatibility process in L. perenne.","creator":"Levchuk, H., Makhno, Y., Costa, M. M. R., Lenhard, M."},{"title":"Cell type-specific responses to fungal infection in plants revealed by single-cell transcriptomics","link":"http://biorxiv.org/cgi/content/short/2023.04.03.535386v1?rss=1","abstract":"Plant infection by microbial pathogens is a dynamic process. Here, we investigated the heterogeneity of plant responses in the context of pathogen location. A single-cell atlas of Arabidopsis thaliana leaves challenged by the fungus Colletotrichum higginsianum revealed cell type-specific gene expression that highlights an enrichment of intracellular immune receptors in vasculature cells. Using trajectory inference, we assigned cells that directly interacted with the invasive hyphae. Further analysis of cells at these infection sites revealed transcriptional plasticity based on cell type. A reprogramming of abscisic acid signalling was specifically activated in guard cells. Consistently, a contact-dependent stomatal closure was observed, possibly representing a defense response that anticipates pathogen invasive growth. We defined cell type-specific deployments of genes activating indole glucosinolate biosynthesis at the infection sites, and determined their contribution to resistance. This research highlights the spatial dynamics of plant response during infection and reveals cell type-specific processes and gene functions.","creator":"Tang, B., Feng, L., Ding, P., Ma, W."},{"title":"Disruption of the rice 4-DEOXYOROBANCHOL HYDROXYLASE unravels specific functions of canonical strigolactones","link":"http://biorxiv.org/cgi/content/short/2023.04.03.535333v1?rss=1","abstract":"Strigolactones (SLs) regulate many developmental processes, including shoot-branching/tillering, and mediate rhizospheric interactions. SLs are structurally diverse, divided into a canonical and a non-canonical sub-family. To better understand the biological function of particular SLs, we generated CRISPR/Cas9 mutants disrupted in OsMAX1-1400 or OsMAX1-1900, which encode cytochrome P450 enzymes (CYP711A clade) contributing to SL diversity. The disruption of OsMAX1-1900 did neither affect the SL pattern nor plant architecture, indicating a functional redundancy. In contrast, disruption of OsMAX1-1400 activity, a 4-deoxyorobanchol hydroxylase, led to a complete lack of orobanchol and an accumulation of its precursor 4-deoxyorobanchol (4DO), both of which are a canonical SLs common in different plant species, accompanied by higher levels of the non-canonical methyl 4-oxo-carlactonoate (4-oxo-MeCLA). Os1400 mutants showed also shorter plant height, panicle and panicle base length, but did not exhibit a tillering phenotype. Hormone quantification and transcriptome analysis revealed elevated auxin levels and changes in the expression of auxin-related, as well as of SL biosynthetic genes. Interestingly, the Os900/1400 double mutant lacking both orobanchol and 4DO did not show the observed Os1400 architectural phenotypes, indicating that they are a result of 4DO accumulation. A comparison of the mycorrhization and Striga seed germinating activity of Os900, Os900/1400, and Os1400 loss-of-function mutants demonstrates that the germination activity positively correlates with 4DO content while disrupting OsMAX1-1400 negatively impact mycorrhizal symbiosis. Taken together, our paper deciphers the biological function of canonical SLs in rice and depicts their particular contributions to establishing architecture and rhizospheric communications.","creator":"Chen, G.-T. E., Wang, J. Y., Votta, C., Braguy, J., Jamil, M., Kirschner, G., Fiorilli, V., Berqdar, L., Balakrishna, A., Blilou, I., Lanfranco, L., Al-Babili, S."},{"title":"Modification of amyloplast size in wheat endosperm through mutation of PARC6 affects starch granule morphology","link":"http://biorxiv.org/cgi/content/short/2023.04.03.535339v1?rss=1","abstract":"Starch granule morphology is a major factor determining the functional and nutritional properties of starch. Here, we reveal amyloplast structure plays an important role in starch granule morphogenesis in wheat endosperm. Wheat amyloplasts contain large discoid A-type granules and small spherical B-type granules. We isolated a mutant in durum wheat defective in the plastid division protein PARC6, which had increased plastid size in both leaves and endosperm. Endosperm amyloplasts of the mutant contained more A- and B-type granules than those of the wild type. In mature grains, the mutant had larger A- and B-type granules than the wild type, and its A-type granules had a highly aberrant, lobed surface. This defect in granule morphology was already evident at early stages of grain development, when granule size was identical between the mutant and the wild type, and occurred without obvious alterations in starch polymer structure and composition. Plant growth and photosynthetic efficiency, as well as the size, number and starch content of grains, were not affected in the Ttparc6 mutants despite the large changes in plastid size. Interestingly, mutation of the PARC6 paralog, ARC6, in durum wheat did not increase plastid or starch granule size. We suggest this is because TtPARC6 can complement disrupted TtARC6 function by interacting with PDV2, the outer plastid envelope protein that typically interacts with ARC6 to promote plastid division. We propose that amyloplast compartment size and available stromal volume play important roles in determining starch granule size, shape and number per amyloplast.","creator":"Esch, L., Ngai, Q. Y., Barclay, J. E., McNelly, R., Hayta, S., Smedley, M., Smith, A. M., Seung, D."},{"title":"The DEAD-box helicase RCF1 plays roles in miRNA biogenesis and RNA splicing in Arabidopsis","link":"http://biorxiv.org/cgi/content/short/2023.04.03.535409v1?rss=1","abstract":"RCF1 is a highly conserved DEAD-box helicase found in yeast, plants and mammals. Studies about the functions of RCF1 in plants are limited. Here we uncovered the functions of RCF1 in Arabidopsis thaliana as a player in pri-miRNA processing and splicing, as well as in pre-mRNA splicing. A mutant with miRNA biogenesis defects was isolated and the defect was traced to a recessive point mutation in RCF1 (rcf1-4). We show that RCF1 promotes D-body formation and facilitates the interaction between pri-miRNAs and HYL1. Finally, we show that intron-containing pri-miRNAs and pre-mRNAs exhibit a global splicing defect in rcf1-4. Together, this work uncovers roles for RCF1 in miRNA biogenesis and RNA splicing in Arabidopsis.  One-sentence summaryRCF1 promotes not only the processing of pri-miRNAs, but also the splicing of intron-containing pri-miRNAs, therefore promotes miRNA biogenesis.","creator":"Xu, C., Zhang, Z., He, J., Bai, Y., Liu, L., Tang, J., Tang, G., Chen, X., Mo, B."},{"title":"Biological characterization of an emergent virus infecting vegetables in diversified production systems: physostegia chlorotic mottle virus","link":"http://biorxiv.org/cgi/content/short/2023.04.03.535357v1?rss=1","abstract":"With the emergence of high throughput sequencing (HTS) technologies, the discovery of new plant viruses has outpaced their biological characterization. However, it is crucial to understand the biology of these viruses to evaluate the risks they pose for the production of crops and natural ecosystems and to manage them properly. In 2018, Physostegia chlorotic mottle virus (PhCMoV) was detected in Austria in a Physostegia plant (Lamiaceae) using HTS, and subsequent prepublication data sharing associated the presence of the virus with severe fruit symptoms on important crops like tomato, eggplant, and cucumber across nine European countries. This discovery led to a collaborative effort to understand better the virus's genetic diversity, host range, symptomatology, and distribution. Still, specific knowledge gaps remained. In this study, the authors address these gaps by examining the transmission mode, prevalence, and disease severity of PhCMoV. Bioassay and field survey confirmed the causal association between the presence of the virus and symptoms on tomato and eggplant. The investigation also mapped out the historical and geographic footprint of the virus, spanning back 30 years and including a new location, Switzerland. Based on field survey, PhCMoV was found to naturally infect 11 new host plant species across seven families, extending the host range of PhCMoV to 20 plant species across 14 plant families. Greenhouse assays with mechanical inoculation showed that yield losses could reach 100% depending on the phenological stage of the plant at the time of infection. The study also identified a polyphagous leafhopper species (Anaceratagallia sp.) as the natural vector of PhCMoV. PhCMoV was widespread in diversified vegetable farms in Belgium where tomato is grown in soil, occurring in approximately one-third of such farms. However, outbreaks were sporadic and it can be suggested that they were associated with specific cultural practices, such as the cultivation of perennial plants in tomato tunnels that can serve as a host for both the virus and its vector. To further explore this phenomenon and better manage the virus, studying the ecology of the Anaceratagalliae vector would be beneficial.","creator":"Temple, C., Blouin, A. G., Boezen, D., Botermans, M., Durant, L., De Jonghe, K., De Koning, P., Goedefroit, T., Minet, L., Steyer, S., Verdin, E., Zwart, M. P., Massart, S."},{"title":"Radial askew endodermal cell divisions reveal IRK functions in division orientation","link":"http://biorxiv.org/cgi/content/short/2023.03.31.534810v1?rss=1","abstract":"Oriented cell divisions produce different cell types and maintain tissue and organ patterning in plants; this is particularly true of the highly organized Arabidopsis root meristem. Because plant cells are encased by walls, the precise orientation of cell divisions is especially important for cell fate specification and tissue/organ organization. Mutant alleles of the transmembrane receptor kinase INFLORESCENCE AND ROOT APICES RECEPTOR KINASE (IRK) exhibit excess endodermal cell divisions, resulting in more cells in the radial axis of irk roots. IRK localizes to the outer polar domain of endodermal cells, which suggests directional signal perception is necessary to repress endodermal cell proliferation. Here, we conducted a detailed examination of endodermal cell divisions in irk and identified a distinct cell division orientation defect. Many excess endodermal divisions in irk-4 have outwardly skewed division planes, therefore we termed them  radial askew divisions. An IRK truncation lacking the kinase domain retains polar localization and rescues these radial askew divisions, but exhibits excess periclinal divisions, phenocopying the weaker irk-1 allele. These results expand IRKs function beyond repression of endodermal cell division activity showing its also required for division plane orientation. Based on its polarity, we propose that IRK at the outer lateral endodermal cell face interferes with division plane selection, maintenance, and/or cell plate attachment to influence endodermal cell division orientation.","creator":"Rony, R. I. K., Campos, R., Van Norman, J. M."},{"title":"Arabidopsis lateral shoots display two distinct phases of growth angle control","link":"http://biorxiv.org/cgi/content/short/2023.03.31.535051v1?rss=1","abstract":"Shoot growth angle is a fundamental determinant of plant form. In their later development, lateral branches maintain gravitropic setpoint angles (GSAs) in which growth is set and maintained relative to gravity. The typically non-vertical GSAs are the product of an auxindependent antigravitropic offset that counteracts underlying gravitropic response in the branch (Roychoudhry et al., 2013). Here we describe an earlier phase of branch development in which the young lateral shoot grows rootward, independently of gravity, promoting a spreading growth habit. In normal development, this phase of growth is terminated with the onset of the GSA programme, with branches then growing upwards to assume their mature form. The biophysical basis of the early rootward phase of branch growth can be traced back to greater cell proliferation on the upper, adaxial side that upon expansion, drives asymmetric growth. Our data indicate that cytokinin is involved in this process and that the transcription factor TCP1 is an important regulator of lateral shoot adaxial identity and differential ad-abaxial cell proliferation.","creator":"De Angelis, M., Kepinski, S."},{"title":"Changes in Protein Turn-over Rates Regulate Tryptophan and Glucosinolate Biosynthesis, IAA Transport and Photosynthesis in Arabidopsis Growth and Defense Transitions","link":"http://biorxiv.org/cgi/content/short/2023.03.31.535076v1?rss=1","abstract":"An organism continuously experiences shifts in biological states necessitating extensive rearrangement of physiology and molecular order of the cell. Here we model transitions between optimal growth conditions (homeostasis), fully induced pattern triggered immunity (PTI) and back in Arabidopsis thaliana, chronologically measuring changes in protein synthesis and degradation rates, transcript, protein and phytohormone abundance of 99 targets using qPCR and LC-MS parallel reaction monitoring (PRM). Temporally changing synthesis and degradation rates were primary determinants of abundance, next to changes in mRNA levels, of tryptophan, glucosinolate (GS) biosynthesis and photosynthesis associated (PAP) proteins particularly in the earlier establisher phases but also in fully induced PTI. While transcripts returned to growth levels 3 to 16 hours post elicitation, protein levels remained at fully induced PTI levels up to 16 hours into the transitory phase back to optimal growth. A notable exception were polar auxin transporters PIN3 and PIN7 levels which decreased in PTI but quickly returned to initial homeostasis levels after transition, although global auxin levels only decreased by 20%. Tryptophan, GS and JA biosynthesis proteins all increased in abundance in the wild type and the myc234 mutant background linking induction of the tryptophan and GS biosynthesis pathways to flg22 treatment and PTI independent of MYC2 and homologs. PAPs abundance was depleted in fully induced PTI however not in the myc234 mutant linking this active immune response to these bHLH transcription factors. FERREDOXIN-NADP(+)-OXIDOREDUCTASE (FNR1) synthesis rates decreased while its degradation rate increased in the earlier PTI establisher phase. FNR1 is the penultimate protein in the photosynthetic electron transfer chain and imparts electrons onto NADP+ however in its absence electrons are used for oxygen photoreduction and H2O2 production, an active defense compound. Thus FNR1 may be a molecular switch that switches photosystem activity between growth and defense under post-transcriptional control. The myc234 mutation generally led to delayed changes in transcript and protein abundance and also abolished IAA depletion. Protein turn-over rates of a set of PAPs were affected in the mutant suggesting a possible positive role of the transcription factors in controlling post-transcriptional regulatory processes in PTI induction.","creator":"Abukhalaf, M., Proksch, C., Thieme, D., Ziegler, J., Hoehenwarter, W."},{"title":"Ensemble of BLUP, Machine Learning, and Deep Learning Models Predict Maize Yield Better Than Each Model Alone.","link":"http://biorxiv.org/cgi/content/short/2023.03.30.532932v1?rss=1","abstract":"Predicting phenotypes accurately from genomic, environment, and management factors is key to accelerating the development of novel cultivars with desirable traits. Inclusion of management and environmental factors enables in silico studies to predict the effect of specific management interventions or future climates. Despite the value such models would confer, much work remains to improve the accuracy of phenotypic predictions. Rather than advocate for a single specific modeling strategy, here we demonstrate within large multi-environment and multi-genotype maize trials that combining predictions from disparate models using simple ensemble approaches most often results in better accuracy than using any one of the models on their own. We investigated various ensemble combinations of different model types, model numbers, and model weighting schemes to determine the accuracy of each.  We find that ensembling generally improves performance even when combining only two models. The number and type of models included alter accuracy with improvements diminishing as the number of models included increases. Using a genetic algorithm to optimize ensemble composition reveals that, when weighted by the inverse of each models expected error, using combinations of best linear unbiased predictors, linear fixed effects models, deep learning models, and select machine learning models perform best on our datasets.","creator":"Kick, D. R., Washburn, J. D."},{"title":"Cell polarity linked to gravity sensing is generated by protein translocation from statoliths to the plasma membrane.","link":"http://biorxiv.org/cgi/content/short/2023.03.31.534658v1?rss=1","abstract":"Organisms that have evolved under the gravitational force sense the direction of gravity via statoliths in specialized cells. In the gravitropism of flowering plants, the starch-accumulating plastids, amyloplasts, in gravity sensing cells act as statoliths. The gravity sensing mechanism has long been considered a mechanosensing process by which amyloplasts transmit forces to intracellular structures, but the molecular support has not been reported. This study revealed that LAZY1-LIKE family proteins involved in gravity signaling in statocytes are localized to the amyloplast periphery and its proximal plasma membrane, resulting in polar localization according to the direction of gravity. We propose a gravity sensing mechanism by which LZY transmits the positional information of amyloplasts, i.e., the direction of gravity, by translocating to the plasma membrane.","creator":"Nishimura, T., Mori, S., Shikata, H., Nakamura, M., Hashiguchi, Y., Abe, Y., Hagihara, T., Yoshikawa, H. Y., Toyota, M., Higaki, T., Morita, M. T."},{"title":"A rapid and robust leaf ablation method to visualize bundle sheath cell chloroplasts in C3 species","link":"http://biorxiv.org/cgi/content/short/2023.03.31.535114v1?rss=1","abstract":"BackgroundIt has been proposed that engineering the C4 photosynthetic pathway into C3 crops could significantly increase yield. This goal requires an increase in the chloroplast compartment of bundle sheath cells in C3 species. To facilitate large-scale testing of candidate regulators of chloroplast development in the rice bundle sheath, a simple and robust method to phenotype this tissue in C3 species is required.  ResultsWe established a leaf ablation method to accelerate phenotyping of rice bundle sheath cells. The approach allowed bundle sheath cell dimensions, chloroplast area and chloroplast number per cell to be measured. Using this method, bundle sheath cell dimensions of maize were also measured and compared with rice. Our data show that bundle sheath width but not length significantly differed between C3 rice and C4 maize. Comparison of paradermal versus transverse bundle sheath cell width indicated that bundle sheath cells were intact after leaf ablation. Moreover, comparisons of planar chloroplast areas and chloroplast numbers per bundle sheath cell between wild-type and transgenic rice lines expressing the maize GOLDEN-2 (ZmG2) showed that the leaf ablation method allowed differences in chloroplast parameters to be detected.  ConclusionsLeaf ablation is a simple approach to accessing bundle sheath cell files in C3 species. We show that this method is suitable for obtaining parameters associated with bundle sheath cell size, chloroplast area and chloroplast number per cell.","creator":"Billakurthi, K., Hibberd, J. M."},{"title":"Integrated Phenomics and Genomics reveals genetic loci associated with inflorescence growth in Brassica napus","link":"http://biorxiv.org/cgi/content/short/2023.03.31.535149v1?rss=1","abstract":"A fundamental challenge to the production of climate-resilient crops is how to measure dynamic yield-relevant responses to the environment, such as growth rate, at a scale which informs mechanistic understanding and accelerates breeding. The timing, duration and architectural characteristics of inflorescence growth are crucial for optimising crop productivity and have been targets of selection during domestication. We report a robust and versatile procedure for computationally assessing environmentally-responsive flowering dynamics. In the oilseed crop, Brassica napus, there is wide variation in flowering response to winter cold (vernalization). We subjected a diverse set of B. napus accessions to different vernalization temperatures and monitored shoot responses using automated image acquisition. We developed methods to computationally infer multiple aspects of flowering from this dynamic data, enabling characterisation of speed, duration and peaks of inflorescence development across different crop types. We input these multiple traits to genome- and transcriptome-wide association studies, and identified potentially causative variation in a priori phenology genes (including EARLY FLOWERING3) for known traits and in uncharacterised genes for computed traits. These results could be used in marker assisted breeding to design new ideotypes for improved yield and better adaptation to changing climatic conditions.","creator":"Williams, K., Hepworth, J., Nichols, B. S., Corke, F. M. K., Woolfenden, H. C., Paajanen, P., Steuernagel, B., Ostergaard, L., Morris, R. J., Doonan, J. H., Wells, R."},{"title":"Identification of Iron Deficiency-Induced Chlorosis Tolerant Lines from Wild Rice Germplasm","link":"http://biorxiv.org/cgi/content/short/2023.03.30.534996v1?rss=1","abstract":"The cultivation of transplanted rice has led to depletion of groundwater levels in many parts of the world. Direct-seeded rice under aerobic conditions is an alternative production technology that requires much less water. However, under aerobic conditions, iron in the soil is oxidized from ferric to ferrous, which is not easily available for rice, resulting in iron deficiency-induced chlorosis (IDIC) and a drastic reduction in seed yield. Cultivated rice genotypes have limited variations for IDIC tolerance, therefore, wild Oryza germplasm could be a better source for IDIC tolerance. In this study, 313 Oryza accessions were evaluated for IDIC tolerance at the tillering stage under aerobic conditions using IDIC rating, SPAD value, and iron content in leaves. Based on these parameters, twenty IDIC tolerant lines were selected. These 20 lines exhibited no chlorosis, high SPAD values, and iron content, while 8 cultivated controls showed mild to high chlorosis symptoms and low SPAD and iron content. In a subsequent year, the selected lines were evaluated again to confirm their tolerance, and they exhibited similar levels of tolerance. These accessions may be useful for developing IDIC-tolerant cultivars for aerobic rice cultivation, and future study to understand the molecular mechanism of IDIC tolerance in rice.","creator":"kumar, r."},{"title":"Analysis of Arabidopsis venosa4-0 supports the role of VENOSA4 in dNTP homeostasis","link":"http://biorxiv.org/cgi/content/short/2023.03.30.534755v1?rss=1","abstract":"An imbalance in the deoxyribonucleoside triphosphate (dNTP) pool caused by an increase or decrease in the levels of any of the four dNTPs leads to increased DNA mutations, overloading DNA repair mechanisms. The human protein SAMHD1 (Sterile alpha motif and histidine-aspartate domain containing protein 1) functions as a dNTPase to maintain the balance of the dNTP pool, as well as in DNA repair. In eukaryotes, the limiting step in de novo dNTP synthesis is catalyzed by RIBONUCLEOTIDE REDUCTASE (RNR), which consists of two R1 and two R2 subunits. In Arabidopsis, RNR1 is encoded by CRINKLED LEAVES 8 (CLS8) and RNR2 by three paralogous genes, including TSO2 (TSO MEANING UGLY IN CHINESE 2). In plants, the de novo biosynthesis of purines occurs within the chloroplast, and DOV1 (DIFFERENTIAL DEVELOPMENT OF VASCULAR ASSOCIATED CELLS 1) catalyzes the first step of this pathway. Here, to explore the role of VENOSA4 (VEN4), the most likely Arabidopsis ortholog of human SAMHD1, we studied the ven4-0 mutant. The mutant leaf phenotype caused by the ven4-0 point mutation was stronger than those of T-DNA insertional ven4 mutations. Structural predictions suggested that the E249L amino acid substitution in the mutated VEN4-0 protein rigidifies its 3D structure compared to wild-type VEN4. The morphological phenotypes of the ven4, cls8, and dov1 single mutants were similar, and those of the ven4 tso2 and ven4 dov1 double mutants were synergistic. The ven4-0 mutant had reduced levels of four amino acids related to dNTP biosynthesis, including glutamine and glycine, which are precursors in the de novo purine biosynthesis pathway. Finally, despite its annotation in some databases, At5g40290, a paralog of VEN4, is likely a pseudogene. These observations support the previously proposed role of VEN4 in dNTP metabolism. Our results reveal a high degree of cross-kingdom functional conservation between VEN4 and SAMHD1 in dNTP homeostasis.","creator":"Sarmiento-Manus, R., Gonzalez-Bayon, R., Fontcuberta-Cervera, S., Hannah, M. A., Alvarez-Martinez, F. J., Barrajon-Catalan, E., Micol, V., Quesada, V., Ponce, M. R., Micol, J. L."}]},{"name":"Economics","feed":[{"title":"Measuring Discrete Risks on Infinite Domains: Theoretical Foundations, Conditional Five Number Summaries, and Data Analyses.","link":"http://arxiv.org/abs/2304.02723","abstract":"To accommodate numerous practical scenarios, in this paper we extend statistical inference for smoothed quantile estimators from finite domains to infinite domains. We accomplish the task with the help of a newly designed truncation methodology for discrete loss distributions with infinite domains. A simulation study illustrates the methodology in the case of several distributions, such as Poisson, negative binomial, and their zero inflated versions, which are commonly used in insurance industry to model claim frequencies. Additionally, we propose a very flexible bootstrap-based approach for the use in practice. Using automobile accident data and their modifications, we compute what we have termed the conditional five number summary (C5NS) for the tail risk and construct confidence intervals for each of the five quantiles making up C5NS, and then calculate the tail probabilities. The results show that the smoothed quantile approach classifies the tail riskiness of portfolios not only more accurately but also produces lower coefficients of variation in the estimation of tail probabilities than those obtained using the linear interpolation approach.","creator":"Daoping Yu, Vytaras Brazauskas, Ricardas Zitikis"},{"title":"Efficient OCR for Building a Diverse Digital History.","link":"http://arxiv.org/abs/2304.02737","abstract":"Thousands of users consult digital archives daily, but the information they can access is unrepresentative of the diversity of documentary history. The sequence-to-sequence architecture typically used for optical character recognition (OCR) - which jointly learns a vision and language model - is poorly extensible to low-resource document collections, as learning a language-vision model requires extensive labeled sequences and compute. This study models OCR as a character level image retrieval problem, using a contrastively trained vision encoder. Because the model only learns characters' visual features, it is more sample efficient and extensible than existing architectures, enabling accurate OCR in settings where existing solutions fail. Crucially, the model opens new avenues for community engagement in making digital history more representative of documentary history.","creator":"Jacob Carlson, Tom Bryan, Melissa Dell"},{"title":"Covert learning and disclosure.","link":"http://arxiv.org/abs/2304.02989","abstract":"I study a model of information acquisition and transmission in which the sender's ability to misreport her findings is limited. In equilibrium, the sender only influences the receiver by choosing to remain selectively ignorant, rather than by deceiving her about the discoveries. Although deception does not occur, I highlight how deception possibilities determine what information the sender chooses to acquire and transmit. I then turn to comparative statics, characterizing in which sense the sender benefits from her claims being more verifiable, showing this is akin to increasing her commitment power. Finally, I characterize sender- and receiver-optimal falsification environments.","creator":"Matteo Escud&#xe9;"},{"title":"Adaptive Student's t-distribution with method of moments moving estimator for nonstationary time series.","link":"http://arxiv.org/abs/2304.03069","abstract":"The real life time series are usually nonstationary, bringing a difficult question of model adaptation. Classical approaches like GARCH assume arbitrary type of dependence. To prevent such bias, we will focus on recently proposed agnostic philosophy of moving estimator: in time $t$ finding parameters optimizing e.g. $F_t=\\sum_{\\tau&lt;t} (1-\\eta)^{t-\\tau} \\ln(\\rho_\\theta (x_\\tau))$ moving log-likelihood, evolving in time. It allows for example to estimate parameters using inexpensive exponential moving averages (EMA), like absolute central moments $E[|x-\\mu|^p]$ evolving with $m_{p,t+1} = m_{p,t} + \\eta (|x_t-\\mu_t|^p-m_{p,t})$ for one or multiple powers $p\\in\\mathbb{R}^+$. Application of such general adaptive methods of moments will be presented on Student's t-distribution, popular especially in economical applications, here applied to log-returns of DJIA companies.","creator":"Jarek Duda"},{"title":"Distribution Regression with Sample Selection, with an Application to Wage Decompositions in the UK.","link":"http://arxiv.org/abs/1811.11603","abstract":"We develop a distribution regression model under endogenous sample selection. This model is a semi-parametric generalization of the Heckman selection model. It accommodates much richer effects of the covariates on outcome distribution and patterns of heterogeneity in the selection process, and allows for drastic departures from the Gaussian error structure, while maintaining the same level tractability as the classical model. The model applies to continuous, discrete and mixed outcomes. We provide identification, estimation, and inference methods, and apply them to obtain wage decomposition for the UK. Here we decompose the difference between the male and female wage distributions into composition, wage structure, selection structure, and selection sorting effects. After controlling for endogenous employment selection, we still find substantial gender wage gap -- ranging from 21\\% to 40\\% throughout the (latent) offered wage distribution that is not explained by composition. We also uncover positive sorting for single men and negative sorting for married women that accounts for a substantive fraction of the gender wage gap at the top of the distribution.","creator":"Victor Chernozhukov, Iv&#xe1;n Fern&#xe1;ndez-Val, Siyi Luo"},{"title":"Functional Principal Component Analysis for Cointegrated Functional Time Series.","link":"http://arxiv.org/abs/2011.12781","abstract":"Functional principal component analysis (FPCA) has played an important role in the development of functional time series analysis. This note investigates how FPCA can be used to analyze cointegrated functional time series and proposes a modification of FPCA as a novel statistical tool. Our modified FPCA not only provides an asymptotically more efficient estimator of the cointegrating vectors, but also leads to novel FPCA-based tests for examining essential properties of cointegrated functional time series.","creator":"Won-Ki Seo"},{"title":"Sharp Bounds in the Latent Index Selection Model.","link":"http://arxiv.org/abs/2012.02390","abstract":"A fundamental question underlying the literature on partial identification is: what can we learn about parameters that are relevant for policy but not necessarily point-identified by the exogenous variation we observe? This paper provides an answer in terms of sharp, analytic characterizations and bounds for an important class of policy-relevant treatment effects, consisting of marginal treatment effects and linear functionals thereof, in the latent index selection model as formalized in Vytlacil (2002). The sharp bounds use the full content of identified marginal distributions, and analytic derivations rely on the theory of stochastic orders. The proposed methods also make it possible to sharply incorporate new auxiliary assumptions on distributions into the latent index selection framework. Empirically, I apply the methods to study the effects of Medicaid on emergency room utilization in the Oregon Health Insurance Experiment, showing that the predictions from extrapolations based on a distribution assumption (rank similarity) differ substantively and consistently from existing extrapolations based on a parametric mean assumption (linearity). This underscores the value of utilizing the model's full empirical content in combination with auxiliary assumptions.","creator":"Philip Marx"},{"title":"Treatment Choice with Nonlinear Regret.","link":"http://arxiv.org/abs/2205.08586","abstract":"The literature focuses on minimizing the mean of welfare regret, which can lead to undesirable treatment choice due to sampling uncertainty. We propose to minimize the mean of a nonlinear transformation of regret and show that admissible rules are fractional for nonlinear regret. Focusing on mean square regret, we derive closed-form fractions for finite-sample Bayes and minimax optimal rules. Our approach is grounded in decision theory and extends to limit experiments. The treatment fractions can be viewed as the strength of evidence favoring treatment. We apply our framework to a normal regression model and sample size calculations in randomized experiments.","creator":"Toru Kitagawa, Sokbae Lee, Chen Qiu"},{"title":"Prolonged Learning and Hasty Stopping: the Wald Problem with Ambiguity.","link":"http://arxiv.org/abs/2208.14121","abstract":"This paper studies sequential information acquisition by an ambiguity-averse decision maker (DM), who decides how long to collect information before taking an irreversible action. The agent optimizes against the worst-case belief and updates prior by prior. We show that the consideration of ambiguity gives rise to rich dynamics: compared to the Bayesian DM, the DM here tends to experiment excessively when facing modest uncertainty and, to counteract it, may stop experimenting prematurely when facing high uncertainty. In the latter case, the DM's stopping rule is non-monotonic in beliefs and features randomized stopping.","creator":"Sarah Auster, Yeon-Koo Che, Konrad Mierendorff"}]}]