[
  {
    "name": "Artificial Intelligence",
    "feed": [
      {
        "title": "CoSyn: Detecting Implicit Hate Speech in Online Conversations Using a Context Synergized Hyperbolic Network.",
        "link": "http://arxiv.org/abs/2303.03387",
        "abstract": "The tremendous growth of social media users interacting in online conversations has also led to significant growth in hate speech. Most of the prior works focus on detecting explicit hate speech, which is overt and leverages hateful phrases, with very little work focusing on detecting hate speech that is implicit or denotes hatred through indirect or coded language. In this paper, we present CoSyn, a user- and conversational-context synergized network for detecting implicit hate speech in online conversation trees. CoSyn first models the user's personal historical and social context using a novel hyperbolic Fourier attention mechanism and hyperbolic graph convolution network. Next, we jointly model the user's personal context and the conversational context using a novel context interaction mechanism in the hyperbolic space that clearly captures the interplay between the two and makes independent assessments on the amounts of information to be retrieved from both contexts. CoSyn performs all operations in the hyperbolic space to account for the scale-free dynamics of social media. We demonstrate the effectiveness of CoSyn both qualitatively and quantitatively on an open-source hate speech dataset with Twitter conversations and show that CoSyn outperforms all our baselines in detecting implicit hate speech with absolute improvements in the range of 8.15% - 19.50%.",
        "creator": "Sreyan Ghosh, Manan Suri, Purva Chiniya, Utkarsh Tyagi, Sonal Kumar, Dinesh Manocha"
      },
      {
        "title": "Multi-modal Multi-kernel Graph Learning for Autism Prediction and Biomarker Discovery.",
        "link": "http://arxiv.org/abs/2303.03388",
        "abstract": "Multi-modal integration and classification based on graph learning is among the most challenging obstacles in disease prediction due to its complexity. Several recent works on the basis of attentional mechanisms have been proposed to disentangle the problem of multi-modal integration. However, there are certain limitations to these techniques. Primarily, these works focus on explicitly integrating at the feature level using weight scores, which cannot effectively address the negative impact between modalities. Next, a majority of them utilize single-sized filters to extract graph features, ignoring the heterogeneous information over graphs. To overcome these drawbacks, we propose MMKGL (Multi-modal Multi-Kernel Graph Learning). For the problem of negative impact between modalities, we use the multi-modal graph embedding module to construct a multi-modal graph. Different from the traditional manual construction of static graphs, a separate graph is generated for each modality by graph adaptive learning, where a function graph and a supervision graph are introduced for optimiztion during the multi-graph fusion embedding process. We then apply the multi-kernel graph learning module to extract heterogeneous information from the multi-modal graph. The information in the multi-modal graph at different levels is aggregated by convolutional kernels with different receptive field sizes, followed by generating a cross-kernel discovery tensor for disease prediction. Our method is evaluated on the benchmark Autism Brain Imaging Data Exchange (ABIDE) dataset and outperforms the state-of-the-art methods. In addition, discriminative brain regions associated with autism are identified by our model, providing guidance for the study of autism pathology.",
        "creator": "Junbin Mao, Jin Liu, Hanhe Lin, Hulin Kuang, Yi Pan"
      },
      {
        "title": "Contrastive Hierarchical Clustering.",
        "link": "http://arxiv.org/abs/2303.03389",
        "abstract": "Deep clustering has been dominated by flat models, which split a dataset into a predefined number of groups. Although recent methods achieve an extremely high similarity with the ground truth on popular benchmarks, the information contained in the flat partition is limited. In this paper, we introduce CoHiClust, a Contrastive Hierarchical Clustering model based on deep neural networks, which can be applied to typical image data. By employing a self-supervised learning approach, CoHiClust distills the base network into a binary tree without access to any labeled data. The hierarchical clustering structure can be used to analyze the relationship between clusters, as well as to measure the similarity between data points. Experiments demonstrate that CoHiClust generates a reasonable structure of clusters, which is consistent with our intuition and image semantics. Moreover, it obtains superior clustering accuracy on most of the image datasets compared to the state-of-the-art flat clustering models.",
        "creator": "Micha&#x142; Znale&#x17a;niak, Przemys&#x142;aw Rola, Patryk Kaszuba, Jacek Tabor, Marek &#x15a;mieja"
      },
      {
        "title": "Decision Transformer under Random Frame Dropping.",
        "link": "http://arxiv.org/abs/2303.03391",
        "abstract": "Controlling agents remotely with deep reinforcement learning~(DRL) in the real world is yet to come. One crucial stepping stone is to devise RL algorithms that are robust in the face of dropped information from corrupted communication or malfunctioning sensors. Typical RL methods usually require considerable online interaction data that are costly and unsafe to collect in the real world. Furthermore, when applying to the frame dropping scenarios, they perform unsatisfactorily even with moderate drop rates. To address these issues, we propose Decision Transformer under Random Frame Dropping~(DeFog), an offline RL algorithm that enables agents to act robustly in frame dropping scenarios without online interaction. DeFog first randomly masks out data in the offline datasets and explicitly adds the time span of frame dropping as inputs. After that, a finetuning stage on the same offline dataset with a higher mask rate would further boost the performance. Empirical results show that DeFog outperforms strong baselines under severe frame drop rates like 90\\%, while maintaining similar returns under non-frame-dropping conditions in the regular MuJoCo control benchmarks and the Atari environments. Our approach offers a robust and deployable solution for controlling agents in real-world environments with limited or unreliable data.",
        "creator": "Kaizhe Hu, Ray Chen Zheng, Yang Gao, Huazhe Xu"
      },
      {
        "title": "Agent-based Collaborative Random Search for Hyper-parameter Tuning and Global Function Optimization.",
        "link": "http://arxiv.org/abs/2303.03394",
        "abstract": "Hyper-parameter optimization is one of the most tedious yet crucial steps in training machine learning models. There are numerous methods for this vital model-building stage, ranging from domain-specific manual tuning guidelines suggested by the oracles to the utilization of general-purpose black-box optimization techniques. This paper proposes an agent-based collaborative technique for finding near-optimal values for any arbitrary set of hyper-parameters (or decision variables) in a machine learning model (or general function optimization problem). The developed method forms a hierarchical agent-based architecture for the distribution of the searching operations at different dimensions and employs a cooperative searching procedure based on an adaptive width-based random sampling technique to locate the optima. The behavior of the presented model, specifically against the changes in its design parameters, is investigated in both machine learning and global function optimization applications, and its performance is compared with that of two randomized tuning strategies that are commonly used in practice. According to the empirical results, the proposed model outperformed the compared methods in the experimented classification, regression, and multi-dimensional function optimization tasks, notably in a higher number of dimensions and in the presence of limited on-device computational resources.",
        "creator": "Ahmad Esmaeili, Zahra Ghorrati, Eric T. Matson"
      },
      {
        "title": "Demonstration-guided Deep Reinforcement Learning for Coordinated Ramp Metering and Perimeter Control in Large Scale Networks.",
        "link": "http://arxiv.org/abs/2303.03395",
        "abstract": "Effective traffic control methods have great potential in alleviating network congestion. Existing literature generally focuses on a single control approach, while few studies have explored the effectiveness of integrated and coordinated control approaches. This study considers two representative control approaches: ramp metering for freeways and perimeter control for homogeneous urban roads, and we aim to develop a deep reinforcement learning (DRL)-based coordinated control framework for large-scale networks. The main challenges are 1) there is a lack of efficient dynamic models for both freeways and urban roads; 2) the standard DRL method becomes ineffective due to the complex and non-stationary network dynamics. In view of this, we propose a novel meso-macro dynamic network model and first time develop a demonstration-guided DRL method to achieve large-scale coordinated ramp metering and perimeter control. The dynamic network model hybridizes the link and generalized bathtub models to depict the traffic dynamics of freeways and urban roads, respectively. For the DRL method, we incorporate demonstration to guide the DRL method for better convergence by introducing the concept of \"teacher\" and \"student\" models. The teacher models are traditional controllers (e.g., ALINEA, Gating), which provide control demonstrations. The student models are DRL methods, which learn from the teacher and aim to surpass the teacher's performance. To validate the proposed framework, we conduct two case studies in a small-scale network and a real-world large-scale traffic network in Hong Kong. The research outcome reveals the great potential of combining traditional controllers with DRL for coordinated control in large-scale networks.",
        "creator": "Zijian Hu, Wei Ma"
      },
      {
        "title": "AERK: Aligned Entropic Reproducing Kernels through Continuous-time Quantum Walks.",
        "link": "http://arxiv.org/abs/2303.03396",
        "abstract": "In this work, we develop an Aligned Entropic Reproducing Kernel (AERK) for graph classification. We commence by performing the Continuous-time Quantum Walk (CTQW) on each graph structure, and computing the Averaged Mixing Matrix (AMM) to describe how the CTQW visit all vertices from a starting vertex. More specifically, we show how this AMM matrix allows us to compute a quantum Shannon entropy for each vertex of a graph. For pairwise graphs, the proposed AERK kernel is defined by computing a reproducing kernel based similarity between the quantum Shannon entropies of their each pair of aligned vertices. The analysis of theoretical properties reveals that the proposed AERK kernel cannot only address the shortcoming of neglecting the structural correspondence information between graphs arising in most existing R-convolution graph kernels, but also overcome the problem of neglecting the structural differences between pairs of aligned vertices arising in existing vertex-based matching kernels. Moreover, unlike existing classical graph kernels that only focus on the global or local structural information of graphs, the proposed AERK kernel can simultaneously capture both global and local structural information through the quantum Shannon entropies, reflecting more precise kernel based similarity measures between pairs of graphs. The above theoretical properties explain the effectiveness of the proposed kernel. The experimental evaluation on standard graph datasets demonstrates that the proposed AERK kernel is able to outperform state-of-the-art graph kernels for graph classification tasks.",
        "creator": "Lixin Cui, Ming Li, Yue Wang, Lu Bai, Edwin R. Hancock"
      },
      {
        "title": "Testing the Channels of Convolutional Neural Networks.",
        "link": "http://arxiv.org/abs/2303.03400",
        "abstract": "Neural networks have complex structures, and thus it is hard to understand their inner workings and ensure correctness. To understand and debug convolutional neural networks (CNNs) we propose techniques for testing the channels of CNNs. We design FtGAN, an extension to GAN, that can generate test data with varying the intensity (i.e., sum of the neurons) of a channel of a target CNN. We also proposed a channel selection algorithm to find representative channels for testing. To efficiently inspect the target CNN's inference computations, we define unexpectedness score, which estimates how similar the inference computation of the test data is to that of the training data. We evaluated FtGAN with five public datasets and showed that our techniques successfully identify defective channels in five different CNN models.",
        "creator": "Kang Choi, Donghyun Son, Younghoon Kim, Jiwon Seo"
      },
      {
        "title": "Towards Composable Distributions of Latent Space Augmentations.",
        "link": "http://arxiv.org/abs/2303.03462",
        "abstract": "We propose a composable framework for latent space image augmentation that allows for easy combination of multiple augmentations. Image augmentation has been shown to be an effective technique for improving the performance of a wide variety of image classification and generation tasks. Our framework is based on the Variational Autoencoder architecture and uses a novel approach for augmentation via linear transformation within the latent space itself. We explore losses and augmentation latent geometry to enforce the transformations to be composable and involuntary, thus allowing the transformations to be readily combined or inverted. Finally, we show these properties are better performing with certain pairs of augmentations, but we can transfer the latent space to other sets of augmentations to modify performance, effectively constraining the VAE's bottleneck to preserve the variance of specific augmentations and features of the image which we care about. We demonstrate the effectiveness of our approach with initial results on the MNIST dataset against both a standard VAE and a Conditional VAE. This latent augmentation method allows for much greater control and geometric interpretability of the latent space, making it a valuable tool for researchers and practitioners in the field.",
        "creator": "Omead Pooladzandi, Jeffrey Jiang, Sunay Bhat, Gregory Pottie"
      },
      {
        "title": "Rolling Horizon based Temporal Decomposition for the Offline Pickup and Delivery Problem with Time Windows.",
        "link": "http://arxiv.org/abs/2303.03475",
        "abstract": "The offline pickup and delivery problem with time windows (PDPTW) is a classical combinatorial optimization problem in the transportation community, which has proven to be very challenging computationally. Due to the complexity of the problem, practical problem instances can be solved only via heuristics, which trade-off solution quality for computational tractability. Among the various heuristics, a common strategy is problem decomposition, that is, the reduction of a large-scale problem into a collection of smaller sub-problems, with spatial and temporal decompositions being two natural approaches. While spatial decomposition has been successful in certain settings, effective temporal decomposition has been challenging due to the difficulty of stitching together the sub-problem solutions across the decomposition boundaries. In this work, we introduce a novel temporal decomposition scheme for solving a class of PDPTWs that have narrow time windows, for which it is able to provide both fast and high-quality solutions. We utilize techniques that have been popularized recently in the context of online dial-a-ride problems along with the general idea of rolling horizon optimization. To the best of our knowledge, this is the first attempt to solve offline PDPTWs using such an approach. To show the performance and scalability of our framework, we use the optimization of paratransit services as a motivating example. We compare our results with an offline heuristic algorithm using Google OR-Tools. In smaller problem instances, the baseline approach is as competitive as our framework. However, in larger problem instances, our framework is more scalable and can provide good solutions to problem instances of varying degrees of difficulty, while the baseline algorithm often fails to find a feasible solution within comparable compute times.",
        "creator": "Youngseo Kim, Danushka Edirimanna, Michael Wilbur, Philip Pugliese, Aron Laszka, Abhishek Dubey, Samitha Samaranayake"
      },
      {
        "title": "Can an Embodied Agent Find Your \"Cat-shaped Mug\"? LLM-Based Zero-Shot Object Navigation.",
        "link": "http://arxiv.org/abs/2303.03480",
        "abstract": "We present LGX, a novel algorithm for Object Goal Navigation in a \"language-driven, zero-shot manner\", where an embodied agent navigates to an arbitrarily described target object in a previously unexplored environment. Our approach leverages the capabilities of Large Language Models (LLMs) for making navigational decisions by mapping the LLMs implicit knowledge about the semantic context of the environment into sequential inputs for robot motion planning. Simultaneously, we also conduct generalized target object detection using a pre-trained Vision-Language grounding model. We achieve state-of-the-art zero-shot object navigation results on RoboTHOR with a success rate (SR) improvement of over 27% over the current baseline of the OWL-ViT CLIP on Wheels (OWL CoW). Furthermore, we study the usage of LLMs for robot navigation and present an analysis of the various semantic factors affecting model output. Finally, we showcase the benefits of our approach via real-world experiments that indicate the superior performance of LGX when navigating to and detecting visually unique objects.",
        "creator": "Vishnu Sashank Dorbala, James F. Mullen Jr., Dinesh Manocha"
      },
      {
        "title": "Two-stage Pipeline for Multilingual Dialect Detection.",
        "link": "http://arxiv.org/abs/2303.03487",
        "abstract": "Dialect Identification is a crucial task for localizing various Large Language Models. This paper outlines our approach to the VarDial 2023 shared task. Here we have to identify three or two dialects from three languages each which results in a 9-way classification for Track-1 and 6-way classification for Track-2 respectively. Our proposed approach consists of a two-stage system and outperforms other participants' systems and previous works in this domain. We achieve a score of 58.54% for Track-1 and 85.61% for Track-2. Our codebase is available publicly (https://github.com/ankit-vaidya19/EACL_VarDial2023).",
        "creator": "Ankit Vaidya, Aditya Kane"
      },
      {
        "title": "A Comparison of Methods for Neural Network Aggregation.",
        "link": "http://arxiv.org/abs/2303.03488",
        "abstract": "Deep learning has been successful in the theoretical aspect. For deep learning to succeed in industry, we need to have algorithms capable of handling many inconsistencies appearing in real data. These inconsistencies can have large effects on the implementation of a deep learning algorithm. Artificial Intelligence is currently changing the medical industry. However, receiving authorization to use medical data for training machine learning algorithms is a huge hurdle. A possible solution is sharing the data without sharing the patient information. We propose a multi-party computation protocol for the deep learning algorithm. The protocol enables to conserve both the privacy and the security of the training data. Three approaches of neural networks assembly are analyzed: transfer learning, average ensemble learning, and series network learning. The results are compared to approaches based on data-sharing in different experiments. We analyze the security issues of the proposed protocol. Although the analysis is based on medical data, the results of multi-party computation of machine learning training are theoretical and can be implemented in multiple research areas.",
        "creator": "John Pomerat, Aviv Segev"
      },
      {
        "title": "Memory Maps for Video Object Detection and Tracking on UAVs.",
        "link": "http://arxiv.org/abs/2303.03508",
        "abstract": "This paper introduces a novel approach to video object detection detection and tracking on Unmanned Aerial Vehicles (UAVs). By incorporating metadata, the proposed approach creates a memory map of object locations in actual world coordinates, providing a more robust and interpretable representation of object locations in both, image space and the real world. We use this representation to boost confidences, resulting in improved performance for several temporal computer vision tasks, such as video object detection, short and long-term single and multi-object tracking, and video anomaly detection. These findings confirm the benefits of metadata in enhancing the capabilities of UAVs in the field of temporal computer vision and pave the way for further advancements in this area.",
        "creator": "Benjamin Kiefer, Yitong Quan, Andreas Zell"
      },
      {
        "title": "Applying Artificial Intelligence to Clinical Decision Support in Mental Health: What Have We Learned?.",
        "link": "http://arxiv.org/abs/2303.03511",
        "abstract": "Clinical decision support systems (CDSS) augmented with artificial intelligence (AI) models are emerging as potentially valuable tools in healthcare. Despite their promise, the development and implementation of these systems typically encounter several barriers, hindering the potential for widespread adoption. Here we present a case study of a recently developed AI-CDSS, Aifred Health, aimed at supporting the selection and management of treatment in major depressive disorder. We consider both the principles espoused during development and testing of this AI-CDSS, as well as the practical solutions developed to facilitate implementation. We also propose recommendations to consider throughout the building, validation, training, and implementation process of an AI-CDSS. These recommendations include: identifying the key problem, selecting the type of machine learning approach based on this problem, determining the type of data required, determining the format required for a CDSS to provide clinical utility, gathering physician and patient feedback, and validating the tool across multiple settings. Finally, we explore the potential benefits of widespread adoption of these systems, while balancing these against implementation challenges such as ensuring systems do not disrupt the clinical workflow, and designing systems in a manner that engenders trust on the part of end users.",
        "creator": "Grace Golden, Christina Popescu, Sonia Israel, Kelly Perlman, Caitrin Armstrong, Robert Fratila, Myriam Tanguay-Sela, David Benrimoh"
      },
      {
        "title": "Value Guided Exploration with Sub-optimal Controllers for Learning Dexterous Manipulation.",
        "link": "http://arxiv.org/abs/2303.03533",
        "abstract": "Recently, reinforcement learning has allowed dexterous manipulation skills with increasing complexity. Nonetheless, learning these skills in simulation still exhibits poor sample-efficiency which stems from the fact these skills are learned from scratch without the benefit of any domain expertise. In this work, we aim to improve the sample-efficiency of learning dexterous in-hand manipulation skills using sub-optimal controllers available via domain knowledge. Our framework optimally queries the sub-optimal controllers and guides exploration toward state-space relevant to the task thereby demonstrating improved sample complexity. We show that our framework allows learning from highly sub-optimal controllers and we are the first to demonstrate learning hard-to-explore finger-gaiting in-hand manipulation skills without the use of an exploratory reset distribution.",
        "creator": "Gagan Khandate, Cameron Mehlman, Xingsheng Wei, Matei Ciocarlie"
      },
      {
        "title": "Evolutionary Deep Nets for Non-Intrusive Load Monitoring.",
        "link": "http://arxiv.org/abs/2303.03538",
        "abstract": "Non-Intrusive Load Monitoring (NILM) is an energy efficiency technique to track electricity consumption of an individual appliance in a household by one aggregated single, such as building level meter readings. The goal of NILM is to disaggregate the appliance from the aggregated singles by computational method. In this work, deep learning approaches are implemented to operate the desegregations. Deep neural networks, convolutional neural networks, and recurrent neural networks are employed for this operation. Additionally, sparse evolutionary training is applied to accelerate training efficiency of each deep learning model. UK-Dale dataset is used for this work.",
        "creator": "Jinsong Wang, Kenneth A. Loparo"
      },
      {
        "title": "Multi-resolution Interpretation and Diagnostics Tool for Natural Language Classifiers.",
        "link": "http://arxiv.org/abs/2303.03542",
        "abstract": "Developing explainability methods for Natural Language Processing (NLP) models is a challenging task, for two main reasons. First, the high dimensionality of the data (large number of tokens) results in low coverage and in turn small contributions for the top tokens, compared to the overall model performance. Second, owing to their textual nature, the input variables, after appropriate transformations, are effectively binary (presence or absence of a token in an observation), making the input-output relationship difficult to understand. Common NLP interpretation techniques do not have flexibility in resolution, because they usually operate at word-level and provide fully local (message level) or fully global (over all messages) summaries. The goal of this paper is to create more flexible model explainability summaries by segments of observation or clusters of words that are semantically related to each other. In addition, we introduce a root cause analysis method for NLP models, by analyzing representative False Positive and False Negative examples from different segments. At the end, we illustrate, using a Yelp review data set with three segments (Restaurant, Hotel, and Beauty), that exploiting group/cluster structures in words and/or messages can aid in the interpretation of decisions made by NLP models and can be utilized to assess the model's sensitivity or bias towards gender, syntax, and word meanings.",
        "creator": "Peyman Jalali, Nengfeng Zhou, Yufei Yu"
      },
      {
        "title": "Learning When to Treat Business Processes: Prescriptive Process Monitoring with Causal Inference and Reinforcement Learning.",
        "link": "http://arxiv.org/abs/2303.03572",
        "abstract": "Increasing the success rate of a process, i.e. the percentage of cases that end in a positive outcome, is a recurrent process improvement goal. At runtime, there are often certain actions (a.k.a. treatments) that workers may execute to lift the probability that a case ends in a positive outcome. For example, in a loan origination process, a possible treatment is to issue multiple loan offers to increase the probability that the customer takes a loan. Each treatment has a cost. Thus, when defining policies for prescribing treatments to cases, managers need to consider the net gain of the treatments. Also, the effect of a treatment varies over time: treating a case earlier may be more effective than later in a case. This paper presents a prescriptive monitoring method that automates this decision-making task. The method combines causal inference and reinforcement learning to learn treatment policies that maximize the net gain. The method leverages a conformal prediction technique to speed up the convergence of the reinforcement learning mechanism by separating cases that are likely to end up in a positive or negative outcome, from uncertain cases. An evaluation on two real-life datasets shows that the proposed method outperforms a state-of-the-art baseline.",
        "creator": "Zahra Dasht Bozorgi, Marlon Dumas, Marcello La Rosa, Artem Polyvyanyy, Mahmoud Shoush, Irene Teinemaa"
      },
      {
        "title": "Neural Compositional Rule Learning for Knowledge Graph Reasoning.",
        "link": "http://arxiv.org/abs/2303.03581",
        "abstract": "Learning logical rules is critical to improving reasoning in KGs. This is due to their ability to provide logical and interpretable explanations when used for predictions, as well as their ability to generalize to other tasks, domains, and data. While recent methods have been proposed to learn logical rules, the majority of these methods are either restricted by their computational complexity and can not handle the large search space of large-scale KGs, or show poor generalization when exposed to data outside the training set. In this paper, we propose an end-to-end neural model for learning compositional logical rules called NCRL. NCRL detects the best compositional structure of a rule body, and breaks it into small compositions in order to infer the rule head. By recurrently merging compositions in the rule body with a recurrent attention unit, NCRL finally predicts a single rule head. Experimental results show that NCRL learns high-quality rules, as well as being generalizable. Specifically, we show that NCRL is scalable, efficient, and yields state-of-the-art results for knowledge graph completion on large-scale KGs. Moreover, we test NCRL for systematic generalization by learning to reason on small-scale observed graphs and evaluating on larger unseen ones.",
        "creator": "Kewei Cheng, Nesreen K. Ahmed, Yizhou Sun"
      },
      {
        "title": "Data Games: A Game-Theoretic Approach to Swarm Robotic Data Collection.",
        "link": "http://arxiv.org/abs/2303.03602",
        "abstract": "Fleets of networked autonomous vehicles (AVs) collect terabytes of sensory data, which is often transmitted to central servers (the ''cloud'') for training machine learning (ML) models. Ideally, these fleets should upload all their data, especially from rare operating contexts, in order to train robust ML models. However, this is infeasible due to prohibitive network bandwidth and data labeling costs. Instead, we propose a cooperative data sampling strategy where geo-distributed AVs collaborate to collect a diverse ML training dataset in the cloud. Since the AVs have a shared objective but minimal information about each other's local data distribution and perception model, we can naturally cast cooperative data collection as an $N$-player mathematical game. We show that our cooperative sampling strategy uses minimal information to converge to a centralized oracle policy with complete information about all AVs. Moreover, we theoretically characterize the performance benefits of our game-theoretic strategy compared to greedy sampling. Finally, we experimentally demonstrate that our method outperforms standard benchmarks by up to $21.9\\%$ on 4 perception datasets, including for autonomous driving in adverse weather conditions. Crucially, our experimental results on real-world datasets closely align with our theoretical guarantees.",
        "creator": "Oguzhan Akcin, Po-han Li, Shubhankar Agarwal, Sandeep Chinchali"
      },
      {
        "title": "Collaboration with Conversational AI Assistants for UX Evaluation: Questions and How to Ask them (Voice vs. Text).",
        "link": "http://arxiv.org/abs/2303.03638",
        "abstract": "AI is promising in assisting UX evaluators with analyzing usability tests, but its judgments are typically presented as non-interactive visualizations. Evaluators may have questions about test recordings, but have no way of asking them. Interactive conversational assistants provide a Q&amp;A dynamic that may improve analysis efficiency and evaluator autonomy. To understand the full range of analysis-related questions, we conducted a Wizard-of-Oz design probe study with 20 participants who interacted with simulated AI assistants via text or voice. We found that participants asked for five categories of information: user actions, user mental model, help from the AI assistant, product and task information, and user demographics. Those who used the text assistant asked more questions, but the question lengths were similar. The text assistant was perceived as significantly more efficient, but both were rated equally in satisfaction and trust. We also provide design considerations for future conversational AI assistants for UX evaluation.",
        "creator": "Emily Kuang, Ehsan Jahangirzadeh Soure, Mingming Fan, Jian Zhao, Kristen Shinohara"
      },
      {
        "title": "Training Machine Learning Models to Characterize Temporal Evolution of Disadvantaged Communities.",
        "link": "http://arxiv.org/abs/2303.03677",
        "abstract": "Disadvantaged communities (DAC), as defined by the Justice40 initiative of the Department of Energy (DOE), USA, identifies census tracts across the USA to determine where benefits of climate and energy investments are or are not currently accruing. The DAC status not only helps in determining the eligibility for future Justice40-related investments but is also critical for exploring ways to achieve equitable distribution of resources. However, designing inclusive and equitable strategies not just requires a good understanding of current demographics, but also a deeper analysis of the transformations that happened in those demographics over the years. In this paper, machine learning (ML) models are trained on publicly available census data from recent years to classify the DAC status at the census tracts level and then the trained model is used to classify DAC status for historical years. A detailed analysis of the feature and model selection along with the evolution of disadvantaged communities between 2013 and 2018 is presented in this study.",
        "creator": "Milan Jain, Narmadha Meenu Mohankumar, Heng Wan, Sumitrra Ganguly, Kyle D Wilson, David M Anderson"
      },
      {
        "title": "Bootstrap The Original Latent: Freeze-and-thaw Adapter for Back-Propagated Black-Box Adaptation.",
        "link": "http://arxiv.org/abs/2303.03709",
        "abstract": "In this paper, considering the balance of data/model privacy of model owners and user needs, we propose a new setting called Back-Propagated Black-Box Adaptation (BPBA) for users to better train their private models via the guidance of the back-propagated results of foundation/source models. Our setting can ease the usage of foundation/source models as well as prevent the leakage and misuse of foundation/source models. Moreover, we also propose a new training strategy called Bootstrap The Original Latent (BTOL) to fully utilize the foundation/source models. Our strategy consists of a domain adapter and a freeze-and-thaw strategy. We apply our BTOL under BPBA and Black-box UDA settings on three different datasets. Experiments show that our strategy is efficient and robust in various settings without manual augmentations.",
        "creator": "Shuai Wang, Daoan Zhang, Jianguo Zhang, Weiwei Zhang, Rui Li"
      },
      {
        "title": "Generative Modeling with Flow-Guided Density Ratio Learning.",
        "link": "http://arxiv.org/abs/2303.03714",
        "abstract": "We present Flow-Guided Density Ratio Learning (FDRL), a simple and scalable approach to generative modeling which builds on the stale (time-independent) approximation of the gradient flow of entropy-regularized f-divergences introduced in DGflow. In DGflow, the intractable time-dependent density ratio is approximated by a stale estimator given by a GAN discriminator. This is sufficient in the case of sample refinement, where the source and target distributions of the flow are close to each other. However, this assumption is invalid for generation and a naive application of the stale estimator fails due to the large chasm between the two distributions. FDRL proposes to train a density ratio estimator such that it learns from progressively improving samples during the training process. We show that this simple method alleviates the density chasm problem, allowing FDRL to generate images of dimensions as high as $128\\times128$, as well as outperform existing gradient flow baselines on quantitative benchmarks. We also show the flexibility of FDRL with two use cases. First, unconditional FDRL can be easily composed with external classifiers to perform class-conditional generation. Second, FDRL can be directly applied to unpaired image-to-image translation with no modifications needed to the framework. Code is publicly available at https://github.com/ajrheng/FDRL.",
        "creator": "Alvin Heng, Abdul Fatir Ansari, Harold Soh"
      },
      {
        "title": "Graph Decision Transformer.",
        "link": "http://arxiv.org/abs/2303.03747",
        "abstract": "Offline reinforcement learning (RL) is a challenging task, whose objective is to learn policies from static trajectory data without interacting with the environment. Recently, offline RL has been viewed as a sequence modeling problem, where an agent generates a sequence of subsequent actions based on a set of static transition experiences. However, existing approaches that use transformers to attend to all tokens naively can overlook the dependencies between different tokens and limit long-term dependency learning. In this paper, we propose the Graph Decision Transformer (GDT), a novel offline RL approach that models the input sequence into a causal graph to capture potential dependencies between fundamentally different concepts and facilitate temporal and causal relationship learning. GDT uses a graph transformer to process the graph inputs with relation-enhanced mechanisms, and an optional sequence transformer to handle fine-grained spatial information in visual tasks. Our experiments show that GDT matches or surpasses the performance of state-of-the-art offline RL methods on image-based Atari and OpenAI Gym.",
        "creator": "Shengchao Hu, Li Shen, Ya Zhang, Dacheng Tao"
      },
      {
        "title": "Zeroth-Order Optimization Meets Human Feedback: Provable Learning via Ranking Oracles.",
        "link": "http://arxiv.org/abs/2303.03751",
        "abstract": "In this paper, we focus on a novel optimization problem in which the objective function is a black-box and can only be evaluated through a ranking oracle. This problem is common in real-world applications, particularly in cases where the function is assessed by human judges. Reinforcement Learning with Human Feedback (RLHF) is a prominent example of such an application, which is adopted by the recent works \\cite{ouyang2022training,liu2023languages,chatgpt,bai2022training} to improve the quality of Large Language Models (LLMs) with human guidance. We propose ZO-RankSGD, a first-of-its-kind zeroth-order optimization algorithm, to solve this optimization problem with a theoretical guarantee. Specifically, our algorithm employs a new rank-based random estimator for the descent direction and is proven to converge to a stationary point. ZO-RankSGD can also be directly applied to the policy search problem in reinforcement learning when only a ranking oracle of the episode reward is available. This makes ZO-RankSGD a promising alternative to existing RLHF methods, as it optimizes in an online fashion and thus can work without any pre-collected data. Furthermore, we demonstrate the effectiveness of ZO-RankSGD in a novel application: improving the quality of images generated by a diffusion generative model with human ranking feedback. Throughout experiments, we found that ZO-RankSGD can significantly enhance the detail of generated images with only a few rounds of human feedback. Overall, our work advances the field of zeroth-order optimization by addressing the problem of optimizing functions with only ranking feedback, and offers an effective approach for aligning human and machine intentions in a wide range of domains. Our code is released here \\url{https://github.com/TZW1998/Taming-Stable-Diffusion-with-Human-Ranking-Feedback}.",
        "creator": "Zhiwei Tang, Dmitry Rybin, Tsung-Hui Chang"
      },
      {
        "title": "DLT: Conditioned layout generation with Joint Discrete-Continuous Diffusion Layout Transformer.",
        "link": "http://arxiv.org/abs/2303.03755",
        "abstract": "Generating visual layouts is an essential ingredient of graphic design. The ability to condition layout generation on a partial subset of component attributes is critical to real-world applications that involve user interaction. Recently, diffusion models have demonstrated high-quality generative performances in various domains. However, it is unclear how to apply diffusion models to the natural representation of layouts which consists of a mix of discrete (class) and continuous (location, size) attributes. To address the conditioning layout generation problem, we introduce DLT, a joint discrete-continuous diffusion model. DLT is a transformer-based model which has a flexible conditioning mechanism that allows for conditioning on any given subset of all the layout component classes, locations, and sizes. Our method outperforms state-of-the-art generative models on various layout generation datasets with respect to different metrics and conditioning settings. Additionally, we validate the effectiveness of our proposed conditioning mechanism and the joint continuous-diffusion process. This joint process can be incorporated into a wide range of mixed discrete-continuous generative tasks.",
        "creator": "Elad Levi, Eli Brosh, Mykola Mykhailych, Meir Perez"
      },
      {
        "title": "Guiding Pseudo-labels with Uncertainty Estimation for Test-Time Adaptation.",
        "link": "http://arxiv.org/abs/2303.03770",
        "abstract": "Standard Unsupervised Domain Adaptation (UDA) methods assume the availability of both source and target data during the adaptation. In this work, we investigate the Test-Time Adaptation (TTA), a specific case of UDA where a model is adapted to a target domain without access to source data. We propose a novel approach for the TTA setting based on a loss reweighting strategy that brings robustness against the noise that inevitably affects the pseudo-labels. The classification loss is reweighted based on the reliability of the pseudo-labels that is measured by estimating their uncertainty. Guided by such reweighting strategy, the pseudo-labels are progressively refined by aggregating knowledge from neighbouring samples. Furthermore, a self-supervised contrastive framework is leveraged as a target space regulariser to enhance such knowledge aggregation. A novel negative pairs exclusion strategy is proposed to identify and exclude negative pairs made of samples sharing the same class, even in presence of some noise in the pseudo-labels. Our method outperforms previous methods on three major benchmarks by a large margin. We set the new TTA state-of-the-art on VisDA-C and DomainNet with a performance gain of +1.8\\% on both benchmarks and on PACS with +12.3\\% in the single-source setting and +6.6\\% in\\ multi-target adaptation. Additional analyses demonstrate that the proposed approach is robust to the noise, which results in significantly more accurate pseudo-labels compared to state-of-the-art approaches.",
        "creator": "Mattia Litrico, Alessio Del Bue, Pietro Morerio"
      },
      {
        "title": "Fast and Multi-aspect Mining of Complex Time-stamped Event Streams.",
        "link": "http://arxiv.org/abs/2303.03789",
        "abstract": "Given a huge, online stream of time-evolving events with multiple attributes, such as online shopping logs: (item, price, brand, time), and local mobility activities: (pick-up and drop-off locations, time), how can we summarize large, dynamic high-order tensor streams? How can we see any hidden patterns, rules, and anomalies? Our answer is to focus on two types of patterns, i.e., ''regimes'' and ''components'', for which we present CubeScope, an efficient and effective method over high-order tensor streams. Specifically, it identifies any sudden discontinuity and recognizes distinct dynamical patterns, ''regimes'' (e.g., weekday/weekend/holiday patterns). In each regime, it also performs multi-way summarization for all attributes (e.g., item, price, brand, and time) and discovers hidden ''components'' representing latent groups (e.g., item/brand groups) and their relationship. Thanks to its concise but effective summarization, CubeScope can also detect the sudden appearance of anomalies and identify the types of anomalies that occur in practice. Our proposed method has the following properties: (a) Effective: it captures dynamical multi-aspect patterns, i.e., regimes and components, and statistically summarizes all the events; (b) General: it is practical for successful application to data compression, pattern discovery, and anomaly detection on various types of tensor streams; (c) Scalable: our algorithm does not depend on the length of the data stream and its dimensionality. Extensive experiments on real datasets demonstrate that CubeScope finds meaningful patterns and anomalies correctly, and consistently outperforms the state-of-the-art methods as regards accuracy and execution speed.",
        "creator": "Kota Nakamura, Yasuko Matsubara, Koki Kawabata, Yuhei Umeda, Yuichiro Wada, Yasushi Sakurai"
      },
      {
        "title": "ENTROPY: Environment Transformer and Offline Policy Optimization.",
        "link": "http://arxiv.org/abs/2303.03811",
        "abstract": "Model-based methods provide an effective approach to offline reinforcement learning (RL). They learn an environmental dynamics model from interaction experiences and then perform policy optimization based on the learned model. However, previous model-based offline RL methods lack long-term prediction capability, resulting in large errors when generating multi-step trajectories. We address this issue by developing a sequence modeling architecture, Environment Transformer, which can generate reliable long-horizon trajectories based on offline datasets. We then propose a novel model-based offline RL algorithm, ENTROPY, that learns the dynamics model and reward function by ENvironment TRansformer and performs Offline PolicY optimization. We evaluate the proposed method on MuJoCo continuous control RL environments. Results show that ENTROPY performs comparably or better than the state-of-the-art model-based and model-free offline RL methods and demonstrates more powerful long-term trajectory prediction capability compared to existing model-based offline methods.",
        "creator": "Pengqin Wang, Meixin Zhu, Shaojie Shen"
      },
      {
        "title": "Region and Spatial Aware Anomaly Detection for Fundus Images.",
        "link": "http://arxiv.org/abs/2303.03817",
        "abstract": "Recently anomaly detection has drawn much attention in diagnosing ocular diseases. Most existing anomaly detection research in fundus images has relatively large anomaly scores in the salient retinal structures, such as blood vessels, optical cups and discs. In this paper, we propose a Region and Spatial Aware Anomaly Detection (ReSAD) method for fundus images, which obtains local region and long-range spatial information to reduce the false positives in the normal structure. ReSAD transfers a pre-trained model to extract the features of normal fundus images and applies the Region-and-Spatial-Aware feature Combination module (ReSC) for pixel-level features to build a memory bank. In the testing phase, ReSAD uses the memory bank to determine out-of-distribution samples as abnormalities. Our method significantly outperforms the existing anomaly detection methods for fundus images on two publicly benchmark datasets.",
        "creator": "Jingqi Niu, Shiwen Dong, Qinji Yu, Kang Dang, Xiaowei Ding"
      },
      {
        "title": "A Challenging Benchmark for Low-Resource Learning.",
        "link": "http://arxiv.org/abs/2303.03840",
        "abstract": "With promising yet saturated results in high-resource settings, low-resource datasets have gradually become popular benchmarks for evaluating the learning ability of advanced neural networks (e.g., BigBench, superGLUE). Some models even surpass humans according to benchmark test results. However, we find that there exists a set of hard examples in low-resource settings that challenge neural networks but are not well evaluated, which causes over-estimated performance. We first give a theoretical analysis on which factors bring the difficulty of low-resource learning. It then motivate us to propose a challenging benchmark hardBench to better evaluate the learning ability, which covers 11 datasets, including 3 computer vision (CV) datasets and 8 natural language process (NLP) datasets. Experiments on a wide range of models show that neural networks, even pre-trained language models, have sharp performance drops on our benchmark, demonstrating the effectiveness on evaluating the weaknesses of neural networks. On NLP tasks, we surprisingly find that despite better results on traditional low-resource benchmarks, pre-trained networks, does not show performance improvements on our benchmarks. These results demonstrate that there are still a large robustness gap between existing models and human-level performance.",
        "creator": "Yudong Wang, Chang Ma, Qingxiu Dong, Lingpeng Kong, Jingjing Xu"
      },
      {
        "title": "Leveraging Pre-trained AudioLDM for Sound Generation: A Benchmark Study.",
        "link": "http://arxiv.org/abs/2303.03857",
        "abstract": "Deep neural networks have recently achieved breakthroughs in sound generation. Despite the outstanding sample quality, current sound generation models face issues on small-scale datasets (e.g., overfitting and low coverage of sound classes), significantly limiting performance. In this paper, we make the first attempt to investigate the benefits of pre-training on sound generation with AudioLDM, the cutting-edge model for audio generation, as the backbone. Our study demonstrates the advantages of the pre-trained AudioLDM, especially in data-scarcity scenarios. In addition, the baselines and evaluation protocol for sound generation systems are not consistent enough to compare different studies directly. Aiming to facilitate further study on sound generation tasks, we benchmark the sound generation task on various frequently-used datasets. We hope our results on transfer learning and benchmarks can provide references for further research on conditional sound generation.",
        "creator": "Yi Yuan, Haohe Liu, Jinhua Liang, Xubo Liu, Mark D. Plumbley, Wenwu Wang"
      },
      {
        "title": "Developing the Reliable Shallow Supervised Learning for Thermal Comfort using ASHRAE RP-884 and ASHRAE Global Thermal Comfort Database II.",
        "link": "http://arxiv.org/abs/2303.03873",
        "abstract": "The artificial intelligence (AI) system designer for thermal comfort faces insufficient data recorded from the current user or overfitting due to unreliable training data. This work introduces the reliable data set for training the AI subsystem for thermal comfort. This paper presents the control algorithm based on shallow supervised learning, which is simple enough to be implemented in the Internet of Things (IoT) system for residential usage using ASHRAE RP-884 and ASHRAE Global Thermal Comfort Database II. No training data for thermal comfort is available as reliable as this dataset, but the direct use of this data can lead to overfitting. This work offers the algorithm for data filtering and semantic data augmentation for the ASHRAE database for the supervised learning process. Overfitting always becomes a problem due to the psychological aspect involved in the thermal comfort decision. The method to check the AI system based on the psychrometric chart against overfitting is presented. This paper also assesses the most important parameters needed to achieve human thermal comfort. This method can support the development of reinforced learning for thermal comfort.",
        "creator": "Kanisius Karyono, Badr M. Abdullah, Alison J. Cotgrave, Ana Bras, Jeff Cullen"
      },
      {
        "title": "AI Risk Skepticism, A Comprehensive Survey.",
        "link": "http://arxiv.org/abs/2303.03885",
        "abstract": "In this thorough study, we took a closer look at the skepticism that has arisen with respect to potential dangers associated with artificial intelligence, denoted as AI Risk Skepticism. Our study takes into account different points of view on the topic and draws parallels with other forms of skepticism that have shown up in science. We categorize the various skepticisms regarding the dangers of AI by the type of mistaken thinking involved. We hope this will be of interest and value to AI researchers concerned about the future of AI and the risks that it may pose. The issues of skepticism and risk in AI are decidedly important and require serious consideration. By addressing these issues with the rigor and precision of scientific research, we hope to better understand the objections we face and to find satisfactory ways to resolve them.",
        "creator": "Vemir Michael Ambartsoumean, Roman V. Yampolskiy"
      },
      {
        "title": "New Perspectives on Regularization and Computation in Optimal Transport-Based Distributionally Robust Optimization.",
        "link": "http://arxiv.org/abs/2303.03900",
        "abstract": "We study optimal transport-based distributionally robust optimization problems where a fictitious adversary, often envisioned as nature, can choose the distribution of the uncertain problem parameters by reshaping a prescribed reference distribution at a finite transportation cost. In this framework, we show that robustification is intimately related to various forms of variation and Lipschitz regularization even if the transportation cost function fails to be (some power of) a metric. We also derive conditions for the existence and the computability of a Nash equilibrium between the decision-maker and nature, and we demonstrate numerically that nature's Nash strategy can be viewed as a distribution that is supported on remarkably deceptive adversarial samples. Finally, we identify practically relevant classes of optimal transport-based distributionally robust optimization problems that can be addressed with efficient gradient descent algorithms even if the loss function or the transportation cost function are nonconvex (but not both at the same time).",
        "creator": "Soroosh Shafieezadeh-Abadeh, Liviu Aolaritei, Florian D&#xf6;rfler, Daniel Kuhn"
      },
      {
        "title": "Document-level Relation Extraction with Cross-sentence Reasoning Graph.",
        "link": "http://arxiv.org/abs/2303.03912",
        "abstract": "Relation extraction (RE) has recently moved from the sentence-level to document-level, which requires aggregating document information and using entities and mentions for reasoning. Existing works put entity nodes and mention nodes with similar representations in a document-level graph, whose complex edges may incur redundant information. Furthermore, existing studies only focus on entity-level reasoning paths without considering global interactions among entities cross-sentence. To these ends, we propose a novel document-level RE model with a GRaph information Aggregation and Cross-sentence Reasoning network (GRACR). Specifically, a simplified document-level graph is constructed to model the semantic information of all mentions and sentences in a document, and an entity-level graph is designed to explore relations of long-distance cross-sentence entity pairs. Experimental results show that GRACR achieves excellent performance on two public datasets of document-level RE. It is especially effective in extracting potential relations of cross-sentence entity pairs. Our code is available at https://github.com/UESTC-LHF/GRACR.",
        "creator": "Hongfei Liu, Zhao Kang, Lizong Zhang, Ling Tian, Fujun Hua"
      },
      {
        "title": "The BigScience ROOTS Corpus: A 1.6TB Composite Multilingual Dataset.",
        "link": "http://arxiv.org/abs/2303.03915",
        "abstract": "As language models grow ever larger, the need for large-scale high-quality text datasets has never been more pressing, especially in multilingual settings. The BigScience workshop, a 1-year international and multidisciplinary initiative, was formed with the goal of researching and training large language models as a values-driven undertaking, putting issues of ethics, harm, and governance in the foreground. This paper documents the data creation and curation efforts undertaken by BigScience to assemble the Responsible Open-science Open-collaboration Text Sources (ROOTS) corpus, a 1.6TB dataset spanning 59 languages that was used to train the 176-billion-parameter BigScience Large Open-science Open-access Multilingual (BLOOM) language model. We further release a large initial subset of the corpus and analyses thereof, and hope to empower large-scale monolingual and multilingual modeling projects with both the data and the processing tools, as well as stimulate research around this large multilingual corpus.",
        "creator": "Hugo Lauren&#xe7;on, Lucile Saulnier, Thomas Wang, Christopher Akiki, Albert Villanova del Moral, Teven Le Scao, Leandro Von Werra, Chenghao Mou, Eduardo Gonz&#xe1;lez Ponferrada, Huu Nguyen, J&#xf6;rg Frohberg, Mario &#x160;a&#x161;ko, Quentin Lhoest, Angelina McMillan-Major, Gerard Dupont, Stella Biderman, Anna Rogers, Loubna Ben allal, Francesco De Toni, Giada Pistilli, Olivier Nguyen, Somaieh Nikpoor, Maraim Masoud, Pierre Colombo, Javier de la Rosa, Paulo Villegas, Tristan Thrush, Shayne Longpre, Sebastian Nagel, Leon Weber, Manuel Mu&#xf1;oz, Jian Zhu, Daniel Van Strien, Zaid Alyafeai, Khalid Almubarak, Minh Chien Vu, Itziar Gonzalez-Dios, Aitor Soroa, Kyle Lo, Manan Dey, Pedro Ortiz Suarez, Aaron Gokaslan, Shamik Bose, David Adelani, Long Phan, Hieu Tran, Ian Yu, Suhas Pai, Jenny Chim, et al. (5 additional authors not shown)"
      },
      {
        "title": "Structure Pretraining and Prompt Tuning for Knowledge Graph Transfer.",
        "link": "http://arxiv.org/abs/2303.03922",
        "abstract": "Knowledge graphs (KG) are essential background knowledge providers in many tasks. When designing models for KG-related tasks, one of the key tasks is to devise the Knowledge Representation and Fusion (KRF) module that learns the representation of elements from KGs and fuses them with task representations. While due to the difference of KGs and perspectives to be considered during fusion across tasks, duplicate and ad hoc KRF modules design are conducted among tasks. In this paper, we propose a novel knowledge graph pretraining model KGTransformer that could serve as a uniform KRF module in diverse KG-related tasks. We pretrain KGTransformer with three self-supervised tasks with sampled sub-graphs as input. For utilization, we propose a general prompt-tuning mechanism regarding task data as a triple prompt to allow flexible interactions between task KGs and task data. We evaluate pretrained KGTransformer on three tasks, triple classification, zero-shot image classification, and question answering. KGTransformer consistently achieves better results than specifically designed task models. Through experiments, we justify that the pretrained KGTransformer could be used off the shelf as a general and effective KRF module across KG-related tasks. The code and datasets are available at https://github.com/zjukg/KGTransformer.",
        "creator": "Wen Zhang, Yushan Zhu, Mingyang Chen, Yuxia Geng, Yufeng Huang, Yajing Xu, Wenting Song, Huajun Chen"
      },
      {
        "title": "Robust Semi-Supervised Anomaly Detection via Adversarially Learned Continuous Noise Corruption.",
        "link": "http://arxiv.org/abs/2303.03925",
        "abstract": "Anomaly detection is the task of recognising novel samples which deviate significantly from pre-establishednormality. Abnormal classes are not present during training meaning that models must learn effective rep-resentations solely across normal class data samples. Deep Autoencoders (AE) have been widely used foranomaly detection tasks, but suffer from overfitting to a null identity function. To address this problem, weimplement a training scheme applied to a Denoising Autoencoder (DAE) which introduces an efficient methodof producing Adversarially Learned Continuous Noise (ALCN) to maximally globally corrupt the input priorto denoising. Prior methods have applied similar approaches of adversarial training to increase the robustnessof DAE, however they exhibit limitations such as slow inference speed reducing their real-world applicabilityor producing generalised obfuscation which is more trivial to denoise. We show through rigorous evaluationthat our ALCN method of regularisation during training improves AUC performance during inference whileremaining efficient over both classical, leave-one-out novelty detection tasks with the variations-: 9 (normal)vs. 1 (abnormal) &amp; 1 (normal) vs. 9 (abnormal); MNIST - AUCavg: 0.890 &amp; 0.989, CIFAR-10 - AUCavg: 0.670&amp; 0.742, in addition to challenging real-world anomaly detection tasks: industrial inspection (MVTEC-AD -AUCavg: 0.780) and plant disease detection (Plant Village - AUC: 0.770) when compared to prior approaches.",
        "creator": "Jack W Barker, Neelanjan Bhowmik, Yona Falinie A Gaus, Toby P Breckon"
      },
      {
        "title": "Speak Foreign Languages with Your Own Voice: Cross-Lingual Neural Codec Language Modeling.",
        "link": "http://arxiv.org/abs/2303.03926",
        "abstract": "We propose a cross-lingual neural codec language model, VALL-E X, for cross-lingual speech synthesis. Specifically, we extend VALL-E and train a multi-lingual conditional codec language model to predict the acoustic token sequences of the target language speech by using both the source language speech and the target language text as prompts. VALL-E X inherits strong in-context learning capabilities and can be applied for zero-shot cross-lingual text-to-speech synthesis and zero-shot speech-to-speech translation tasks. Experimental results show that it can generate high-quality speech in the target language via just one speech utterance in the source language as a prompt while preserving the unseen speaker's voice, emotion, and acoustic environment. Moreover, VALL-E X effectively alleviates the foreign accent problems, which can be controlled by a language ID. Audio samples are available at \\url{https://aka.ms/vallex}.",
        "creator": "Ziqiang Zhang, Long Zhou, Chengyi Wang, Sanyuan Chen, Yu Wu, Shujie Liu, Zhuo Chen, Yanqing Liu, Huaming Wang, Jinyu Li, Lei He, Sheng Zhao, Furu Wei"
      },
      {
        "title": "Towards Measuring Ethicality of an Intelligent Assistive System.",
        "link": "http://arxiv.org/abs/2303.03929",
        "abstract": "Artificial intelligence (AI) based assistive systems, so called intelligent assistive technology (IAT) are becoming increasingly ubiquitous by each day. IAT helps people in improving their quality of life by providing intelligent assistance based on the provided data. A few examples of such IATs include self-driving cars, robot assistants and smart-health management solutions. However, the presence of such autonomous entities poses ethical challenges concerning the stakeholders involved in using these systems. There is a lack of research when it comes to analysing how such IAT adheres to provided ethical regulations due to ethical, logistic and cost issues associated with such an analysis. In the light of the above-mentioned problem statement and issues, we present a method to measure the ethicality of an assistive system. To perform this task, we utilised our simulation tool that focuses on modelling navigation and assistance of Persons with Dementia (PwD) in indoor environments. By utilising this tool, we analyse how well different assistive strategies adhere to provided ethical regulations such as autonomy, justice and beneficence of the stakeholders.",
        "creator": "M. Salman Shaukat, J.-C. P&#xf5;der, Sebastian Bader, Thomas Kirste"
      },
      {
        "title": "FFT-based Dynamic Token Mixer for Vision.",
        "link": "http://arxiv.org/abs/2303.03932",
        "abstract": "Multi-head-self-attention (MHSA)-equipped models have achieved notable performance in computer vision. Their computational complexity is proportional to quadratic numbers of pixels in input feature maps, resulting in slow processing, especially when dealing with high-resolution images. New types of token-mixer are proposed as an alternative to MHSA to circumvent this problem: an FFT-based token-mixer, similar to MHSA in global operation but with lower computational complexity. However, despite its attractive properties, the FFT-based token-mixer has not been carefully examined in terms of its compatibility with the rapidly evolving MetaFormer architecture. Here, we propose a novel token-mixer called dynamic filter and DFFormer and CDFFormer, image recognition models using dynamic filters to close the gaps above. CDFFormer achieved a Top-1 accuracy of 85.0%, close to the hybrid architecture with convolution and MHSA. Other wide-ranging experiments and analysis, including object detection and semantic segmentation, demonstrate that they are competitive with state-of-the-art architectures; Their throughput and memory efficiency when dealing with high-resolution image recognition is convolution and MHSA, not much different from ConvFormer, and far superior to CAFormer. Our results indicate that the dynamic filter is one of the token-mixer options that should be seriously considered. The code is available at https://github.com/okojoalg/dfformer",
        "creator": "Yuki Tatsunami, Masato Taki"
      },
      {
        "title": "DEDGAT: Dual Embedding of Directed Graph Attention Networks for Detecting Financial Risk.",
        "link": "http://arxiv.org/abs/2303.03933",
        "abstract": "Graph representation plays an important role in the field of financial risk control, where the relationship among users can be constructed in a graph manner. In practical scenarios, the relationships between nodes in risk control tasks are bidirectional, e.g., merchants having both revenue and expense behaviors. Graph neural networks designed for undirected graphs usually aggregate discriminative node or edge representations with an attention strategy, but cannot fully exploit the out-degree information when used for the tasks built on directed graph, which leads to the problem of a directional bias. To tackle this problem, we propose a Directed Graph ATtention network called DGAT, which explicitly takes out-degree into attention calculation. In addition to having directional requirements, the same node might have different representations of its input and output, and thus we further propose a dual embedding of DGAT, referred to as DEDGAT. Specifically, DEDGAT assigns in-degree and out-degree representations to each node and uses these two embeddings to calculate the attention weights of in-degree and out-degree nodes, respectively. Experiments performed on the benchmark datasets show that DGAT and DEDGAT obtain better classification performance compared to undirected GAT. Also,the visualization results demonstrate that our methods can fully use both in-degree and out-degree information.",
        "creator": "Jiafu Wu, Mufeng Yao, Dong Wu, Mingmin Chi, Baokun Wang, Ruofan Wu, Xin Fu, Changhua Meng, Weiqiang Wang"
      },
      {
        "title": "Learning Position From Vehicle Vibration Using an Inertial Measurement Unit.",
        "link": "http://arxiv.org/abs/2303.03942",
        "abstract": "This paper presents a novel approach to vehicle positioning that operates without reliance on the global navigation satellite system (GNSS). Traditional GNSS approaches are vulnerable to interference in certain environments, rendering them unreliable in situations such as urban canyons, under flyovers, or in low reception areas. This study proposes a vehicle positioning method based on learning the road signature from accelerometer and gyroscope measurements obtained by an inertial measurement unit (IMU) sensor. In our approach, the route is divided into segments, each with a distinct signature that the IMU can detect through the vibrations of a vehicle in response to subtle changes in the road surface. The study presents two different data-driven methods for learning the road segment from IMU measurements. One method is based on convolutional neural networks and the other on ensemble random forest applied to handcrafted features. Additionally, the authors present an algorithm to deduce the position of a vehicle in real-time using the learned road segment. The approach was applied in two positioning tasks: (i) a car along a 6[km] route in a dense urban area; (ii) an e-scooter on a 1[km] route that combined road and pavement surfaces. The mean error between the proposed method's position and the ground truth was approximately 50[m] for the car and 30[m] for the e-scooter. Compared to a solution based on time integration of the IMU measurements, the proposed approach has a mean error of more than 5 times better for e-scooters and 20 times better for cars.",
        "creator": "Barak Or, Nimrod Segol, Areej Eweida, Maxim Freydin"
      },
      {
        "title": "CUREE: A Curious Underwater Robot for Ecosystem Exploration.",
        "link": "http://arxiv.org/abs/2303.03943",
        "abstract": "The current approach to exploring and monitoring complex underwater ecosystems, such as coral reefs, is to conduct surveys using diver-held or static cameras, or deploying sensor buoys. These approaches often fail to capture the full variation and complexity of interactions between different reef organisms and their habitat. The CUREE platform presented in this paper provides a unique set of capabilities in the form of robot behaviors and perception algorithms to enable scientists to explore different aspects of an ecosystem. Examples of these capabilities include low-altitude visual surveys, soundscape surveys, habitat characterization, and animal following. We demonstrate these capabilities by describing two field deployments on coral reefs in the US Virgin Islands. In the first deployment, we show that CUREE can identify the preferred habitat type of snapping shrimp in a reef through a combination of a visual survey, habitat characterization, and a soundscape survey. In the second deployment, we demonstrate CUREE's ability to follow arbitrary animals by separately following a barracuda and stingray for several minutes each in midwater and benthic environments, respectively.",
        "creator": "ogesh Girdhar, Nathan McGuire, Levi Cai, Stewart Jamieson, Seth McCammon, Brian Claus, John E. San Soucie, Jessica E. Todd, T. Aran Mooney"
      },
      {
        "title": "An End-to-End Approach for Online Decision Mining and Decision Drift Analysis in Process-Aware Information Systems: Extended Version.",
        "link": "http://arxiv.org/abs/2303.03961",
        "abstract": "Decision mining enables the discovery of decision rules from event logs or streams, and constitutes an important part of in-depth analysis and optimisation of business processes. So far, decision mining has been merely applied in an ex-post way resulting in a snapshot of decision rules for the given chunk of log data. Online decision mining, by contrast, enables continuous monitoring of decision rule evolution and decision drift. Hence this paper presents an end-to-end approach for the discovery as well as monitoring of decision points and the corresponding decision rules during runtime, bridging the gap between online control flow discovery and decision mining. The approach provides automatic decision support for process-aware information systems with efficient decision drift discovery and monitoring. For monitoring, not only the performance, in terms of accuracy, of decision rules is taken into account, but also the occurrence of data elements and changes in branching frequency. The paper provides two algorithms, which are evaluated on four synthetic and one real-life data set, showing feasibility and applicability of the approach. Overall, the approach fosters the understanding of decisions in business processes and hence contributes to an improved human-process interaction.",
        "creator": "Beate Scheibel, Stefanie Rinderle-Ma"
      },
      {
        "title": "Semantic-aware Occlusion Filtering Neural Radiance Fields in the Wild.",
        "link": "http://arxiv.org/abs/2303.03966",
        "abstract": "We present a learning framework for reconstructing neural scene representations from a small number of unconstrained tourist photos. Since each image contains transient occluders, decomposing the static and transient components is necessary to construct radiance fields with such in-the-wild photographs where existing methods require a lot of training data. We introduce SF-NeRF, aiming to disentangle those two components with only a few images given, which exploits semantic information without any supervision. The proposed method contains an occlusion filtering module that predicts the transient color and its opacity for each pixel, which enables the NeRF model to solely learn the static scene representation. This filtering module learns the transient phenomena guided by pixel-wise semantic features obtained by a trainable image encoder that can be trained across multiple scenes to learn the prior of transient objects. Furthermore, we present two techniques to prevent ambiguous decomposition and noisy results of the filtering module. We demonstrate that our method outperforms state-of-the-art novel view synthesis methods on Phototourism dataset in a few-shot setting.",
        "creator": "Jaewon Lee, Injae Kim, Hwan Heo, Hyunwoo J. Kim"
      },
      {
        "title": "Exploration via Epistemic Value Estimation.",
        "link": "http://arxiv.org/abs/2303.04012",
        "abstract": "How to efficiently explore in reinforcement learning is an open problem. Many exploration algorithms employ the epistemic uncertainty of their own value predictions -- for instance to compute an exploration bonus or upper confidence bound. Unfortunately the required uncertainty is difficult to estimate in general with function approximation.  We propose epistemic value estimation (EVE): a recipe that is compatible with sequential decision making and with neural network function approximators. It equips agents with a tractable posterior over all their parameters from which epistemic value uncertainty can be computed efficiently.  We use the recipe to derive an epistemic Q-Learning agent and observe competitive performance on a series of benchmarks. Experiments confirm that the EVE recipe facilitates efficient exploration in hard exploration tasks.",
        "creator": "Simon Schmitt, John Shawe-Taylor, Hado van Hasselt"
      },
      {
        "title": "PyXAB -- A Python Library for $\\mathcal{X}$-Armed Bandit and Online Blackbox Optimization Algorithms.",
        "link": "http://arxiv.org/abs/2303.04030",
        "abstract": "We introduce a Python open-source library for $\\mathcal{X}$-armed bandit and online blackbox optimization named PyXAB. PyXAB contains the implementations for more than 10 $\\mathcal{X}$-armed bandit algorithms, such as HOO, StoSOO, HCT, and the most recent works GPO and VHCT. PyXAB also provides the most commonly-used synthetic objectives to evaluate the performance of different algorithms and the various choices of the hierarchical partitions on the parameter space. The online documentation for PyXAB includes clear instructions for installation, straight-forward examples, detailed feature descriptions, and a complete reference of the API. PyXAB is released under the MIT license in order to encourage both academic and industrial usage. The library can be directly installed from PyPI with its source code available at https://github.com/WilliamLwj/PyXAB",
        "creator": "Wenjie Li, Haoze Li, Jean Honorio, Qifan Song"
      },
      {
        "title": "Root Cause Identification for Collective Anomalies in Time Series given an Acyclic Summary Causal Graph with Loops.",
        "link": "http://arxiv.org/abs/2303.04038",
        "abstract": "This paper presents an approach for identifying the root causes of collective anomalies given observational time series and an acyclic summary causal graph which depicts an abstraction of causal relations present in a dynamic system at its normal regime. The paper first shows how the problem of root cause identification can be divided into many independent subproblems by grouping related anomalies using d-separation. Further, it shows how, under this setting, some root causes can be found directly from the graph and from the time of appearance of anomalies. Finally, it shows, how the rest of the root causes can be found by comparing direct causal effects in the normal and in the anomalous regime. To this end, temporal adaptations of the back-door and the single-door criterions are introduced. Extensive experiments conducted on both simulated and real-world datasets demonstrate the effectiveness of the proposed method.",
        "creator": "Charles K. Assaad, Imad Ez-zejjari, Lei Zan"
      },
      {
        "title": "System Theoretic View on Uncertainties.",
        "link": "http://arxiv.org/abs/2303.04042",
        "abstract": "The complexity of the operating environment and required technologies for highly automated driving is unprecedented. A different type of threat to safe operation besides the fault-error-failure model by Laprie et al. arises in the form of performance limitations. We propose a system theoretic approach to handle these and derive a taxonomy based on uncertainty, i.e. lack of knowledge, as a root cause. Uncertainty is a threat to the dependability of a system, as it limits our ability to assess its dependability properties. We distinguish uncertainties by aleatory (inherent to probabilistic models), epistemic (lack of model parameter knowledge) and ontological (incompleteness of models) in order to determine strategies and methods to cope with them. Analogous to the taxonomy of Laprie et al. we cluster methods into uncertainty prevention (use of elements with well-known behavior, avoiding architectures prone to emergent behavior, restriction of operational design domain, etc.), uncertainty removal (during design time by design of experiment, etc. and after release by field observation, continuous updates, etc.), uncertainty tolerance (use of redundant architectures with diverse uncertainties, uncertainty aware deep learning, etc.) and uncertainty forecasting (estimation of residual uncertainty, etc.).",
        "creator": "Roman Gansch, Ahmad Adee"
      },
      {
        "title": "Is ChatGPT a Good NLG Evaluator? A Preliminary Study.",
        "link": "http://arxiv.org/abs/2303.04048",
        "abstract": "Recently, the emergence of ChatGPT has attracted wide attention from the computational linguistics community. Many prior studies have shown that ChatGPT achieves remarkable performance on various NLP tasks in terms of automatic evaluation metrics. However, the ability of ChatGPT to serve as an evaluation metric is still underexplored. Considering assessing the quality of NLG models is an arduous task and previous statistical metrics notoriously show their poor correlation with human judgments, we wonder whether ChatGPT is a good NLG evaluation metric. In this report, we provide a preliminary meta-evaluation on ChatGPT to show its reliability as an NLG metric. In detail, we regard ChatGPT as a human evaluator and give task-specific (e.g., summarization) and aspect-specific (e.g., relevance) instruction to prompt ChatGPT to score the generation of NLG models. We conduct experiments on three widely-used NLG meta-evaluation datasets (including summarization, story generation and data-to-text tasks). Experimental results show that compared with previous automatic metrics, ChatGPT achieves state-of-the-art or competitive correlation with golden human judgments. We hope our preliminary study could prompt the emergence of a general-purposed reliable NLG metric.",
        "creator": "Jiaan Wang, Yunlong Liang, Fandong Meng, Haoxiang Shi, Zhixu Li, Jinan Xu, Jianfeng Qu, Jie Zhou"
      },
      {
        "title": "Meta-Explore: Exploratory Hierarchical Vision-and-Language Navigation Using Scene Object Spectrum Grounding.",
        "link": "http://arxiv.org/abs/2303.04077",
        "abstract": "The main challenge in vision-and-language navigation (VLN) is how to understand natural-language instructions in an unseen environment. The main limitation of conventional VLN algorithms is that if an action is mistaken, the agent fails to follow the instructions or explores unnecessary regions, leading the agent to an irrecoverable path. To tackle this problem, we propose Meta-Explore, a hierarchical navigation method deploying an exploitation policy to correct misled recent actions. We show that an exploitation policy, which moves the agent toward a well-chosen local goal among unvisited but observable states, outperforms a method which moves the agent to a previously visited state. We also highlight the demand for imagining regretful explorations with semantically meaningful clues. The key to our approach is understanding the object placements around the agent in spectral-domain. Specifically, we present a novel visual representation, called scene object spectrum (SOS), which performs category-wise 2D Fourier transform of detected objects. Combining exploitation policy and SOS features, the agent can correct its path by choosing a promising local goal. We evaluate our method in three VLN benchmarks: R2R, SOON, and REVERIE. Meta-Explore outperforms other baselines and shows significant generalization performance. In addition, local goal search using the proposed spectral-domain SOS features significantly improves the success rate by 17.1% and SPL by 20.6% for the SOON benchmark.",
        "creator": "Minyoung Hwang, Jaeyeon Jeong, Minsoo Kim, Yoonseon Oh, Songhwai Oh"
      },
      {
        "title": "Visual Abstraction and Reasoning through Language.",
        "link": "http://arxiv.org/abs/2303.04091",
        "abstract": "While Artificial Intelligence (AI) models have achieved human or even superhuman performance in narrowly defined applications, they still struggle to show signs of broader and more flexible intelligence. The Abstraction and Reasoning Corpus (ARC), introduced by Fran\\c{c}ois Chollet, aims to assess how close AI systems are to human-like cognitive abilities. Most current approaches rely on carefully handcrafted domain-specific languages (DSLs), which are used to brute-force solutions to the tasks present in ARC. In this work, we propose a general framework for solving ARC based on natural language descriptions of the tasks. While not yet beating state-of-the-art DSL models on ARC, we demonstrate the immense potential of our approach hinted at by the ability to solve previously unsolved tasks.",
        "creator": "Giacomo Camposampiero, Loic Houmard, Benjamin Estermann, Jo&#xeb;l Mathys, Roger Wattenhofer"
      },
      {
        "title": "Mastering Strategy Card Game (Legends of Code and Magic) via End-to-End Policy and Optimistic Smooth Fictitious Play.",
        "link": "http://arxiv.org/abs/2303.04096",
        "abstract": "Deep Reinforcement Learning combined with Fictitious Play shows impressive results on many benchmark games, most of which are, however, single-stage. In contrast, real-world decision making problems may consist of multiple stages, where the observation spaces and the action spaces can be completely different across stages. We study a two-stage strategy card game Legends of Code and Magic and propose an end-to-end policy to address the difficulties that arise in multi-stage game. We also propose an optimistic smooth fictitious play algorithm to find the Nash Equilibrium for the two-player game. Our approach wins double championships of COG2022 competition. Extensive studies verify and show the advancement of our approach.",
        "creator": "Wei Xi, Yongxin Zhang, Changnan Xiao, Xuefeng Huang, Shihong Deng, Haowei Liang, Jie Chen, Peng Sun"
      },
      {
        "title": "Validation of a Hospital Digital Twin with Machine Learning.",
        "link": "http://arxiv.org/abs/2303.04117",
        "abstract": "Recently there has been a surge of interest in developing Digital Twins of process flows in healthcare to better understand bottlenecks and areas of improvement. A key challenge is in the validation process. We describe a work in progress for a digital twin using an agent based simulation model for determining bed turnaround time for patients in hospitals. We employ a strategy using machine learning for validating the model and implementing sensitivity analysis.",
        "creator": "Muhammad Aurangzeb Ahmad, Vijay Chickarmane, Farinaz Ali Sabzpour, Nima Shariari, Taposh Roy"
      },
      {
        "title": "Foundation Models for Decision Making: Problems, Methods, and Opportunities.",
        "link": "http://arxiv.org/abs/2303.04129",
        "abstract": "Foundation models pretrained on diverse data at scale have demonstrated extraordinary capabilities in a wide range of vision and language tasks. When such models are deployed in real world environments, they inevitably interface with other entities and agents. For example, language models are often used to interact with human beings through dialogue, and visual perception models are used to autonomously navigate neighborhood streets. In response to these developments, new paradigms are emerging for training foundation models to interact with other agents and perform long-term reasoning. These paradigms leverage the existence of ever-larger datasets curated for multimodal, multitask, and generalist interaction. Research at the intersection of foundation models and decision making holds tremendous promise for creating powerful new systems that can interact effectively across a diverse range of applications such as dialogue, autonomous driving, healthcare, education, and robotics. In this manuscript, we examine the scope of foundation models for decision making, and provide conceptual tools and technical background for understanding the problem space and exploring new research directions. We review recent approaches that ground foundation models in practical decision making applications through a variety of methods such as prompting, conditional generative modeling, planning, optimal control, and reinforcement learning, and discuss common challenges and open problems in the field.",
        "creator": "Sherry Yang, Ofir Nachum, Yilun Du, Jason Wei, Pieter Abbeel, Dale Schuurmans"
      },
      {
        "title": "Exploiting Asymmetry for Synthetic Training Data Generation: SynthIE and the Case of Information Extraction.",
        "link": "http://arxiv.org/abs/2303.04132",
        "abstract": "Large language models (LLMs) show great potential for synthetic data generation. This work shows that useful data can be synthetically generated even for tasks that cannot be solved directly by the LLM: we show that, for problems with structured outputs, it is possible to prompt an LLM to perform the task in the opposite direction, to generate plausible text for the target structure. Leveraging the asymmetry in task difficulty makes it possible to produce large-scale, high-quality data for complex tasks. We demonstrate the effectiveness of this approach on closed information extraction, where collecting ground-truth data is challenging, and no satisfactory dataset exists to date. We synthetically generate a dataset of 1.8M data points, demonstrate its superior quality compared to existing datasets in a human evaluation and use it to finetune small models (220M and 770M parameters). The models we introduce, SynthIE, outperform existing baselines of comparable size with a substantial gap of 57 and 79 absolute points in micro and macro F1, respectively. Code, data, and models are available at https://github.com/epfl-dlab/SynthIE.",
        "creator": "Martin Josifoski, Marija Sakota, Maxime Peyrard, Robert West"
      },
      {
        "title": "A Hybrid Architecture for Out of Domain Intent Detection and Intent Discovery.",
        "link": "http://arxiv.org/abs/2303.04134",
        "abstract": "Intent Detection is one of the tasks of the Natural Language Understanding (NLU) unit in task-oriented dialogue systems. Out of Scope (OOS) and Out of Domain (OOD) inputs may run these systems into a problem. On the other side, a labeled dataset is needed to train a model for Intent Detection in task-oriented dialogue systems. The creation of a labeled dataset is time-consuming and needs human resources. The purpose of this article is to address mentioned problems. The task of identifying OOD/OOS inputs is named OOD/OOS Intent Detection. Also, discovering new intents and pseudo-labeling of OOD inputs is well known by Intent Discovery. In OOD intent detection part, we make use of a Variational Autoencoder to distinguish between known and unknown intents independent of input data distribution. After that, an unsupervised clustering method is used to discover different unknown intents underlying OOD/OOS inputs. We also apply a non-linear dimensionality reduction on OOD/OOS representations to make distances between representations more meaning full for clustering. Our results show that the proposed model for both OOD/OOS Intent Detection and Intent Discovery achieves great results and passes baselines in English and Persian languages.",
        "creator": "Masoud Akbari, Ali Mohades, M. Hassan Shirali-Shahreza"
      },
      {
        "title": "Toward Defining a Domain Complexity Measure Across Domains.",
        "link": "http://arxiv.org/abs/2303.04141",
        "abstract": "Artificial Intelligence (AI) systems planned for deployment in real-world applications frequently are researched and developed in closed simulation environments where all variables are controlled and known to the simulator or labeled benchmark datasets are used. Transition from these simulators, testbeds, and benchmark datasets to more open-world domains poses significant challenges to AI systems, including significant increases in the complexity of the domain and the inclusion of real-world novelties; the open-world environment contains numerous out-of-distribution elements that are not part in the AI systems' training set. Here, we propose a path to a general, domain-independent measure of domain complexity level. We distinguish two aspects of domain complexity: intrinsic and extrinsic. The intrinsic domain complexity is the complexity that exists by itself without any action or interaction from an AI agent performing a task on that domain. This is an agent-independent aspect of the domain complexity. The extrinsic domain complexity is agent- and task-dependent. Intrinsic and extrinsic elements combined capture the overall complexity of the domain. We frame the components that define and impact domain complexity levels in a domain-independent light. Domain-independent measures of complexity could enable quantitative predictions of the difficulty posed to AI systems when transitioning from one testbed or environment to another, when facing out-of-distribution data in open-world tasks, and when navigating the rapidly expanding solution and search spaces encountered in open-world domains.",
        "creator": "Katarina Doctor, Christine Task, Eric Kildebeck, Mayank Kejriwal, Lawrence Holder, Russell Leong"
      },
      {
        "title": "From Copilot to Pilot: Towards AI Supported Software Development.",
        "link": "http://arxiv.org/abs/2303.04142",
        "abstract": "AI-supported programming has arrived, as shown by the introduction and successes of large language models for code, such as Copilot/Codex (Github/OpenAI) and AlphaCode (DeepMind). Above human average performance on programming challenges is now possible. However, software engineering is much more than solving programming contests. Moving beyond code completion to AI-supported software engineering will require an AI system that can, among other things, understand how to avoid code smells, to follow language idioms, and eventually (maybe!) propose rational software designs. In this study, we explore the current limitations of AI-supported code completion tools like Copilot and offer a simple taxonomy for understanding the classification of AI-supported code completion tools in this space. We first perform an exploratory study on Copilot's code suggestions for language idioms and code smells. Copilot does not follow language idioms and avoid code smells in most of our test scenarios. We then conduct additional investigation to determine the current boundaries of AI-supported code completion tools like Copilot by introducing a taxonomy of software abstraction hierarchies where 'basic programming functionality' such as code compilation and syntax checking is at the least abstract level, software architecture analysis and design are at the most abstract level. We conclude by providing a discussion on challenges for future development of AI-supported code completion tools to reach the design level of abstraction in our taxonomy.",
        "creator": "Rohith Pudari, Neil A. Ernst"
      },
      {
        "title": "Can We Scale Transformers to Predict Parameters of Diverse ImageNet Models?.",
        "link": "http://arxiv.org/abs/2303.04143",
        "abstract": "Pretraining a neural network on a large dataset is becoming a cornerstone in machine learning that is within the reach of only a few communities with large-resources. We aim at an ambitious goal of democratizing pretraining. Towards that goal, we train and release a single neural network that can predict high quality ImageNet parameters of other neural networks. By using predicted parameters for initialization we are able to boost training of diverse ImageNet models available in PyTorch. When transferred to other datasets, models initialized with predicted parameters also converge faster and reach competitive final performance.",
        "creator": "Boris Knyazev, Doha Hwang, Simon Lacoste-Julien"
      },
      {
        "title": "Tuned Compositional Feature Replays for Efficient Stream Learning.",
        "link": "http://arxiv.org/abs/2104.02206",
        "abstract": "Our brains extract durable, generalizable knowledge from transient experiences of the world. Artificial neural networks come nowhere close: when tasked with learning to classify objects by training on non-repeating video frames in temporal order (online stream learning), models that learn well from shuffled datasets catastrophically forget old knowledge upon learning new stimuli. We propose a new continual learning algorithm, Compositional Replay Using Memory Blocks (CRUMB), which mitigates forgetting by replaying feature maps reconstructed by recombining generic parts. Just as crumbs together form a loaf of bread, we concatenate trainable and re-usable \"memory block\" vectors to compositionally reconstruct feature map tensors in convolutional neural networks. CRUMB stores the indices of memory blocks used to reconstruct new stimuli, enabling replay of specific memories during later tasks. CRUMB's memory blocks are tuned to enhance replay: a single feature map stored, reconstructed, and replayed by CRUMB mitigates forgetting during video stream learning more effectively than an entire image, even though it occupies only 3.6% as much memory. We stress-tested CRUMB alongside 13 competing methods on 5 challenging datasets. To address the limited number of existing online stream learning datasets, we introduce 2 new benchmarks by adapting existing datasets for stream learning. With about 4% of the memory and 20% of the runtime, CRUMB mitigates catastrophic forgetting more effectively than the prior state-of-the-art. Our code is available at https://github.com/MorganBDT/crumb.git.",
        "creator": "Morgan B. Talbot, Rushikesh Zawar, Rohil Badkundri, Mengmi Zhang, Gabriel Kreiman"
      },
      {
        "title": "Boundary Graph Neural Networks for 3D Simulations.",
        "link": "http://arxiv.org/abs/2106.11299",
        "abstract": "The abundance of data has given machine learning considerable momentum in natural sciences and engineering, though modeling of physical processes is often difficult. A particularly tough problem is the efficient representation of geometric boundaries. Triangularized geometric boundaries are well understood and ubiquitous in engineering applications. However, it is notoriously difficult to integrate them into machine learning approaches due to their heterogeneity with respect to size and orientation. In this work, we introduce an effective theory to model particle-boundary interactions, which leads to our new Boundary Graph Neural Networks (BGNNs) that dynamically modify graph structures to obey boundary conditions. The new BGNNs are tested on complex 3D granular flow processes of hoppers, rotating drums and mixers, which are all standard components of modern industrial machinery but still have complicated geometry. BGNNs are evaluated in terms of computational efficiency as well as prediction accuracy of particle flows and mixing entropies. BGNNs are able to accurately reproduce 3D granular flows within simulation uncertainties over hundreds of thousands of simulation timesteps. Most notably, in our experiments, particles stay within the geometric objects without using handcrafted conditions or restrictions.",
        "creator": "Andreas Mayr, Sebastian Lehner, Arno Mayrhofer, Christoph Kloss, Sepp Hochreiter, Johannes Brandstetter"
      },
      {
        "title": "Taming Self-Supervised Learning for Presentation Attack Detection: In-Image De-Folding and Out-of-Image De-Mixing.",
        "link": "http://arxiv.org/abs/2109.04100",
        "abstract": "Biometric systems are vulnerable to Presentation Attacks (PA) performed using various Presentation Attack Instruments (PAIs). Even though there are numerous Presentation Attack Detection (PAD) techniques based on both deep learning and hand-crafted features, the generalization of PAD for unknown PAI is still a challenging problem. In this work, we empirically prove that the initialization of the PAD model is a crucial factor for the generalization, which is rarely discussed in the community. Based on such observation, we proposed a self-supervised learning-based method, denoted as DF-DM. Specifically, DF-DM is based on a global-local view coupled with De-Folding and De-Mixing to derive the task-specific representation for PAD. During De-Folding, the proposed technique will learn region-specific features to represent samples in a local pattern by explicitly minimizing generative loss. While De-Mixing drives detectors to obtain the instance-specific features with global information for more comprehensive representation by minimizing interpolation-based consistency. Extensive experimental results show that the proposed method can achieve significant improvements in terms of both face and fingerprint PAD in more complicated and hybrid datasets when compared with state-of-the-art methods. When training in CASIA-FASD and Idiap Replay-Attack, the proposed method can achieve an 18.60% Equal Error Rate (EER) in OULU-NPU and MSU-MFSD, exceeding baseline performance by 9.54%. The source code of the proposed technique is available at https://github.com/kongzhecn/dfdm.",
        "creator": "Zhe Kong, Wentian Zhang, Feng Liu, Wenhan Luo, Haozhe Liu, Linlin Shen, Raghavendra Ramachandra"
      },
      {
        "title": "Prior and Posterior Networks: A Survey on Evidential Deep Learning Methods For Uncertainty Estimation.",
        "link": "http://arxiv.org/abs/2110.03051",
        "abstract": "Popular approaches for quantifying predictive uncertainty in deep neural networks often involve distributions over weights or multiple models, for instance via Markov Chain sampling, ensembling, or Monte Carlo dropout. These techniques usually incur overhead by having to train multiple model instances or do not produce very diverse predictions. This comprehensive and extensive survey aims to familiarize the reader with an alternative class of models based on the concept of Evidential Deep Learning: For unfamiliar data, they aim to admit \"what they don't know\", and fall back onto a prior belief. Furthermore, they allow uncertainty estimation in a single model and forward pass by parameterizing distributions over distributions. This survey recapitulates existing works, focusing on the implementation in a classification setting, before surveying the application of the same paradigm to regression. We also reflect on the strengths and weaknesses compared to other existing methods and provide the most fundamental derivations using a unified notation to aid future research.",
        "creator": "Dennis Ulmer, Christian Hardmeier, Jes Frellsen"
      },
      {
        "title": "Automated Controller Calibration by Kalman Filtering.",
        "link": "http://arxiv.org/abs/2111.10832",
        "abstract": "This paper proposes a method for calibrating control parameters. Examples of such control parameters are gains of PID controllers, weights of a cost function for optimal control, filter coefficients, the sliding surface of a sliding mode controller, or weights of a neural network. Hence, the proposed method can be applied to a wide range of controllers. The method uses a Kalman filter that estimates control parameters, using data of closed-loop system operation. The control parameter calibration is driven by a training objective, which encompasses specifications on the performance of the dynamical system. The performance-driven calibration method tunes the parameters online and robustly, is computationally efficient, has low data storage requirements, and is easy to implement making it appealing for many real-time applications. Simulation results show that the method is able to learn control parameters quickly, is able to tune the parameters to compensate for disturbances, and is robust to noise. A simulation study with the high-fidelity vehicle simulator CarSim shows that the method can calibrate controllers of a complex dynamical system online, which indicates its applicability to a real-world system. We also verify the real-time feasibility on an embedded platform with automotive-grade processors by implementing our method on a dSPACE MicroAutoBox-II rapid prototyping unit.",
        "creator": "Marcel Menner, Karl Berntorp, Stefano Di Cairano"
      },
      {
        "title": "A Free Lunch from the Noise: Provable and Practical Exploration for Representation Learning.",
        "link": "http://arxiv.org/abs/2111.11485",
        "abstract": "Representation learning lies at the heart of the empirical success of deep learning for dealing with the curse of dimensionality. However, the power of representation learning has not been fully exploited yet in reinforcement learning (RL), due to i), the trade-off between expressiveness and tractability; and ii), the coupling between exploration and representation learning. In this paper, we first reveal the fact that under some noise assumption in the stochastic control model, we can obtain the linear spectral feature of its corresponding Markov transition operator in closed-form for free. Based on this observation, we propose Spectral Dynamics Embedding (SPEDE), which breaks the trade-off and completes optimistic exploration for representation learning by exploiting the structure of the noise. We provide rigorous theoretical analysis of SPEDE, and demonstrate the practical superior performance over the existing state-of-the-art empirical algorithms on several benchmarks.",
        "creator": "Tongzheng Ren, Tianjun Zhang, Csaba Szepesv&#xe1;ri, Bo Dai"
      },
      {
        "title": "Semi-supervised 3D Object Detection via Temporal Graph Neural Networks.",
        "link": "http://arxiv.org/abs/2202.00182",
        "abstract": "3D object detection plays an important role in autonomous driving and other robotics applications. However, these detectors usually require training on large amounts of annotated data that is expensive and time-consuming to collect. Instead, we propose leveraging large amounts of unlabeled point cloud videos by semi-supervised learning of 3D object detectors via temporal graph neural networks. Our insight is that temporal smoothing can create more accurate detection results on unlabeled data, and these smoothed detections can then be used to retrain the detector. We learn to perform this temporal reasoning with a graph neural network, where edges represent the relationship between candidate detections in different time frames. After semi-supervised learning, our method achieves state-of-the-art detection performance on the challenging nuScenes and H3D benchmarks, compared to baselines trained on the same amount of labeled data. Project and code are released at https://www.jianrenw.com/SOD-TGNN/.",
        "creator": "Jianren Wang, Haiming Gang, Siddharth Ancha, Yi-Ting Chen, David Held"
      },
      {
        "title": "Intention Aware Robot Crowd Navigation with Attention-Based Interaction Graph.",
        "link": "http://arxiv.org/abs/2203.01821",
        "abstract": "We study the problem of safe and intention-aware robot navigation in dense and interactive crowds. Most previous reinforcement learning (RL) based methods fail to consider different types of interactions among all agents or ignore the intentions of people, which results in performance degradation. In this paper, we propose a novel recurrent graph neural network with attention mechanisms to capture heterogeneous interactions among agents through space and time. To encourage longsighted robot behaviors, we infer the intentions of dynamic agents by predicting their future trajectories for several timesteps. The predictions are incorporated into a model-free RL framework to prevent the robot from intruding into the intended paths of other agents. We demonstrate that our method enables the robot to achieve good navigation performance and non-invasiveness in challenging crowd navigation scenarios. We successfully transfer the policy learned in simulation to a real-world TurtleBot 2i. Our code and videos are available at https://sites.google.com/view/intention-aware-crowdnav/home.",
        "creator": "Shuijing Liu, Peixin Chang, Zhe Huang, Neeloy Chakraborty, Kaiwen Hong, Weihang Liang, D. Livingston McPherson, Junyi Geng, Katherine Driggs-Campbell"
      },
      {
        "title": "Self-Consistency Improves Chain of Thought Reasoning in Language Models.",
        "link": "http://arxiv.org/abs/2203.11171",
        "abstract": "Chain-of-thought prompting combined with pre-trained large language models has achieved encouraging results on complex reasoning tasks. In this paper, we propose a new decoding strategy, self-consistency, to replace the naive greedy decoding used in chain-of-thought prompting. It first samples a diverse set of reasoning paths instead of only taking the greedy one, and then selects the most consistent answer by marginalizing out the sampled reasoning paths. Self-consistency leverages the intuition that a complex reasoning problem typically admits multiple different ways of thinking leading to its unique correct answer. Our extensive empirical evaluation shows that self-consistency boosts the performance of chain-of-thought prompting with a striking margin on a range of popular arithmetic and commonsense reasoning benchmarks, including GSM8K (+17.9%), SVAMP (+11.0%), AQuA (+12.2%), StrategyQA (+6.4%) and ARC-challenge (+3.9%).",
        "creator": "Xuezhi Wang, Jason Wei, Dale Schuurmans, Quoc Le, Ed Chi, Sharan Narang, Aakanksha Chowdhery, Denny Zhou"
      },
      {
        "title": "Bootstrapping Semi-supervised Medical Image Segmentation with Anatomical-aware Contrastive Distillation.",
        "link": "http://arxiv.org/abs/2206.02307",
        "abstract": "Contrastive learning has shown great promise over annotation scarcity problems in the context of medical image segmentation. Existing approaches typically assume a balanced class distribution for both labeled and unlabeled medical images. However, medical image data in reality is commonly imbalanced (i.e., multi-class label imbalance), which naturally yields blurry contours and usually incorrectly labels rare objects. Moreover, it remains unclear whether all negative samples are equally negative. In this work, we present ACTION, an Anatomical-aware ConTrastive dIstillatiON framework, for semi-supervised medical image segmentation. Specifically, we first develop an iterative contrastive distillation algorithm by softly labeling the negatives rather than binary supervision between positive and negative pairs. We also capture more semantically similar features from the randomly chosen negative set compared to the positives to enforce the diversity of the sampled data. Second, we raise a more important question: Can we really handle imbalanced samples to yield better performance? Hence, the key innovation in ACTION is to learn global semantic relationship across the entire dataset and local anatomical features among the neighbouring pixels with minimal additional memory footprint. During the training, we introduce anatomical contrast by actively sampling a sparse set of hard negative pixels, which can generate smoother segmentation boundaries and more accurate predictions. Extensive experiments across two benchmark datasets and different unlabeled settings show that ACTION significantly outperforms the current state-of-the-art semi-supervised methods.",
        "creator": "Chenyu You, Weicheng Dai, Yifei Min, Lawrence Staib, James S. Duncan"
      },
      {
        "title": "Training Subset Selection for Weak Supervision.",
        "link": "http://arxiv.org/abs/2206.02914",
        "abstract": "Existing weak supervision approaches use all the data covered by weak signals to train a classifier. We show both theoretically and empirically that this is not always optimal. Intuitively, there is a tradeoff between the amount of weakly-labeled data and the precision of the weak labels. We explore this tradeoff by combining pretrained data representations with the cut statistic (Muhlenbach et al., 2004) to select (hopefully) high-quality subsets of the weakly-labeled training data. Subset selection applies to any label model and classifier and is very simple to plug in to existing weak supervision pipelines, requiring just a few lines of code. We show our subset selection method improves the performance of weak supervision for a wide range of label models, classifiers, and datasets. Using less weakly-labeled data improves the accuracy of weak supervision pipelines by up to 19% (absolute) on benchmark tasks.",
        "creator": "Hunter Lang, Aravindan Vijayaraghavan, David Sontag"
      },
      {
        "title": "MultiViz: Towards Visualizing and Understanding Multimodal Models.",
        "link": "http://arxiv.org/abs/2207.00056",
        "abstract": "The promise of multimodal models for real-world applications has inspired research in visualizing and understanding their internal mechanics with the end goal of empowering stakeholders to visualize model behavior, perform model debugging, and promote trust in machine learning models. However, modern multimodal models are typically black-box neural networks, which makes it challenging to understand their internal mechanics. How can we visualize the internal modeling of multimodal interactions in these models? Our paper aims to fill this gap by proposing MultiViz, a method for analyzing the behavior of multimodal models by scaffolding the problem of interpretability into 4 stages: (1) unimodal importance: how each modality contributes towards downstream modeling and prediction, (2) cross-modal interactions: how different modalities relate with each other, (3) multimodal representations: how unimodal and cross-modal interactions are represented in decision-level features, and (4) multimodal prediction: how decision-level features are composed to make a prediction. MultiViz is designed to operate on diverse modalities, models, tasks, and research areas. Through experiments on 8 trained models across 6 real-world tasks, we show that the complementary stages in MultiViz together enable users to (1) simulate model predictions, (2) assign interpretable concepts to features, (3) perform error analysis on model misclassifications, and (4) use insights from error analysis to debug models. MultiViz is publicly available, will be regularly updated with new interpretation tools and metrics, and welcomes inputs from the community.",
        "creator": "Paul Pu Liang, Yiwei Lyu, Gunjan Chhablani, Nihal Jain, Zihao Deng, Xingbo Wang, Louis-Philippe Morency, Ruslan Salakhutdinov"
      },
      {
        "title": "A Deep Reinforcement Learning Approach for Finding Non-Exploitable Strategies in Two-Player Atari Games.",
        "link": "http://arxiv.org/abs/2207.08894",
        "abstract": "This paper proposes new, end-to-end deep reinforcement learning algorithms for learning two-player zero-sum Markov games. Different from prior efforts on training agents to beat a fixed set of opponents, our objective is to find the Nash equilibrium policies that are free from exploitation by even the adversarial opponents. We propose (a) Nash-DQN algorithm, which integrates the deep learning techniques from single DQN into the classic Nash Q-learning algorithm for solving tabular Markov games; (b) Nash-DQN-Exploiter algorithm, which additionally adopts an exploiter to guide the exploration of the main agent. We conduct experimental evaluation on tabular examples as well as various two-player Atari games. Our empirical results demonstrate that (i) the policies found by many existing methods including Neural Fictitious Self Play and Policy Space Response Oracle can be prone to exploitation by adversarial opponents; (ii) the output policies of our algorithms are robust to exploitation, and thus outperform existing methods.",
        "creator": "Zihan Ding, Dijia Su, Qinghua Liu, Chi Jin"
      },
      {
        "title": "Kill Chaos with Kindness: Agreeableness Improves Team Performance Under Uncertainty.",
        "link": "http://arxiv.org/abs/2208.04873",
        "abstract": "Teams are central to human accomplishment. Over the past half-century, psychologists have identified the Big-Five cross-culturally valid personality variables: Neuroticism, Extraversion, Openness, Conscientiousness, and Agreeableness. The first four have shown consistent relationships with team performance. Agreeableness (being harmonious, altruistic, humble, and cooperative), however, has demonstrated a non-significant and highly variable relationship with team performance. We resolve this inconsistency through computational modelling. An agent-based model (ABM) is used to predict the effects of personality traits on teamwork and a genetic algorithm is then used to explore the limits of the ABM in order to discover which traits correlate with best and worst performing teams for a problem with different levels of uncertainty (noise). New dependencies revealed by the exploration are corroborated by analyzing previously-unseen data from one the largest datasets on team performance to date comprising 3,698 individuals in 593 teams working on more than 5,000 group tasks with and without uncertainty, collected over a 10-year period. Our finding is that the dependency between team performance and Agreeableness is moderated by task uncertainty. Combining evolutionary computation with ABMs in this way provides a new methodology for the scientific investigation of teamwork, making new predictions, and improving our understanding of human behaviors. Our results confirm the potential usefulness of computer modelling for developing theory, as well as shedding light on the future of teams as work environments are becoming increasingly fluid and uncertain.",
        "creator": "Soo Ling Lim, Peter J. Bentley, Randall S. Peterson, Xiaoran Hu, JoEllyn Prouty McLaren"
      },
      {
        "title": "Towards Optimal and Scalable Evacuation Planning Using Data-driven Agent Based Models.",
        "link": "http://arxiv.org/abs/2209.01535",
        "abstract": "Evacuation planning is a crucial part of disaster management where the goal is to relocate people to safety and minimize casualties. Every evacuation plan has two essential components: routing and scheduling. However, joint optimization of these two components with objectives such as minimizing average evacuation time or evacuation completion time, is a computationally hard problem. To approach it, we present MIP-LNS, a scalable optimization method that utilizes heuristic search with mathematical optimization and can optimize a variety of objective functions. We also present the method MIP-LNS-SIM, where we further combine an agent-based model together with MIP-LNS to more accurately estimate the delay on roads due to congestion. We use real-world road network and population data from Harris County in Houston, Texas, and apply our methods to find evacuation routes and schedule for the area. We show that, within a given time limit, MIP-LNS finds better solutions than existing methods in terms of average evacuation time, evacuation completion time and optimality guarantee of the solutions. We also perform experiments with MIP-LNS-SIM to show its efficacy in estimating delays in the road network due to congestion by using an agent based model. Our results show that MIP-LNS-SIM can find efficient evacuation plans, and at the same time provide an estimate of the evacuation completion time for the given plan with a small percent error.",
        "creator": "Kazi Ashik Islam, Da Qi Chen, Madhav Marathe, Henning Mortveit, Samarth Swarup, Anil Vullikanti"
      },
      {
        "title": "Compose & Embellish: Well-Structured Piano Performance Generation via A Two-Stage Approach.",
        "link": "http://arxiv.org/abs/2209.08212",
        "abstract": "Even with strong sequence models like Transformers, generating expressive piano performances with long-range musical structures remains challenging. Meanwhile, methods to compose well-structured melodies or lead sheets (melody + chords), i.e., simpler forms of music, gained more success. Observing the above, we devise a two-stage Transformer-based framework that Composes a lead sheet first, and then Embellishes it with accompaniment and expressive touches. Such a factorization also enables pretraining on non-piano data. Our objective and subjective experiments show that Compose &amp; Embellish shrinks the gap in structureness between a current state of the art and real performances by half, and improves other musical aspects such as richness and coherence as well.",
        "creator": "Shih-Lun Wu, Yi-Hsuan Yang"
      },
      {
        "title": "Learning and Deploying Robust Locomotion Policies with Minimal Dynamics Randomization.",
        "link": "http://arxiv.org/abs/2209.12878",
        "abstract": "Training deep reinforcement learning (DRL) locomotion policies often require massive amounts of data to converge to the desired behaviour. In this regard, simulators provide a cheap and abundant source. For successful sim-to-real transfer, exhaustively engineered approaches such as system identification, dynamics randomization, and domain adaptation are generally employed. As an alternative, we investigate a simple strategy of random force injection (RFI) to perturb system dynamics during training. We show that the application of random forces enables us to emulate dynamics randomization. This allows us to obtain locomotion policies that are robust to variations in system dynamics. We further extend RFI, referred to as extended random force injection (ERFI), by introducing an episodic actuation offset. We demonstrate that ERFI provides additional robustness for variations in system mass offering on average a 53% improved performance over RFI. We also show that ERFI is sufficient to perform a successful sim-to-real transfer on two different quadrupedal platforms, ANYmal C and Unitree A1, even for perceptive locomotion over uneven terrain in outdoor environments.",
        "creator": "Luigi Campanaro, Siddhant Gangapurwala, Wolfgang Merkt, Ioannis Havoutis"
      },
      {
        "title": "It Takes Two: Learning to Plan for Human-Robot Cooperative Carrying.",
        "link": "http://arxiv.org/abs/2209.12890",
        "abstract": "Cooperative table-carrying is a complex task due to the continuous nature of the action and state-spaces, multimodality of strategies, and the need for instantaneous adaptation to other agents. In this work, we present a method for predicting realistic motion plans for cooperative human-robot teams on the task. Using a Variational Recurrent Neural Network (VRNN) to model the variation in the trajectory of a human-robot team across time, we are able to capture the distribution over the team's future states while leveraging information from interaction history. The key to our approach is leveraging human demonstration data to generate trajectories that synergize well with humans during test time in a receding horizon fashion. Comparison between a baseline, sampling-based planner RRT (Rapidly-exploring Random Trees) and the VRNN planner in centralized planning shows that the VRNN generates motion more similar to the distribution of human-human demonstrations than the RRT. Results in a human-in-the-loop user study show that the VRNN planner outperforms decentralized RRT on task-related metrics, and is significantly more likely to be perceived as human than the RRT planner. Finally, we demonstrate the VRNN planner on a real robot paired with a human teleoperating another robot.",
        "creator": "Eley Ng, Ziang Liu, Monroe Kennedy III"
      },
      {
        "title": "Relative representations enable zero-shot latent space communication.",
        "link": "http://arxiv.org/abs/2209.15430",
        "abstract": "Neural networks embed the geometric structure of a data manifold lying in a high-dimensional space into latent representations. Ideally, the distribution of the data points in the latent space should depend only on the task, the data, the loss, and other architecture-specific constraints. However, factors such as the random weights initialization, training hyperparameters, or other sources of randomness in the training phase may induce incoherent latent spaces that hinder any form of reuse. Nevertheless, we empirically observe that, under the same data and modeling choices, the angles between the encodings within distinct latent spaces do not change. In this work, we propose the latent similarity between each sample and a fixed set of anchors as an alternative data representation, demonstrating that it can enforce the desired invariances without any additional training. We show how neural architectures can leverage these relative representations to guarantee, in practice, invariance to latent isometries and rescalings, effectively enabling latent space communication: from zero-shot model stitching to latent space comparison between diverse settings. We extensively validate the generalization capability of our approach on different datasets, spanning various modalities (images, text, graphs), tasks (e.g., classification, reconstruction) and architectures (e.g., CNNs, GCNs, transformers).",
        "creator": "Luca Moschella, Valentino Maiorca, Marco Fumero, Antonio Norelli, Francesco Locatello, Emanuele Rodol&#xe0;"
      },
      {
        "title": "VIP: Towards Universal Visual Reward and Representation via Value-Implicit Pre-Training.",
        "link": "http://arxiv.org/abs/2210.00030",
        "abstract": "Reward and representation learning are two long-standing challenges for learning an expanding set of robot manipulation skills from sensory observations. Given the inherent cost and scarcity of in-domain, task-specific robot data, learning from large, diverse, offline human videos has emerged as a promising path towards acquiring a generally useful visual representation for control; however, how these human videos can be used for general-purpose reward learning remains an open question. We introduce $\\textbf{V}$alue-$\\textbf{I}$mplicit $\\textbf{P}$re-training (VIP), a self-supervised pre-trained visual representation capable of generating dense and smooth reward functions for unseen robotic tasks. VIP casts representation learning from human videos as an offline goal-conditioned reinforcement learning problem and derives a self-supervised dual goal-conditioned value-function objective that does not depend on actions, enabling pre-training on unlabeled human videos. Theoretically, VIP can be understood as a novel implicit time contrastive objective that generates a temporally smooth embedding, enabling the value function to be implicitly defined via the embedding distance, which can then be used to construct the reward for any goal-image specified downstream task. Trained on large-scale Ego4D human videos and without any fine-tuning on in-domain, task-specific data, VIP's frozen representation can provide dense visual reward for an extensive set of simulated and $\\textbf{real-robot}$ tasks, enabling diverse reward-based visual control methods and significantly outperforming all prior pre-trained representations. Notably, VIP can enable simple, $\\textbf{few-shot}$ offline RL on a suite of real-world robot tasks with as few as 20 trajectories.",
        "creator": "Yecheng Jason Ma, Shagun Sodhani, Dinesh Jayaraman, Osbert Bastani, Vikash Kumar, Amy Zhang"
      },
      {
        "title": "LambdaKG: A Library for Pre-trained Language Model-Based Knowledge Graph Embeddings.",
        "link": "http://arxiv.org/abs/2210.00305",
        "abstract": "Knowledge Graphs (KGs) often have two characteristics: heterogeneous graph structure and text-rich entity/relation information. Text-based KG embeddings can represent entities by encoding descriptions with pre-trained language models, but no open-sourced library is specifically designed for KGs with PLMs at present. In this paper, we present LambdaKG, a library for KGE that equips with many pre-trained language models (e.g., BERT, BART, T5, GPT-3), and supports various tasks (e.g., knowledge graph completion, question answering, recommendation, and knowledge probing). LambdaKG is publicly open-sourced at https://github.com/zjunlp/PromptKG/tree/main/lambdaKG, with a demo video at this http URL and long-term maintenance.",
        "creator": "Xin Xie, Zhoubo Li, Xiaohan Wang, Yuqi Zhu, Ningyu Zhang, Jintian Zhang, Siyuan Cheng, Bozhong Tian, Shumin Deng, Feiyu Xiong, Huajun Chen"
      },
      {
        "title": "CLUTR: Curriculum Learning via Unsupervised Task Representation Learning.",
        "link": "http://arxiv.org/abs/2210.10243",
        "abstract": "Reinforcement Learning (RL) algorithms are often known for sample inefficiency and difficult generalization. Recently, Unsupervised Environment Design (UED) emerged as a new paradigm for zero-shot generalization by simultaneously learning a task distribution and agent policies on the generated tasks. This is a non-stationary process where the task distribution evolves along with agent policies; creating an instability over time. While past works demonstrated the potential of such approaches, sampling effectively from the task space remains an open challenge, bottlenecking these approaches. To this end, we introduce CLUTR: a novel unsupervised curriculum learning algorithm that decouples task representation and curriculum learning into a two-stage optimization. It first trains a recurrent variational autoencoder on randomly generated tasks to learn a latent task manifold. Next, a teacher agent creates a curriculum by maximizing a minimax REGRET-based objective on a set of latent tasks sampled from this manifold. Using the fixed-pretrained task manifold, we show that CLUTR successfully overcomes the non-stationarity problem and improves stability. Our experimental results show CLUTR outperforms PAIRED, a principled and popular UED method, in the challenging CarRacing and navigation environments: achieving 10.6X and 45\\% improvement in zero-shot generalization, respectively. CLUTR also performs comparably to the non-UED state-of-the-art for CarRacing, while requiring 500X fewer environment interactions.",
        "creator": "Abdus Salam Azad, Izzeddin Gur, Jasper Emhoff, Nathaniel Alexis, Aleksandra Faust, Pieter Abbeel, Ion Stoica"
      },
      {
        "title": "RMBench: Benchmarking Deep Reinforcement Learning for Robotic Manipulator Control.",
        "link": "http://arxiv.org/abs/2210.11262",
        "abstract": "Reinforcement learning is applied to solve actual complex tasks from high-dimensional, sensory inputs. The last decade has developed a long list of reinforcement learning algorithms. Recent progress benefits from deep learning for raw sensory signal representation. One question naturally arises: how well do they perform concerning different robotic manipulation tasks? Benchmarks use objective performance metrics to offer a scientific way to compare algorithms. In this paper, we present RMBench, the first benchmark for robotic manipulations, which have high-dimensional continuous action and state spaces. We implement and evaluate reinforcement learning algorithms that directly use observed pixels as inputs. We report their average performance and learning curves to show their performance and stability of training. Our study concludes that none of the studied algorithms can handle all tasks well, soft Actor-Critic outperforms most algorithms in average reward and stability, and an algorithm combined with data augmentation may facilitate learning policies. Our code is publicly available at https://github.com/xiangyanfei212/RMBench-2022, including all benchmark tasks and studied algorithms.",
        "creator": "Yanfei Xiang, Xin Wang, Shu Hu, Bin Zhu, Xiaomeng Huang, Xi Wu, Siwei Lyu"
      },
      {
        "title": "Bridging Distributional and Risk-sensitive Reinforcement Learning with Provable Regret Bounds.",
        "link": "http://arxiv.org/abs/2210.14051",
        "abstract": "We study the regret guarantee for risk-sensitive reinforcement learning (RSRL) via distributional reinforcement learning (DRL) methods. In particular, we consider finite episodic Markov decision processes whose objective is the entropic risk measure (EntRM) of return. We identify a key property of the EntRM, the monotonicity-preserving property, which enables the risk-sensitive distributional dynamic programming framework. We then propose two novel DRL algorithms that implement optimism through two different schemes, including a model-free one and a model-based one.  We prove that both of them attain $\\tilde{\\mathcal{O}}(\\frac{\\exp(|\\beta| H)-1}{|\\beta|H}H\\sqrt{HS^2AT})$ regret upper bound, where $S$ is the number of states, $A$ the number of states, $H$ the time horizon and $T$ the number of total time steps. It matches RSVI2 proposed in \\cite{fei2021exponential} with a much simpler regret analysis. To the best of our knowledge, this is the first regret analysis of DRL, which bridges DRL and RSRL in terms of sample complexity. Finally, we improve the existing lower bound by proving a tighter bound of $\\Omega(\\frac{\\exp(\\beta H/6)-1}{\\beta H}H\\sqrt{SAT})$ for $\\beta&gt;0$ case, which recovers the tight lower bound $\\Omega(H\\sqrt{SAT})$ in the risk-neutral setting.",
        "creator": "Hao Liang, Zhi-Quan Luo"
      },
      {
        "title": "Physics-Informed Machine Learning: A Survey on Problems, Methods and Applications.",
        "link": "http://arxiv.org/abs/2211.08064",
        "abstract": "Recent advances of data-driven machine learning have revolutionized fields like computer vision, reinforcement learning, and many scientific and engineering domains. In many real-world and scientific problems, systems that generate data are governed by physical laws. Recent work shows that it provides potential benefits for machine learning models by incorporating the physical prior and collected data, which makes the intersection of machine learning and physics become a prevailing paradigm. By integrating the data and mathematical physics models seamlessly, it can guide the machine learning model towards solutions that are physically plausible, improving accuracy and efficiency even in uncertain and high-dimensional contexts. In this survey, we present this learning paradigm called Physics-Informed Machine Learning (PIML) which is to build a model that leverages empirical data and available physical prior knowledge to improve performance on a set of tasks that involve a physical mechanism. We systematically review the recent development of physics-informed machine learning from three perspectives of machine learning tasks, representation of physical prior, and methods for incorporating physical prior. We also propose several important open research problems based on the current trends in the field. We argue that encoding different forms of physical prior into model architectures, optimizers, inference algorithms, and significant domain-specific applications like inverse engineering design and robotic control is far from being fully explored in the field of physics-informed machine learning. We believe that the interdisciplinary research of physics-informed machine learning will significantly propel research progress, foster the creation of more effective machine learning models, and also offer invaluable assistance in addressing long-standing problems in related disciplines.",
        "creator": "Zhongkai Hao, Songming Liu, Yichi Zhang, Chengyang Ying, Yao Feng, Hang Su, Jun Zhu"
      },
      {
        "title": "Learning Reward Functions for Robotic Manipulation by Observing Humans.",
        "link": "http://arxiv.org/abs/2211.09019",
        "abstract": "Observing a human demonstrator manipulate objects provides a rich, scalable and inexpensive source of data for learning robotic policies. However, transferring skills from human videos to a robotic manipulator poses several challenges, not least a difference in action and observation spaces. In this work, we use unlabeled videos of humans solving a wide range of manipulation tasks to learn a task-agnostic reward function for robotic manipulation policies. Thanks to the diversity of this training data, the learned reward function sufficiently generalizes to image observations from a previously unseen robot embodiment and environment to provide a meaningful prior for directed exploration in reinforcement learning. We propose two methods for scoring states relative to a goal image: through direct temporal regression, and through distances in an embedding space obtained with time-contrastive learning. By conditioning the function on a goal image, we are able to reuse one model across a variety of tasks. Unlike prior work on leveraging human videos to teach robots, our method, Human Offline Learned Distances (HOLD) requires neither a priori data from the robot environment, nor a set of task-specific human demonstrations, nor a predefined notion of correspondence across morphologies, yet it is able to accelerate training of several manipulation tasks on a simulated robot arm compared to using only a sparse reward obtained from task completion.",
        "creator": "Minttu Alakuijala, Gabriel Dulac-Arnold, Julien Mairal, Jean Ponce, Cordelia Schmid"
      },
      {
        "title": "ACon$^2$: Adaptive Conformal Consensus for Provable Blockchain Oracles.",
        "link": "http://arxiv.org/abs/2211.09330",
        "abstract": "Blockchains with smart contracts are distributed ledger systems that achieve block-state consistency among distributed nodes by only allowing deterministic operations of smart contracts. However, the power of smart contracts is enabled by interacting with stochastic off-chain data, which in turn opens the possibility to undermine the block-state consistency. To address this issue, an oracle smart contract is used to provide a single consistent source of external data; but, simultaneously, this introduces a single point of failure, which is called the oracle problem. To address the oracle problem, we propose an adaptive conformal consensus (ACon$^2$) algorithm that derives a consensus set of data from multiple oracle contracts via the recent advance in online uncertainty quantification learning. Interesting, the consensus set provides a desired correctness guarantee under distribution shift and Byzantine adversaries. We demonstrate the efficacy of the proposed algorithm on two price datasets and an Ethereum case study. In particular, the Solidity implementation of the proposed algorithm shows the potential practicality of the proposed algorithm, implying that online machine learning algorithms are applicable to address security issues in blockchains.",
        "creator": "Sangdon Park, Osbert Bastani, Taesoo Kim"
      },
      {
        "title": "Spatio-Temporal Meta-Graph Learning for Traffic Forecasting.",
        "link": "http://arxiv.org/abs/2211.14701",
        "abstract": "Traffic forecasting as a canonical task of multivariate time series forecasting has been a significant research topic in AI community. To address the spatio-temporal heterogeneity and non-stationarity implied in the traffic stream, in this study, we propose Spatio-Temporal Meta-Graph Learning as a novel Graph Structure Learning mechanism on spatio-temporal data. Specifically, we implement this idea into Meta-Graph Convolutional Recurrent Network (MegaCRN) by plugging the Meta-Graph Learner powered by a Meta-Node Bank into GCRN encoder-decoder. We conduct a comprehensive evaluation on two benchmark datasets (i.e., METR-LA and PEMS-BAY) and a new large-scale traffic speed dataset called EXPY-TKY that covers 1843 expressway road links in Tokyo. Our model outperformed the state-of-the-arts on all three datasets. Besides, through a series of qualitative evaluations, we demonstrate that our model can explicitly disentangle the road links and time slots with different patterns and be robustly adaptive to any anomalous traffic situations. Codes and datasets are available at https://github.com/deepkashiwa20/MegaCRN.",
        "creator": "Renhe Jiang, Zhaonan Wang, Jiawei Yong, Puneet Jeph, Quanjun Chen, Yasumasa Kobayashi, Xuan Song, Shintaro Fukushima, Toyotaro Suzumura"
      },
      {
        "title": "MHCCL: Masked Hierarchical Cluster-wise Contrastive Learning for Multivariate Time Series.",
        "link": "http://arxiv.org/abs/2212.01141",
        "abstract": "Learning semantic-rich representations from raw unlabeled time series data is critical for downstream tasks such as classification and forecasting. Contrastive learning has recently shown its promising representation learning capability in the absence of expert annotations. However, existing contrastive approaches generally treat each instance independently, which leads to false negative pairs that share the same semantics. To tackle this problem, we propose MHCCL, a Masked Hierarchical Cluster-wise Contrastive Learning model, which exploits semantic information obtained from the hierarchical structure consisting of multiple latent partitions for multivariate time series. Motivated by the observation that fine-grained clustering preserves higher purity while coarse-grained one reflects higher-level semantics, we propose a novel downward masking strategy to filter out fake negatives and supplement positives by incorporating the multi-granularity information from the clustering hierarchy. In addition, a novel upward masking strategy is designed in MHCCL to remove outliers of clusters at each partition to refine prototypes, which helps speed up the hierarchical clustering process and improves the clustering quality. We conduct experimental evaluations on seven widely-used multivariate time series datasets. The results demonstrate the superiority of MHCCL over the state-of-the-art approaches for unsupervised time series representation learning.",
        "creator": "Qianwen Meng, Hangwei Qian, Yong Liu, Lizhen Cui, Yonghui Xu, Zhiqi Shen"
      },
      {
        "title": "Learning-Assisted Algorithm Unrolling for Online Optimization with Budget Constraints.",
        "link": "http://arxiv.org/abs/2212.01689",
        "abstract": "Online optimization with multiple budget constraints is challenging since the online decisions over a short time horizon are coupled together by strict inventory constraints. The existing manually-designed algorithms cannot achieve satisfactory average performance for this setting because they often need a large number of time steps for convergence and/or may violate the inventory constraints. In this paper, we propose a new machine learning (ML) assisted unrolling approach, called LAAU (Learning-Assisted Algorithm Unrolling), which unrolls the online decision pipeline and leverages an ML model for updating the Lagrangian multiplier online. For efficient training via backpropagation, we derive gradients of the decision pipeline over time. We also provide the average cost bounds for two cases when training data is available offline and collected online, respectively. Finally, we present numerical results to highlight that LAAU can outperform the existing baselines.",
        "creator": "Jianyi Yang, Shaolei Ren"
      },
      {
        "title": "Safe Inverse Reinforcement Learning via Control Barrier Function.",
        "link": "http://arxiv.org/abs/2212.02753",
        "abstract": "Learning from Demonstration (LfD) is a powerful method for enabling robots to perform novel tasks as it is often more tractable for a non-roboticist end-user to demonstrate the desired skill and for the robot to efficiently learn from the associated data than for a human to engineer a reward function for the robot to learn the skill via reinforcement learning (RL). Safety issues arise in modern LfD techniques, e.g., Inverse Reinforcement Learning (IRL), just as they do for RL; yet, safe learning in LfD has received little attention. In the context of agile robots, safety is especially vital due to the possibility of robot-environment collision, robot-human collision, and damage to the robot. In this paper, we propose a safe IRL framework, CBFIRL, that leverages the Control Barrier Function (CBF) to enhance the safety of the IRL policy. The core idea of CBFIRL is to combine a loss function inspired by CBF requirements with the objective in an IRL method, both of which are jointly optimized via gradient descent. In the experiments, we show our framework performs safer compared to IRL methods without CBF, that is $\\sim15\\%$ and $\\sim20\\%$ improvement for two levels of difficulty of a 2D racecar domain and $\\sim 50\\%$ improvement for a 3D drone domain.",
        "creator": "Yue Yang, Letian Chen, Matthew Gombolay"
      },
      {
        "title": "On Calibrating Semantic Segmentation Models: Analyses and An Algorithm.",
        "link": "http://arxiv.org/abs/2212.12053",
        "abstract": "We study the problem of semantic segmentation calibration. For image classification, lots of existing solutions are proposed to alleviate model miscalibration of confidence. However, to date, confidence calibration research on semantic segmentation is still limited. We provide a systematic study on the calibration of semantic segmentation models and propose a simple yet effective approach. First, we find that model capacity, crop size, multi-scale testing, and prediction correctness have impact on calibration. Among them, prediction correctness, especially misprediction, is more important to miscalibration due to over-confidence. Next, we propose a simple, unifying, and effective approach, namely selective scaling, by separating correct/incorrect prediction for scaling and more focusing on misprediction logit smoothing. Then, we study popular existing calibration methods and compare them with selective scaling on semantic segmentation calibration. We conduct extensive experiments with a variety of benchmarks on both in-domain and domain-shift calibration, and show that selective scaling consistently outperforms other methods.",
        "creator": "Dongdong Wang, Boqing Gong, Liqiang Wang"
      },
      {
        "title": "Track Before Detect of Low Observable Maneuvering Objects in a Sequence of Image Frames Using Particle Filter.",
        "link": "http://arxiv.org/abs/2212.13020",
        "abstract": "A multiple model track-before-detect (TBD) particle filter-based approach for detection and tracking of low observable maneuvering objects based on a sequence of image frames in the presence of noise and clutter is briefly studied in this letter. At each time instance after receiving a frame of image, first, some preprocessing approaches are applied to the image. Then, it is sent to the multiple model TBD particle filter for detection and tracking of an object. Performance of the approach is evaluated for detection and tracking of an object in different scenarios including noise and clutter.",
        "creator": "Reza Rezaie"
      },
      {
        "title": "Semantics-enhanced Temporal Graph Networks for Content Caching and Energy Saving.",
        "link": "http://arxiv.org/abs/2301.12355",
        "abstract": "The enormous amount of network equipment and users implies a tremendous growth of Internet traffic for multimedia services. To mitigate the traffic pressure, architectures with in-network storage are proposed to cache popular content at nodes in close proximity to users to shorten the backhaul links. Meanwhile, the reduction of transmission distance also contributes to the energy saving. However, due to limited storage, only a fraction of the content can be cached, while caching the most popular content is cost-effective. Correspondingly, it becomes essential to devise an effective popularity prediction method. In this regard, existing efforts adopt dynamic graph neural network (DGNN) models, but it remains challenging to tackle sparse datasets. In this paper, we first propose a reformative temporal graph network, which is named STGN, that utilizes extra semantic messages to enhance the temporal and structural learning of a DGNN model, since the consideration of semantics can help establish implicit paths within the sparse interaction graph and hence improve the prediction performance. Furthermore, we propose a user-specific attention mechanism to fine-grainedly aggregate various semantics. Finally, extensive simulations verify the superiority of our STGN models and demonstrate their high potential in energy-saving.",
        "creator": "Jianhang Zhu, Rongpeng Li, Xianfu Chen, Shiwen Mao, Jianjun Wu, Zhifeng Zhao"
      },
      {
        "title": "Private, fair and accurate: Training large-scale, privacy-preserving AI models in medical imaging.",
        "link": "http://arxiv.org/abs/2302.01622",
        "abstract": "Artificial intelligence (AI) models are increasingly used in the medical domain. However, as medical data is highly sensitive, special precautions to ensure its protection are required. The gold standard for privacy preservation is the introduction of differential privacy (DP) to model training. Prior work indicates that DP has negative implications on model accuracy and fairness, which are unacceptable in medicine and represent a main barrier to the widespread use of privacy-preserving techniques. In this work, we evaluated the effect of privacy-preserving training of AI models for chest radiograph diagnosis regarding accuracy and fairness compared to non-private training. For this, we used a large dataset (N=193,311) of high quality clinical chest radiographs, which were retrospectively collected and manually labeled by experienced radiologists. We then compared non-private deep convolutional neural networks (CNNs) and privacy-preserving (DP) models with respect to privacy-utility trade-offs measured as area under the receiver-operator-characteristic curve (AUROC), and privacy-fairness trade-offs, measured as Pearson's r or Statistical Parity Difference. We found that the non-private CNNs achieved an average AUROC score of 0.90 +- 0.04 over all labels, whereas the DP CNNs with a privacy budget of epsilon=7.89 resulted in an AUROC of 0.87 +- 0.04, i.e., a mere 2.6% performance decrease compared to non-private training. Furthermore, we found the privacy-preserving training not to amplify discrimination against age, sex or co-morbidity. Our study shows that -- under the challenging realistic circumstances of a real-life clinical dataset -- the privacy-preserving training of diagnostic deep learning models is possible with excellent diagnostic accuracy and fairness.",
        "creator": "Soroosh Tayebi Arasteh, Alexander Ziller, Christiane Kuhl, Marcus Makowski, Sven Nebelung, Rickmer Braren, Daniel Rueckert, Daniel Truhn, Georgios Kaissis"
      },
      {
        "title": "Local Neural Descriptor Fields: Locally Conditioned Object Representations for Manipulation.",
        "link": "http://arxiv.org/abs/2302.03573",
        "abstract": "A robot operating in a household environment will see a wide range of unique and unfamiliar objects. While a system could train on many of these, it is infeasible to predict all the objects a robot will see. In this paper, we present a method to generalize object manipulation skills acquired from a limited number of demonstrations, to novel objects from unseen shape categories. Our approach, Local Neural Descriptor Fields (L-NDF), utilizes neural descriptors defined on the local geometry of the object to effectively transfer manipulation demonstrations to novel objects at test time. In doing so, we leverage the local geometry shared between objects to produce a more general manipulation framework. We illustrate the efficacy of our approach in manipulating novel objects in novel poses -- both in simulation and in the real world.",
        "creator": "Ethan Chun, Yilun Du, Anthony Simeonov, Tomas Lozano-Perez, Leslie Kaelbling"
      },
      {
        "title": "3M3D: Multi-view, Multi-path, Multi-representation for 3D Object Detection.",
        "link": "http://arxiv.org/abs/2302.08231",
        "abstract": "3D visual perception tasks based on multi-camera images are essential for autonomous driving systems. Latest work in this field performs 3D object detection by leveraging multi-view images as an input and iteratively enhancing object queries (object proposals) by cross-attending multi-view features. However, individual backbone features are not updated with multi-view features and it stays as a mere collection of the output of the single-image backbone network. Therefore we propose 3M3D: A Multi-view, Multi-path, Multi-representation for 3D Object Detection where we update both multi-view features and query features to enhance the representation of the scene in both fine panoramic view and coarse global view. Firstly, we update multi-view features by multi-view axis self-attention. It will incorporate panoramic information in the multi-view features and enhance understanding of the global scene. Secondly, we update multi-view features by self-attention of the ROI (Region of Interest) windows which encodes local finer details in the features. It will help exchange the information not only along the multi-view axis but also along the other spatial dimension. Lastly, we leverage the fact of multi-representation of queries in different domains to further boost the performance. Here we use sparse floating queries along with dense BEV (Bird's Eye View) queries, which are later post-processed to filter duplicate detections. Moreover, we show performance improvements on nuScenes benchmark dataset on top of our baselines.",
        "creator": "Jongwoo Park, Apoorv Singh, Varun Bankiti"
      },
      {
        "title": "Complex QA and language models hybrid architectures, Survey.",
        "link": "http://arxiv.org/abs/2302.09051",
        "abstract": "This paper provides a survey of the state of the art of hybrid language models architectures and strategies for \"complex\" question-answering (QA, CQA, CPS). Very large language models are good at leveraging public data on standard problems but once you want to tackle more specific complex questions or problems you may need specific architecture, knowledge, skills, tasks, methods, sensitive data, performance, human approval and versatile feedback... This survey extends findings from the robust community edited research papers BIG, BLOOM and HELM which open source, benchmark and analyze limits and challenges of large language models in terms of tasks complexity and strict evaluation on accuracy (e.g. fairness, robustness, toxicity, ...). It identifies the key elements used with Large Language Models (LLM) to solve complex questions or problems. Recent projects like ChatGPT and GALACTICA have allowed non-specialists to grasp the great potential as well as the equally strong limitations of language models in complex QA. Hybridizing these models with different components could allow to overcome these different limits and go much further. We discuss some challenges associated with complex QA, including domain adaptation, decomposition and efficient multi-step QA, long form QA, non-factoid QA, safety and multi-sensitivity data protection, multimodal search, hallucinations, QA explainability and truthfulness, time dimension. Therefore we review current solutions and promising strategies, using elements such as hybrid LLM architectures, human-in-the-loop reinforcement learning, prompting adaptation, neuro-symbolic and structured knowledge grounding, program synthesis, and others. We analyze existing solutions and provide an overview of the current research and trends in the area of complex QA.",
        "creator": "Xavier Daull, Patrice Bellot, Emmanuel Bruno, Vincent Martin, Elisabeth Murisasco"
      },
      {
        "title": "Robot path planning using deep reinforcement learning.",
        "link": "http://arxiv.org/abs/2302.09120",
        "abstract": "Autonomous navigation is challenging for mobile robots, especially in an unknown environment. Commonly, the robot requires multiple sensors to map the environment, locate itself, and make a plan to reach the target. However, reinforcement learning methods offer an alternative to map-free navigation tasks by learning the optimal actions to take. In this article, deep reinforcement learning agents are implemented using variants of the deep Q networks method, the D3QN and rainbow algorithms, for both the obstacle avoidance and the goal-oriented navigation task. The agents are trained and evaluated in a simulated environment. Furthermore, an analysis of the changes in the behaviour and performance of the agents caused by modifications in the reward function is conducted.",
        "creator": "Miguel Quinones-Ramirez, Jorge Rios-Martinez, Victor Uc-Cetina"
      },
      {
        "title": "Recent Advances towards Safe, Responsible, and Moral Dialogue Systems: A Survey.",
        "link": "http://arxiv.org/abs/2302.09270",
        "abstract": "With the development of artificial intelligence, dialogue systems have been endowed with amazing chit-chat capabilities, and there is widespread interest and discussion about whether the generated contents are socially beneficial. In this paper, we present a new perspective of research scope towards building a safe, responsible, and modal dialogue system, including 1) abusive and toxic contents, 2) unfairness and discrimination, 3) ethics and morality issues, and 4) risk of misleading and privacy information. Besides, we review the mainstream methods for evaluating the safety of large models from the perspectives of exposure and detection of safety issues. The recent advances in methodologies for the safety improvement of both end-to-end dialogue systems and pipeline-based models are further introduced. Finally, we discussed six existing challenges towards responsible AI: explainable safety monitoring, continuous learning of safety issues, robustness against malicious attacks, multimodal information processing, unified research framework, and multidisciplinary theory integration. We hope this survey will inspire further research toward safer dialogue systems.",
        "creator": "Jiawen Deng, Hao Sun, Zhexin Zhang, Jiale Cheng, Minlie Huang"
      },
      {
        "title": "Can discrete information extraction prompts generalize across language models?.",
        "link": "http://arxiv.org/abs/2302.09865",
        "abstract": "We study whether automatically-induced prompts that effectively extract information from a language model can also be used, out-of-the-box, to probe other language models for the same information. After confirming that discrete prompts induced with the AutoPrompt algorithm outperform manual and semi-manual prompts on the slot-filling task, we demonstrate a drop in performance for AutoPrompt prompts learned on a model and tested on another. We introduce a way to induce prompts by mixing language models at training time that results in prompts that generalize well across models. We conduct an extensive analysis of the induced prompts, finding that the more general prompts include a larger proportion of existing English words and have a less order-dependent and more uniform distribution of information across their component tokens. Our work provides preliminary evidence that it's possible to generate discrete prompts that can be induced once and used with a number of different models, and gives insights on the properties characterizing such prompts.",
        "creator": "Nathana&#xeb;l Carraz Rakotonirina, Roberto Dess&#xec;, Fabio Petroni, Sebastian Riedel, Marco Baroni"
      },
      {
        "title": "UAV Path Planning Employing MPC- Reinforcement Learning Method Considering Collision Avoidance.",
        "link": "http://arxiv.org/abs/2302.10669",
        "abstract": "In this paper, we tackle the problem of Unmanned Aerial (UA V) path planning in complex and uncertain environments by designing a Model Predictive Control (MPC), based on a Long-Short-Term Memory (LSTM) network integrated into the Deep Deterministic Policy Gradient algorithm. In the proposed solution, LSTM-MPC operates as a deterministic policy within the DDPG network, and it leverages a predicting pool to store predicted future states and actions for improved robustness and efficiency. The use of the predicting pool also enables the initialization of the critic network, leading to improved convergence speed and reduced failure rate compared to traditional reinforcement learning and deep reinforcement learning methods. The effectiveness of the proposed solution is evaluated by numerical simulations.",
        "creator": "Mahya Ramezani, Hamed Habibi, Jose luis Sanchez Lopez, Holger Voos"
      },
      {
        "title": "Model-Based Uncertainty in Value Functions.",
        "link": "http://arxiv.org/abs/2302.12526",
        "abstract": "We consider the problem of quantifying uncertainty over expected cumulative rewards in model-based reinforcement learning. In particular, we focus on characterizing the variance over values induced by a distribution over MDPs. Previous work upper bounds the posterior variance over values by solving a so-called uncertainty Bellman equation, but the over-approximation may result in inefficient exploration. We propose a new uncertainty Bellman equation whose solution converges to the true posterior variance over values and explicitly characterizes the gap in previous work. Moreover, our uncertainty quantification technique is easily integrated into common exploration strategies and scales naturally beyond the tabular setting by using standard deep reinforcement learning architectures. Experiments in difficult exploration tasks, both in tabular and continuous control settings, show that our sharper uncertainty estimates improve sample-efficiency.",
        "creator": "Carlos E. Luis, Alessandro G. Bottero, Julia Vinogradska, Felix Berkenkamp, Jan Peters"
      },
      {
        "title": "STACC: Code Comment Classification using SentenceTransformers.",
        "link": "http://arxiv.org/abs/2302.13149",
        "abstract": "Code comments are a key resource for information about software artefacts. Depending on the use case, only some types of comments are useful. Thus, automatic approaches to classify these comments have been proposed. In this work, we address this need by proposing, STACC, a set of SentenceTransformers-based binary classifiers. These lightweight classifiers are trained and tested on the NLBSE Code Comment Classification tool competition dataset, and surpass the baseline by a significant margin, achieving an average F1 score of 0.74 against the baseline of 0.31, which is an improvement of 139%. A replication package, as well as the models themselves, are publicly available.",
        "creator": "Ali Al-Kaswan, Maliheh Izadi, Arie van Deursen"
      },
      {
        "title": "An Information-Theoretic Perspective on Variance-Invariance-Covariance Regularization.",
        "link": "http://arxiv.org/abs/2303.00633",
        "abstract": "In this paper, we provide an information-theoretic perspective on Variance-Invariance-Covariance Regularization (VICReg) for self-supervised learning. To do so, we first demonstrate how information-theoretic quantities can be obtained for deterministic networks as an alternative to the commonly used unrealistic stochastic networks assumption. Next, we relate the VICReg objective to mutual information maximization and use it to highlight the underlying assumptions of the objective. Based on this relationship, we derive a generalization bound for VICReg, providing generalization guarantees for downstream supervised learning tasks and present new self-supervised learning methods, derived from a mutual information maximization objective, that outperform existing methods in terms of performance. This work provides a new information-theoretic perspective on self-supervised learning and Variance-Invariance-Covariance Regularization in particular and guides the way for improved transfer learning via information-theoretic self-supervised learning objectives.",
        "creator": "Ravid Shwartz-Ziv, Randall Balestriero, Kenji Kawaguchi, Tim G. J. Rudner, Yann LeCun"
      },
      {
        "title": "Can ChatGPT Assess Human Personalities? A General Evaluation Framework.",
        "link": "http://arxiv.org/abs/2303.01248",
        "abstract": "Large Language Models (LLMs) especially ChatGPT have produced impressive results in various areas, but their potential human-like psychology is still largely unexplored. Existing works study the virtual personalities of LLMs but rarely explore the possibility of analyzing human personalities via LLMs. This paper presents a generic evaluation framework for LLMs to assess human personalities based on Myers Briggs Type Indicator (MBTI) tests. Specifically, we first devise unbiased prompts by randomly permuting options in MBTI questions and adopt the average testing result to encourage more impartial answer generation. Then, we propose to replace the subject in question statements to enable flexible queries and assessments on different subjects from LLMs. Finally, we re-formulate the question instructions in a manner of correctness evaluation to facilitate LLMs to generate clearer responses. The proposed framework enables LLMs to flexibly assess personalities of different groups of people. We further propose three evaluation metrics to measure the consistency, robustness, and fairness of assessment results from state-of-the-art LLMs including ChatGPT and InstructGPT. Our experiments reveal ChatGPT's ability to assess human personalities, and the average results demonstrate that it can achieve more consistent and fairer assessments in spite of lower robustness against prompt biases compared with InstructGPT.",
        "creator": "Haocong Rao, Cyril Leung, Chunyan Miao"
      },
      {
        "title": "Reparameterization through Spatial Gradient Scaling.",
        "link": "http://arxiv.org/abs/2303.02733",
        "abstract": "Reparameterization aims to improve the generalization of deep neural networks by transforming convolutional layers into equivalent multi-branched structures during training. However, there exists a gap in understanding how reparameterization may change and benefit the learning process of neural networks. In this paper, we present a novel spatial gradient scaling method to redistribute learning focus among weights in convolutional networks. We prove that spatial gradient scaling achieves the same learning dynamics as a branched reparameterization yet without introducing structural changes into the network. We further propose an analytical approach that dynamically learns scalings for each convolutional layer based on the spatial characteristics of its input feature map gauged by mutual information. Experiments on CIFAR-10, CIFAR-100, and ImageNet show that without searching for reparameterized structures, our proposed scaling method outperforms the state-of-the-art reparameterization strategies at a lower computational cost.",
        "creator": "Alexander Detkov, Mohammad Salameh, Muhammad Fetrat Qharabagh, Jialin Zhang, Wei Lui, Shangling Jui, Di Niu"
      }
    ]
  },
  {
    "name": "Plant Biology",
    "feed": [
      {
        "title": "Knockout of endoplasmic reticulum localized molecular chaperone HSP90.7 impairs seeding development and cellular auxin homeostasis in Arabidopsis",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.06.531358v1?rss=1",
        "abstract": "The Arabidopsis endoplasmic reticulum localized heat shock protein HSP90.7 modulates tissue differentiation and stress responses; however, complete knockout lines have not been previously reported. In this study, we identified and analyzed a mutant allele, hsp90.7-1, which did not express any protein and showed seedling lethality. Microscopic analyses revealed its essential role in male and female fertility, trichomes and root hairs development, proper chloroplast function, and in apical meristem maintenance and differentiation. Comparative transcriptome and proteome analyses also revealed a role of the protein in a multitude of cellular processes. Particularly, the auxin responsive pathway was specifically down-regulated in the hsp90.7-1 mutant seedlings. We measured a much-reduced auxin content in both root and shoot tissues. Through comprehensive histological and molecular analyses, we demonstrated PIN1 and PIN5 expressions were dramatically reduced in the mutant, and the TAA-YUCCA primary auxin biosynthesis pathway was also down-regulated, thus revealing a critical new role of HSP90.7 in the regulation of auxin responses. This study therefore not only fulfilled a gap in understanding the essential role of HSP90 paralogs in eukaryotes, but also provided a mechanistic insight on this molecular chaperone in regulating plant growth and development via modulating cellular auxin homeostasis.",
        "creator": "Noureddine, J., Mu, B., Hamidzada, H., Mok, W., Bonea, D., Nambara, E., Zhao, R."
      },
      {
        "title": "Comparative transcriptomics reveals divergence in pathogen response gene families amongst twenty forest tree species",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.06.531373v1?rss=1",
        "abstract": "Forest trees provide critical ecosystem services for humanity that are under threat due to ongoing global change. Measuring and characterizing genetic diversity is key to understanding adaptive potential and developing strategies to mitigate negative consequences arising from climate change. In the area of forest genetic diversity, genetic divergence caused by large-scale changes at the chromosomal level have been largely understudied. In this study, we used the RNA-seq data of twenty co-occurring forest trees species from genera including Acer, Alnus, Amelanchier, Betula, Cornus, Corylus, Dirca, Fraxinus, Ostrya, Populus, Prunus, Quercus, Ribes, Tilia, and Ulmus sampled from Upper Peninsula of Michigan. These data were used to infer the origin and maintenance of gene family variation, species divergence time, as well as gene family expansion and contraction. We identified a signal of common whole genome duplication events shared by core eudicots, and a signal of recent duplication events specific to particular species. We also found rapid evolution, namely fast expansion or fast contraction of gene families, in plant-pathogen interaction genes amongst the diploid species studied. Finally, the results lay the foundation for further research on the genetic diversity and adaptive capacity of forest trees, which will inform forest management and conservation policies.",
        "creator": "Lu, M., Cao, M., Yang, J., Swenson, N. G."
      },
      {
        "title": "Myosin VIII and XI isoforms interact with Agrobacterium VirE2 protein and help direct transport from the plasma membrane to the perinuclear region during plant transformation",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.06.531343v1?rss=1",
        "abstract": "Agrobacterium transfers T-DNA and effector proteins into plant cells. VirE2, one of these virulence effectors, enters the plant cell and is thought to bind T-strands. How VirE2 is trafficked inside the plant cell is not fully understood. Using bimolecular fluorescence complementation, in vitro pull-down, yeast two-hybrid, and in vivo co-immunoprecipitation assays, we found that VirE2 binds directly to the cargo binding domains of several myosin VIII family members, and to myosin XI-K. We observed reduced susceptibility of several Arabidopsis actin mutants and a myosin VIII-1/2/a/b mutant to transformation. Expression of cargo binding domains of myosin VIII-1, VIII-2, VIII-A, or VIII-B inhibits Arabidopsis root transformation. However, no myosin VIII protein contributes to the intracellular trafficking of VirE2. Expression of myosin VIII-2, -A, -B, but not VIII-1, cDNAs in the myosin VIII-1/2/a/b mutant partially restored transformation. Fluorescently-tagged VirE2 relocalized from the cellular periphery into the cytoplasm after delivery of T-strands from Agrobacterium. Mutation of myosin XI-k and expression of the myosin XI-K cargo binding domain had no effect on transformation but blocked VirE2 movement. Myosin VIII proteins may facilitate VirE2 tethering to the plasma membrane from which they bind incoming T-strands. Myosin XI-K is important for VirE2 movement through the cytoplasm.",
        "creator": "Liu, N., Lee, L.-Y., Hsu, F.-Y., Yu, Y., Rao, P., Gelvin, S. B."
      },
      {
        "title": "Distinguishing integrated sub-viral fragments from infectious Rubus yellow net virus in Scottish commercial red raspberry cultivars",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.07.531471v1?rss=1",
        "abstract": "Short read sequencing of two field-grown plants of red raspberry cv Glen Dee identified sequences derived from Rubus yellow net virus (RYNV). Suprisingly, PCR primers designed to target these sequences amplified RYNV-specific DNA fragments from some high health nuclear stock raspberry plants, previously tested as free from RYNV infection. The complete sequence of a Scottish isolate of RYNV (RYNV LG) was determined and a panel of primers covering the entire virus genome was designed to demonstrate that nuclear stock plants of cultivars Glen Dee, Glen Ericht, Glen Fyne and Glen Moy all contain partial fragments of the RYNV genome as integrated elements but do not contain the entire RYNV genome. The complete, circular genome of RYNV could be detected in RYNV LG-infected plants by rolling circle amplification but was not detected in Glen Dee plants. Grafting experiments showed that infectious RYNV could be transferred from RYNV LG plants but not from Glen Dee or Glen Moy plants, further demonstrating that these cultivars contain only partial, integrated RYNV elements. Grafting of RYNV LG to the certification-approved indexing species R. occidentalis (black raspberry) and R. macraei, showed that RYNV LG induced recognisable symptoms in both plants but that R. macraei was more susceptible and produced more recognizable symptoms. Effective testing for RYNV in high health certified raspberry plants can be achieved by combining graft testing with multi-fragment PCR.",
        "creator": "McGavin, W., Jones, S., MacFarlane, S."
      },
      {
        "title": "Brassinosteroid receptor BRL3 triggers systemic plant adaptation to elevated temperature from the phloem cells",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.07.531487v1?rss=1",
        "abstract": "Understanding plant receptor signaling is crucial to mitigate climate change impact on agriculture. BRs bind to membrane receptor-kinase BR-INSENSITIVE 1 (BRI1) in most plant cells that is essential to promote growth and stress responses, while the roles of vascular BRI1-LIKE1 and 3 (BRL3) receptors were considered redundant. While going unnoticed for twenty years, our study unveils that brl3 mutants show conditional phenotypes to climate stress factors such as elevated temperatures, water deprivation and rising CO2 levels. In response to adverse climate conditions such as elevated temperature, BRL3 signaling at the phloem-companion cells can promote growth by activating BRI1-EMS-SUPPRESSOR1 (BES1) effector, hormonal homeostasis, and central carbon metabolism. This study shifts the paradigm for our present understanding of BR signaling and opens innovative strategies to develop climate-smart crops.",
        "creator": "Gupta, A., Medina, A. R., Elena, F. L., Bueno, M. M., Fontanet, J. B., Fabregas, N., Alseekh, S., Fernie, A. R., Cano-Delgado, A. I."
      },
      {
        "title": "Fagalean phylogeny in a nutshell: Chronicling the diversification history of Fagales",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.06.531381v1?rss=1",
        "abstract": "Reconstructing the biogeographical history and timing of the diversification of temperate forests is essential for understanding their history and resolving uncertainties about how flowering plants emerged from their deep tropical origins to dominate in today's freezing terrestrial environments. The angiosperm order Fagales, comprising iconic components of temperate forests worldwide with an extensive fossil record, are an excellent plant system in which to apply a fossil-aware paradigm, such as the fossilized birth-death (FBD) process, for investigating the macroevolution of temperate forest biomes. Here, we improve upon previous efforts to resolve phylogeny and incorporate fossils in Fagales using low-copy nuclear loci and an expanded morphological matrix to reevaluate the Fagales fossil record and: (1) infer the phylogenetic relationships and the time of origin of the clade using the FBD model as implemented in RevBayes, (2) provide a framework for evaluating the climatic and biogeographic history of Fagales, and (3) investigate how the inclusion of fossils via the FBD method influences ancestral reconstruction and diversification estimation. The phylogenetic relationships we recovered are conventional except for the position of Nothofagaceae, while our inferred ages support older timelines than previously proposed, with a mid-Cretaceous date for the most recent common ancestor of the order. Biogeographical analysis shows an origin of Fagales consistent with an ancestral circumboreal temperate distribution corroborated by ancestral niche reconstructions. While distributions today largely reflect the general conservatism of temperate forests, we identified two episodes of high diversification, one at the mid-Cretaceous origin of the clade and the other continuing from the Miocene to the present. Removing fossil taxa from the tree reveals a different story, shifting the origin of extant families from North America to East Asia, reflecting refugial distributions in this biodiversity \"museum\" and implying a general bias towards low extinction areas in biogeographic reconstruction. Likewise, without fossil data, diversification estimates were higher and unable to detect an early diversification burst. Based on our analyses, we close with recommendations regarding the interpretation of estimates of diversification and ancestral state reconstruction using phylogenetic trees with only extant species as tips.",
        "creator": "Siniscalchi, C. M., Correa-Narvaez, J., Kates, H. R., Soltis, D. E., Soltis, P. S., Guralnick, R. P., Manchester, S. R., Folk, R. A."
      },
      {
        "title": "Roles of microbiota in autoimmunity in Arabidopsis",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.06.531303v1?rss=1",
        "abstract": "Over the past three decades, researchers have isolated plant mutants that display constitutively activated defense responses in the absence of pathogen infection. These mutants are called autoimmune mutants and are typically dwarf and/or bearing chlorotic/necrotic lesions. From a genetic screen for Arabidopsis genes involved in maintaining a normal leaf microbiota, we identified TIP GROWTH DEFECTIVE 1 (TIP1), which encodes a S-acyltransferase, as a key player in guarding leaves against abnormal microbiota level and composition under high humidity conditions. The tip1 mutant has several characteristic phenotypes of classical autoimmune mutants, including a dwarf stature, displaying lesions, and having a high basal level of defense gene expression. Gnotobiotic experiments revealed that the autoimmune phenotypes of the tip1 mutant are largely dependent on the presence of microbiota as axenic tip1 plants have markedly reduced autoimmune phenotypes. We found that the microbiota dependency of autoimmune phenotypes is shared by several \"lesion mimic\"-type autoimmune mutants in Arabidopsis. Interestingly, autoimmune phenotypes caused by mutations in NLR genes do not require the presence of microbiota and can even be partially alleviated by microbiota. Our results therefore suggest the existence of two classes of autoimmunity (microbiota-dependent vs. microbiota-independent) in plants. The observed interplay between autoimmunity and microbiota in the lesion mimic class of autoimmunity is reminiscent of the interactions between autoimmunity and dysbiosis in the animal kingdom.",
        "creator": "Cheng, Y. T., Thireault, C. A., Paasch, B. C., Zhang, L., He, S. Y."
      },
      {
        "title": "Detection and differentiation of Xanthomonas translucens pv. translucens and pv. undulosa from wheat and barley by duplex quantitative PCR",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.06.531419v1?rss=1",
        "abstract": "Two probe-based quantitative PCR (qPCR) systems, namely P-Xtt and P-Xtu, were developed for diagnosis of cereal bacterial leaf streak pathogens Xanthomonas translucens pv. translucens and pv. undulosa, respectively. P-Xtt is specific to pv. translucens. P-Xtu is specific to pv. undulosa, pv. cerealis, pv. secalis and pv. pistacia. P-Xtt and P-Xtu worked on all accessible strains of pv. translucens and pv. undulosa, respectively. Both systems could detect 100 copies of the target gBlock DNA. The two systems could be used in both singleplex qPCR and duplex qPCR with similar efficiencies. On genomic DNA from strains of various X. translucens pathovars, both singleplex qPCR and duplex qPCR could specifically detect and differentiate pv. translucens and pv. undulosa. On infected barley and wheat grain samples, the duplex qPCR showed similar efficiency compared to a previously published qPCR system but with the additional capability of pathovar differentiation. The duplex qPCR system developed in this study will be useful in studies on bacterial leaf streak and detection/differentiation of the pathogens.",
        "creator": "Fu, H., Fleitas, M., Sarkes, A., Wang, L., Yang, Y., Harding, M., Feindel, D., Kutcher, R., Feng, J."
      },
      {
        "title": "Leaf traits predict performance under varying levels of drought stress in cultivated sunflower (Helianthus annuus  L.)",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.06.531401v1?rss=1",
        "abstract": "Drought is a major agricultural challenge and is expected to worsen with climate change. Exploring plant traits and how they respond to drought has the potential to improve understanding of drought tolerance and inform breeding efforts to develop more drought tolerant plants. Given their importance in plant-water relations, we explored variation and plasticity in leaf traits in response to water limitation in cultivated sunflower (Helianthus annuus L.). A set of four sunflower genotypes was grown under four different levels of water availability and leaf vein and stomatal traits were measured along with total biomass (as an indicator of performance), leaf mass per area (LMA), chlorophyll content, and various mass fraction traits related to resource allocation (e.g., leaf, root, and stem mass fraction). Traits exhibited numerous bivariate correlations within treatments that generally followed expectations based on the literature. For example, stomatal size and density were negatively correlated while stomatal density and vein length per area (VLA) were positively correlated. Most traits exhibited substantial plasticity, as evidenced by significant shifts in trait values across environments and multivariate analyses revealed differentiation in trait space across treatment levels. This included an overall reduction in growth/productivity in response to stress, accompanied by a shift in traits relating to gas exchange and hydraulics including stomatal and vein density (increased), stomatal size (decreased), and theoretical gsmax (increased). We found that variation in performance across treatments (estimated as total biomass) can be largely explained by a small number of putatively size-independent traits (i.e., VLA, stomatal length and density and LMA; R2 = 0.74). Moreover, on average, more extreme changes in VLA were associated with more extreme decreases in performance across environments. A small number of leaf traits can predict plant performance, with plasticity in VLA being the best predictor of changes in productivity.",
        "creator": "Earley, A. M., Nolting, K., Burke, J. M."
      },
      {
        "title": "A rapid method to quantify vein density in C4 plants using starch staining",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.06.531345v1?rss=1",
        "abstract": "C4 photosynthesis has evolved multiple times in the angiosperms and typically involves alterations to the biochemistry, cell biology and development of leaves. One common modification found in C4 plants compared with the ancestral C3 state is an increase in vein density such that the leaf contains a larger proportion of bundle sheath cells. Recent findings indicate that there may be significant intra-specific variation in traits such as vein density in C4 plants but to use such natural variation for trait-mapping, rapid phenotyping would be required. Here we report a high-throughput method to quantify vein density that leverages the bundle sheath specific accumulation of starch found in C4 species. Starch staining allowed high-contrast images to be acquired that permitted image analysis using a MATLAB-based program. The method works for the dicotyledon Gynandropsis gynandra where significant variation in vein density was detected between natural accessions, and the monocotyledon Zea mays where no variation was apparent in the genotypically diverse lines assessed. We anticipate this approach will be useful to map genes controlling vein density in C4 species demonstrating natural variation for this trait.",
        "creator": "Simpson, C. J., Singh, P., Sogbohossou, D. E., Schranz, M. E., Hibberd, J. M."
      },
      {
        "title": "An improved Nicotiana benthamiana bioproduction chassis provides novel insights into nicotine biosynthesis",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.06.531326v1?rss=1",
        "abstract": "The model plant Nicotiana benthamiana is an increasingly attractive organism for the production of high-value, biologically active molecules. However, N. benthamiana accumulates high levels of pyridine alkaloids, in particular nicotine, which complicates the downstream purification processes. Here, we report the assembly of an improved N. benthamiana genome as well as the generation of low-nicotine lines by CRISPR/Cas9-based inactivation of berberine bridge enzyme-like proteins (BBLs). Triple as well as quintuple mutants accumulated 3-4 times less nicotine than the respective control lines. The availability of lines without functional BBLs allowed us to probe their catalytic role in nicotine biosynthesis, which has remained obscure. Notably, chiral analysis revealed that the enantiomeric purity of nicotine was fully lost in the quintuple mutants. In addition, precursor feeding experiments showed that these mutants cannot facilitate the specific loss of C6 hydrogen that characterizes natural nicotine biosynthesis. Our work delivers an improved N. benthamiana chassis for bioproduction and opens the possibility that BBLs are the sought-after coupling enzymes in nicotine biosynthesis.",
        "creator": "Vollheyde, K., Dudley, Q. M., Yang, T., Oz, M. T., Mancinotti, D., Fedi, M. O., Heavens, D., Linsmith, G., Chhetry, M., Smedley, M. A., Harwood, W. A., Swarbreck, D., Geu-Flores, F., Patron, N."
      },
      {
        "title": "Targeted development of diagnostic SNP markers for resistance to Fusarium wilt race 4 in Upland cotton (Gossypium hirsutum)",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.06.531315v1?rss=1",
        "abstract": "Fusarium wilt caused by the soil-borne fungus Fusarium oxysporum f. sp. vasinfectum (FOV) race 4 (FOV4) has become one of the most important emerging diseases in US cotton production. Numerous QTLs have been reported for resistance to FOV; however, no major FOV4-resistance QTL or gene has been identified and used in breeding Upland cotton (Gossypium hirsutum) for FOV4 resistance. In this study, a panel of 223 Chinese Upland cotton accessions was evaluated for FOV4 resistance based on seedling mortality rate (MR) and stem and root vascular discoloration (SVD and RVD). SNP markers were developed based on targeted genome sequencing using AgriPlex Genomics. The chromosome region at 2.130-2.292 Mb on D03 was significantly correlated with both SVD and RVD but not with MR. Based on the two most significant SNP markers, accessions homozygous for AA or TT SNP genotype averaged significantly lower SVD (0.88 vs. 2.54) and RVD (1.46 vs. 3.02) than those homozygous for CC or GG SNP genotype. The results suggested that a gene or genes within the region conferred resistance to vascular discoloration caused by FOV4. The Chinese Upland accessions had 37.22% homozygous AA or TT SNP genotype and 11.66% heterozygous AC or TG SNP genotype, while 32 US elite public breeding lines all had the CC or GG SNP genotype. Among 463 obsolete US Upland accessions, only 0.86% possessed the AA or TT SNP genotype. This study, for the first time, has developed diagnostic SNPs for marker-assisted selection and identified FOV4-resistant Upland germplasms with the SNPs.",
        "creator": "Zhang, J., Zhu, Y., Wheeler, T., Dever, J., Hake, K., Bissonnette, K."
      },
      {
        "title": "GenoDrawing: An autoencoder framework for image prediction from SNP markers",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.06.531351v1?rss=1",
        "abstract": "Advancements in genome sequencing have facilitated whole genome characterization of numerous plant species, providing an abundance of genotypic data for genomic analysis. Genomic selection and neural networks, particularly deep learning, have been developed to predict complex traits from dense genotypic data. Autoencoders, a neural network model to extract features from images in an unsupervised manner, has proven to be useful for plant phenotyping. This study introduces an autoencoder framework, GenoDrawing, for predicting and retrieving apple images from a low-depth single nucleotide polymorphism (SNP) array, potentially useful in predicting traits that are difficult to define. GenoDrawing demonstrated proficiency in its task while using a small dataset of shape-related SNPs, and multiple experiments were conducted to evaluate the impact of SNP selection and shape relation. Results indicated that the correct relationship of SNPs with visual traits had a significant impact on the generated images, consistent with biological interpretation. While using significant SNPs is crucial, incorporating additional, unrelated SNPs results in performance degradation for simple NN architectures that cannot easily identify the most important inputs. The proposed GenoDrawing method is a practical framework for exploring genomic prediction in fruit tree phenotyping, particularly beneficial for small to medium breeding companies to predict economically significant heritable traits. Although GenoDrawing has limitations, it sets the groundwork for future research in image prediction from genomic markers. Future studies should focus on using stronger models for image reproduction, SNP information extraction, and improved dataset balance in terms of shape for more precise outcomes.",
        "creator": "Jurado Ruiz, F., Rousseau, D., Botia, J. A., Aranzana, M. J."
      },
      {
        "title": "Diatom adhesive trail proteins acquired by horizontal gene transfer from bacteria serve as primers for marine biofilm formation",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.06.531300v1?rss=1",
        "abstract": "Biofilm-forming benthic diatoms are key primary producers in coastal habitats, where they frequently dominate sunlit submerged and intertidal substrata. The development of a unique form of gliding motility in raphid diatoms was a key molecular adaptation that contributed to their evolutionary success. Gliding motility is hypothesized to be driven by an intracellular actin-myosin motor and requires the secretion of polysaccharide- and protein-based adhesive materials. To date, the structure-function correlation between diatom adhesives utilized for gliding and their relationship to the extracellular matrix that constitutes the diatom biofilm is unknown. Proteomics analysis of the adhesive material from Craspedostauros australis revealed eight novel, diatom-specific proteins. Four of them constitute a new family of proteins, named Trailins, which contain an enigmatic domain termed Choice-of-Anchor-A (CAA). Immunostaining demonstrated that Trailins are only present in the adhesive trails required to generate traction on native substrata, but are absent from the extracellular matrix of biofilms. Phylogenetic analysis and Protein 3D structure prediction suggests that the CAA-domains in Trailins were obtained from bacteria by horizontal gene transfer, and exhibit a striking structural similarity to ice-binding proteins. Our work advances the understanding of the molecular basis for diatom underwater adhesion and biofilm formation providing evidence that there is a molecular switch between proteins required for initial surface colonization and those required for 3D biofilm matrix formation.",
        "creator": "Zackova Suchanova, J., Bilcke, G., Romanowska, B., Fatlawi, A., Pippel, M., Skeffington, A., Schroeder, M., Vyverman, W., Vandepoele, K., Kroeger, N., Poulsen, N."
      },
      {
        "title": "Re-engineering a lost trait: IPD3, a master regulator of arbuscular mycorrhizal symbiosis, affects genes for immunity and metabolism of non-host Arabidopsis when restored long after its evolutionary loss",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.06.531368v1?rss=1",
        "abstract": "Arbuscular mycorrhizal symbiosis (AM) is a beneficial trait originating with the first land plants, which has subsequently been lost by species scattered throughout the radiation of plant diversity to the present day, including the model Arabidopsis thaliana. To explore why an apparently beneficial trait would be repeatedly lost, we generated Arabidopsis plants expressing a constitutively active form of Interacting Protein of DMI3, a key transcription factor that enables AM within the Common Symbiosis Pathway, which was lost from Arabidopsis along with the AM host trait. We characterize the transcriptomic effect of expressing IPD3 in Arabidopsis with and without exposure to the AM fungus (AMF) Rhizophagus irregularis, and compare these results to the AM model Lotus japonicus and its ipd3 knockout mutant cyclops-4. Despite its long history as a non-AM species, restoring IPD3 in the form of its constitutively active DNA-binding domain to Arabidopsis altered expression of specific gene networks. Surprisingly, the effect of expressing IPD3 in Arabidopsis and knocking it out in Lotus was strongest in plants not exposed to AMF, which is revealed to be due to changes in IPD3 genotype causing a transcriptional state which partially mimics AMF exposure in non-inoculated plants. Our results indicate that despite the long interval since loss of AM and IPD3 in Arabidopsis, molecular connections to symbiosis machinery remain in place in this nonAM species, with implications for both basic science and the prospect of engineering this trait for agriculture.",
        "creator": "Hornstein, E. D., Charles, M., Franklin, M., Edwards, B., Vintila, S., Kleiner, M., Sederoff, H."
      },
      {
        "title": "MeC3HDZ1/MeCNA is a strong candidate for cassava storage root productivity improvement.",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.07.531519v1?rss=1",
        "abstract": "The storage root (SR) of cassava is the main staple food in sub-Saharan Africa, where it feeds over 500 million people. However, little is known about the genetic and molecular regulation underlying its development. Unraveling such regulation would pave the way for biotechnology approaches aimed at enhancing cassava productivity. Anatomical studies indicate that SR development relies on the massive accumulation of xylem parenchyma, a cell-type derived from the vascular cambium. The C3HDZ family of transcription factors regulate cambial cells proliferation and xylem differentiation in Arabidopsis and other species. We thus aimed at identifying C3HDZ proteins in cassava and determining whether any of them shows preferential activity in the SR cambium and/or xylem. Using phylogeny and synteny studies, we identified eight C3HDZ proteins in cassava, namely MeCH3DZ1-8. We observed that the expression of MeC3HDZ1 in SR cambium and xylem is higher than that of any other MeC3HDZ gene in any of the SR vascular tissues or any of the other vegetative organs. We established an in-silico pipeline which revealed the existence of a number of theoretical C3HDZ targets displaying significant preferential expression in the SR. Subsequent Y1H analyses proved that MeC3HDZ1 can bind canonical C3HDZ binding sites in the promoters of these targets. Transactivation assays demonstrated that MeC3HDZ1 can regulate the expression of genes downstream of promoters harboring such binding sites, thereby demonstrating that MeC3HDZ1 is a C3HDZ transcription factor which constitutes a strong candidate for future biotechnology strategies directed at increasing cassava productivity.",
        "creator": "Sole-Gil, A., Lopez, A., Ombrosi, D., Urbez, C., Brumos, J., Agusti, J."
      },
      {
        "title": "Induction of T-DNA amplification by retrotransposon-derived sequences",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.05.531200v1?rss=1",
        "abstract": "Transformation via Agrobacterium tumefaciens (Agrobacterium) is the predominant method used to introduce exogenous DNA into plants. Transfer DNA (T-DNA) originating from Agrobacterium can be integrated as a single copy or in concatenated forms in plant genomes, but the mechanisms affecting final T-DNA structure remain unknown. In this study, we demonstrate that the inclusion of retrotransposon (RT)-derived sequences in T-DNA can increase transgene copy number by more than 50-fold in Arabidopsis thaliana (Arabidopsis). RT-mediated amplification of T-DNA results in large concatemers in the Arabidopsis genome, which are primarily induced by the long terminal repeats (LTRs) of RTs. T-DNA amplification is dependent on the activity of DNA repair proteins associated with theta-mediated end joining (TMEJ). Finally, we show that T-DNA amplification can increase the frequency of targeted mutagenesis and gene targeting. Overall, this work uncovers molecular determinants that modulate T-DNA copy number in Arabidopsis and demonstrates the utility of inducing T-DNA amplification for plant gene editing.",
        "creator": "Dickinson, L., Yuan, W., LeBlanc, C., Thomson, G., Wang, S., Jacob, Y."
      },
      {
        "title": "Long noncoding RNA-mediated epigenetic regulation of auxin-related genes controlling shade avoidance syndrome in Arabidopsis thaliana",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.06.531280v1?rss=1",
        "abstract": "The long noncoding RNA (lncRNA) AUXIN-REGULATED PROMOTER LOOP (APOLO) recognizes a subset of target loci across the Arabidopsis thaliana genome by forming RNA-DNA hybrids (R-loop) and modulating local three-dimensional chromatin conformation. Here we show that APOLO is involved in regulating the shade avoidance syndrome (SAS) by dynamically modulating the expression of key factors. In response to far-red (FR) light, the expression of APOLO anticorrelates with its target BRANCHED1 (BRC1), a master regulator of shoot branching in Arabidopsis thaliana. APOLO deregulation results in BRC1 transcriptional repression and an increase in the number of branches. APOLO transcriptional accumulation fine-tunes the formation of a repressive chromatin loop encompassing the BRC1 promoter, which normally occurs only in leaves as well as in a late response to FR treatment in axillary buds. In addition, our data reveal that APOLO participates in leaf hyponasty, in agreement with its previously reported role in the control of auxin homeostasis through direct modulation of YUCCA2 (auxin synthesis), PID and WAG2 (auxin efflux).",
        "creator": "Mammarella, M. F., Lucero, L., Hussain, N., Munoz-Lopez, A., Huang, Y., Ferrero, L., Fernandez-Milmanda, G., Manavella, P. A., Benhamed, M., Crespi, M., Ballare, C., Gutierrez-Marcos, J., Cubas, P., Ariel, F."
      },
      {
        "title": "Optimization of somatic embryogenesis in Euterpe edulis Martius using auxin analogs and atomic force microscopy",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.04.531114v1?rss=1",
        "abstract": "Euterpe edulis Martius is an endangered species of the Atlantic Forest, whose fruits have high antioxidant potential, and propagated exclusively by seeds. The present study assessed the ability of different auxin inducers and picloram analogs to trigger somatic embryogenesis in E. edulis. Immature seeds were harvested, and their zygotic embryos were excised and grown in MS culture medium supplemented with 2,4-D dichlorophenoxyacetic acid (2,4-D) or picloram at 150, 300, 450, 600 M. The activity of picloram analogs triclopyr and clopyralid was evaluated in semisolid MS medium. At maturation and germination, picloram-derived calli and somatic embryos isolated from triclopyr-grown cultures were first transferred to pre-maturation medium and, after 30 days, to basal MS or MS medium supplemented with either 5 M abscisic acid or 0.53 M 1-naphthaleneacetic acid plus 12.3 M 2-isopentenyladenine. Finally, somatic embryos with root protrusions were transferred to MS medium devoid of sucrose for 30 days and then acclimatized ex vitro. Scanning, transmission, and atomic force microscopy revealed that picloram was superior to 2,4-D but less effective than triclopyr (100 M) in inducing embryogenesis. Maturation and germination of somatic embryos in E. edulis can be maximized by 5 M abscisic acid, and selecting calli via atomic force microscopy.",
        "creator": "DE MELLO, T., Taliuli, Y. d. S., Silva, T. D., Zanardo, T. E. C., Hegedus, C. E. N., Schmildt, E. R., Ferreira, A., Lourenco, M. P., Pinheiro, P. F., Aquije, G. M. d. F., Lopes, J. C., Otoni, W. C., Alexandre, R. S."
      },
      {
        "title": "A transcriptional activator effector of Ustilago maydis regulates hyperplasia in maize during pathogen-induced tumor formation",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.06.531288v1?rss=1",
        "abstract": "Ustilago maydis causes common smut in maize, which is characterized by tumor formation in aerial parts of the host. Tumors result from the de novo cell division of highly developed bundle sheath and subsequent cell enlargement. However, the molecular mechanisms underlying tumorigenesis are still largely unknown. Here, we characterize the U. maydis effector Sts2 (Small tumor on seedlings 2), which promotes the division of hyperplasia tumor cells. Upon infection, Sts2 is translocated into the maize cell nucleus, where it acts as a transcriptional activator, and the transactivation activity is crucial for its virulence function. Sts2 interacts with ZmNECAP1, a yet undescribed plant transcriptional activator, and it activates the expression of several leaf developmental regulators to potentiate tumor formation. Contrary, fusion of a suppressive SRDX-motif to Sts2 causes dominant negative inhibition of tumor formation, underpinning the central role of Sts2 for tumorigenesis. Our results not only disclose the virulence mechanism of a tumorigenic effector, but also reveal the essential role of leaf developmental regulators in pathogen-induced tumor formation.",
        "creator": "Zuo, W., Depotter, J. R., Stolze, S. C., Nakagami, H., Doehlemann, G."
      },
      {
        "title": "Genomic resources for a historical collection of cultivated two-row European spring barley genotypes.",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.06.531259v1?rss=1",
        "abstract": "Barley genomic resources are increasing rapidly, with the publication of a barley pangenome as one of the latest developments. Two-row spring barley cultivars are intensely studied as they are the source of high-quality grain for malting and distilling. Here we provide data from a European two-row spring barley population containing 209 different genotypes registered for the UK market between 1830 to 2014. The dataset encompasses RNA-sequencing data from six different tissues across a range of barley developmental stages, phenotypic datasets from two consecutive years of field-grown trials in the United Kingdom, Germany and the USA; and whole genome shotgun sequencing from all cultivars, which was used to complement the RNA-sequencing data for variant calling. The outcomes are a filtered SNP marker file, a phenotypic database and a large gene expression dataset providing a comprehensive resource which allows for downstream analyses like genome wide association studies or expression associations.",
        "creator": "Schreiber, M., Wonneberger, R., Haaning, A. M., Coulter, M., Russell, J., Himmelbach, A., Fiebig, A., Muehlbauer, G. J., Stein, N., Waugh, R."
      },
      {
        "title": "Leaf hydration status under drought is predominantly linked to stomatal regulation and leaf roll but not osmotic adjustment in Canadian hard red spring wheat (Triticum aestivum) cultivars",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.05.531113v1?rss=1",
        "abstract": "For wheat (Triticum aestivum), sustained crop yield at limited soil water has been linked to osmotic adjustment (OA) as one of the main drivers to minimize drought-induced reductions in leaf hydration status and growth. Canada Western Red Spring (CWRS) cultivars are typically grown in rainfed areas in northern regions with milder climates, but ongoing climate change has increased the frequency and intensity of drought event questioning how successful they are in tolerating drought. The extent of OA and its relation to stomatal behavior, leaf roll, and kernel development under periods of drought remain elusive for CWRS. For several commercially used Canadian cultivars (Superb, Stettler, AAC Viewfield), OA was not found to be a mechanism contributing to drought tolerance. In contrast, we found that sustained kernel weight during periods of relatively low soil water content was linked to tight stomatal behavior (i.e., efficient transition from onset to full stomatal closure) and early leaf roll (i.e., reductions in flag leaf width). Moreover, leaf hydration status ({Theta}RWC) marked the onset of drought-induced losses in kernel weight in all three cultivars. In conclusion, HRSW lacks OA but leaf stomatal behavior and leaf rolling aid in securing leaf hydration status and kernel weight under drought.",
        "creator": "Sharma, G., Brar, G. S., Knipfer, T."
      },
      {
        "title": "Drought and recovery in barley: key gene networks and retrotransposon response.",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.05.531133v1?rss=1",
        "abstract": "During drought, plants close their stomata at a critical soil water content (SWC), together with diverse physiological, developmental, and biochemical responses. Using precision-phenotyping lysimeters, we imposed pre-flowering drought on four barley varieties (Arvo, Golden Promise, Hankkija 673 and Morex) and followed their physiological responses. For Golden Promise, we carried out RNA-seq on leaf transcripts before and during drought, and during recovery, also examining retrotransposon BARE1 expression. Transcriptional data were subjected to network analysis. The varieties differed by their critical SWC, Hankkija 673 responding at the highest and Golden Promise at the lowest. Pathways connected to drought and salinity response were strongly upregulated during drought; pathways connected to growth and development were strongly downregulated. During recovery, growth and development pathways were upregulated; altogether 117 networked genes involved in ubiquitin-mediated autophagy were downregulated. The differential response to SWC suggests adaptation to distinct rainfall patterns. We identified several strongly differentially expressed genes not earlier associated with drought response in barley. BARE1 transcription is strongly transcriptionally upregulated by drought and downregulated during recovery unequally between the investigated cultivars. The downregulation of networked autophagy genes suggests a role for autophagy in drought response; its importance to resilience should be further investigated.",
        "creator": "Paul, M., Tanskanen, J., Jaaskelainen, M., Chang, W., Dalal, A., Moshelion, M., Schulman, A. H."
      },
      {
        "title": "Multi-omic dissection of ancestral heat stress memory responses in Brachypodium distachyon",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.04.531132v1?rss=1",
        "abstract": "Stressful environmental conditions, including heat stress (HS), are a major limiting factor in crop yield. Understanding the molecular mechanisms of plant stress memory and resilience is important for engineering more resistant plants and improving crop yield. To study how the different gene regulatory layers change upon repeated HS and how these layers are interconnected, we performed a dense temporal atlas of gene expression, alternative splicing, small and long noncoding RNAs, and DNA methylation in Brachypodium distachyon. Results show that a second HS induces changes in coding and noncoding RNA expression and alternative splicing and that DNA demethylation is responsible for mediating differential gene expression. We identified a long noncoding RNA regulatory network and provided evidence that lncRNAs positively regulate gene expression, while miRNAs are implicated in alternative splicing events. We reconstructed the ancestral heat memory network of flowering plants by comparing the dynamic responses of Arabidopsis thaliana and Brachypodium distachyon. These findings enhance our understanding of the complex inter-layer cross-talk governing HS resilience and memory and identify novel genes essential for these processes.",
        "creator": "Zheng, X., Tan, Q. W., Lim, P. K., Mutwil, M."
      },
      {
        "title": "Nodule-specific Cu+-chaperone NCC1 is required for symbiotic nitrogen fixation in Medicago truncatula root nodules",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.05.531139v1?rss=1",
        "abstract": "Cu+-chaperones are a diverse group of proteins that allocate Cu+ to specific copper-proteins, creating different copper pools targeted to specific physiological processes. Symbiotic nitrogen fixation carried out in legume root nodules requires relatively large amounts of copper, for which targeted copper deliver systems would be required. MtNCC1 is a nodule-specific Cu+-chaperone encoded in the Medicago truncatula genome, with a N-terminus Atx1-like domain that can bind Cu+ with picomolar affinities. This gene is expressed primarily from the late infection zone to the early fixation zone, and is located in the cytosol, associated to plasma and symbiosome membranes, and within nuclei. Consistent with its key role in nitrogen fixation, ncc1 mutants have a severe reduction of nitrogenase activity, and a 50% reduction in copper-dependent cytochrome c oxidase activity. A subset of the copper-proteome is also affected in the mutant nodules. Many of these proteins can be pulled-down when using a Cu+-loaded N-terminal MtNCC1 moiety as a bait, indicating a role in nodule copper homeostasis and in copper-dependent physiological processes. Overall, these data suggest a pleiotropic role of MtNCC1 in copper delivery for symbiotic nitrogen fixation.",
        "creator": "Navarro-Gomez, C., Leon-Mediavilla, J., Kupper, H., Rodriguez-Simon, M., Paganelli-Lopez, A., Wen, J., Buren, S., Mysore, K. S., Bokhari, S. N. H., Imperial, J., Escudero, V., Gonzalez-Guerrero, M."
      },
      {
        "title": "Arabidopsis thaliana BBX14 is a target of GLK1 and involved in high-light acclimation, photomorphogenesis and GUN-type retrograde signaling",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.03.530939v1?rss=1",
        "abstract": "Development of photosynthetically competent seedlings requires both light and retrograde biogenic signaling pathways. The transcription factor GLK1 functions at the interface between these pathways, and receives input from the biogenic-signaling integrator GUN1. BBX14 was previously identified, together with GLK1, in a core module that mediates the response to high light levels and biogenic signaling. To gain insight into the function of BBX14, we generated BBX14 overexpressors and CRISPR/Cas-mediated bbx14 mutant plants, conducted high-light, RT-qPCR and ChIP-Seq experiments, measured photosynthetic parameters, chlorophyll contents and growth rates, and analyzed alterations in transcriptomics. We found that, although overexpression of BBX14 is deleterious under normal growth conditions, BBX14 is needed to acclimate plants to high light stress. BBX14 is a direct target of GLK1, and RNA-Seq analysis suggests that BBX14 is involved in the circadian clock. Knockout of BBX14 results in a long-hypocotyl phenotype that depends on a retrograde signal, and BBX14 expression during biogenic signaling requires GUN1. Finally, we clarify the role of BBX14 in GUN-type biogenic signaling. We conclude that BBX14 is an integrator of photomorphogenetic and biogenic signals, and suggest that BBX14 is a nuclear target of retrograde signals downstream of the GUN1/GLK1 module.",
        "creator": "Atanasov, V., Schumacher, J., Muino, J. M., Larasati, C., Wang, L., Kaufmann, K., Leister, D., Kleine, T."
      },
      {
        "title": "Insights into the function of the chloroplastic ribosome-associated GTPase HflX in Arabidopsis thaliana.",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.03.530967v1?rss=1",
        "abstract": "Ribosome-associated GTPases are conserved enzymes that participate in ribosome biogenesis and ribosome function. In bacteria, recent studies have identified HflX as a ribosome-associated GTPase that is involved in both ribosome biogenesis and recycling under stress conditions. Plants possess a chloroplastic HflX homolog, but its function remains unknown. Here, we characterised the role of HflX in the plant Arabidopsis thaliana. Our findings demonstrate that HflX does not have a detectable role in plant growth and development, nor does it play a distinct role in acclimation to several different stresses, including heat, manganese, cold, and salt stress. However, we found that HflX is required for plant resistance to chloroplast translational stress mediated by the antibiotic lincomycin. Our results suggest that HflX is a chloroplast ribosome-associated protein that may play a role in the surveillance of translation. These findings provide new insight into the function of HflX as a ribosome-associated GTPase in plants and highlight the importance of investigating conserved proteins in different organisms to gain a comprehensive understanding of their biological roles.",
        "creator": "Mehrez, M., Lecampion, C., Ke, H., Gorsane, F., Field, B."
      },
      {
        "title": "PIF4 promotes water use efficiency during fluctuating light and drought resistance in rice",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.02.530909v1?rss=1",
        "abstract": "Molecular mechanism of intrinsic water use efficiency (iWUE) during fluctuating light (FL) was rarely understood. In this study, we investigated five parameters of iWUE under FL in 200 Minicore rice accessions. Among them, a novel trait, WUEFL (averaged iWUE during FL) has highest SNP heritability in these parameters. GWAS identifies six candidate genes, and PIF4 is highly expressed in high iWUEFL rice subgroup. Nine SNPs were significantly associated with iWUEFL, and v3 SNP located at -1,075 bp of PIF4 promoter shows highest sensitives to light. Deletion of v3 in a rice cultivar, WYG7 (PIF4v3m) leads to [~]20% reduction in iWUEFL, and overexpressing PIF4 causes 25% increase in iWUEFL under DS. There are 85% reduction in adenosine 3,5-diphosphate (PAP) amounts together with 73% increase in SAL1 gene abundance in PIF4v3m than WYG7. PIF4 transcriptionally repress and activate SAL1 and NHX1, respectively, through binding to G-box motifs of the two genes, which leads to 16% reduction and 5% increase in iWUEFL in co-overexpression rice lines of PIF4-SAL1 and PIF4-NHX1, respectively, relative to PIF4-OE under DS. We proposed that PIF4 promotes iWUEFL and stomatal adjustment via targeting the G-box motif of SAL1 and NHX1 genes during FL, eventually facilitating to drought resistance.",
        "creator": "Liu, S., Essemine, J., Liu, Y., Liu, C., Zhang, F., Xu, Z., Qu, M."
      },
      {
        "title": "ERF1 inhibits lateral root emergence by promoting local auxin accumulation with altered distribution and repressing ARF7 expression",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.02.530895v1?rss=1",
        "abstract": "Lateral roots (LRs) are crucial for plants to sense environmental signals in addition to water and nutrient absorption. Auxin is key for LR formation, but the underlying mechanisms are not fully understood. Here we report that Arabidopsis ERF1 inhibits LR emergence by promoting local auxin accumulation with altered distribution and regulating auxin signaling. Loss of ERF1 increases LR density compared with the wild type, whereas ERF1 overexpression causes the opposite phenotype. ERF1 enhances auxin transport by upregulating PIN1 and AUX1, resulting in excessive auxin accumulation in the endodermal, cortical, and epidermal cells surrounding LR primordia. Furthermore, ERF1 represses ARF7 transcription, consequently affecting the expression of cell wall remodeling genes that facilitate LR emergence. Together, our study reveals that ERF1 integrates environmental signals to promote local auxin accumulation with altered distribution and repress ARF7, consequently inhibiting LR emergence in adaptation to fluctuating environments.  HighlightsO_LIERF1 functions as a negative regulator of lateral root emergence C_LIO_LIERF1 enhances rootward and shootward auxin transport by directly upregulating the expression of PIN1 and AUX1, resulting in high local auxin accumulation and abnormal auxin distribution in the endodermal, cortical, and epidermal cells overlying lateral root primordia C_LIO_LIERF1 represses the transcription of ARF7 and cell wall remodeling genes in lateral root emergence C_LI",
        "creator": "Zhao, P.-X., Xiang, C."
      },
      {
        "title": "A critical role of a eubiotic microbiota in gating proper immunocompetence in Arabidopsis",
        "link": "http://biorxiv.org/cgi/content/short/2023.03.02.527037v1?rss=1",
        "abstract": "Although many studies have shown that microbes can ectopically stimulate or suppress plant immune responses, the fundamental question of whether the entire preexisting microbiota is indeed required for proper development of plant immune response remains unanswered. Using a recently developed peat-based gnotobiotic plant growth system we found that Arabidopsis grown in the absence of a natural microbiota lacked age-dependent maturation of plant immune response and were defective in several aspects of pattern-triggered immunity. Axenic plants exhibited hypersusceptibility to infection by the foliar bacterial pathogen Pseudomonas syringae pv. tomato DC3000. Microbiota-mediated immunocompetence was suppressed by rich nutrient conditions, indicating a tripartite interaction between the host, microbiota, and abiotic environment. A synthetic microbiota composed of 48 culturable bacterial strains from the leaf endosphere of healthy Arabidopsis plants was able to substantially restore immunocompetence similar to plants inoculated with a soil-derived community. In contrast, a 52-member dysbiotic synthetic leaf microbiota overstimulated the immune transcriptome. Together, these results provide evidence for a causal role of a eubiotic microbiota in gating proper immunocompetence and age-dependent immunity in plants.",
        "creator": "Paasch, B. C., Sohrabi, R., Kremer, J. M., Nomura, K., Martz, J., Kvitko, B., Tiedje, J. M., He, S. Y."
      }
    ]
  },
  {
    "name": "Economics",
    "feed": [
      {
        "title": "Optimal Engagement-Diversity Tradeoffs in Social Media.",
        "link": "http://arxiv.org/abs/2303.03549",
        "abstract": "Social media platforms are known to optimize user engagement with the help of algorithms. It is widely understood that this practice gives rise to echo chambers\\emdash users are mainly exposed to opinions that are similar to their own. In this paper, we ask whether echo chambers are an inevitable result of high engagement; we address this question in a novel model. Our main theoretical results establish bounds on the maximum engagement achievable under a diversity constraint, for suitable measures of engagement and diversity; we can therefore quantify the worst-case tradeoff between these two objectives. Our empirical results, based on real data from Twitter, chart the Pareto frontier of the engagement-diversity tradeoff.",
        "creator": "Fabian Baumann, Daniel Halpern, Ariel D. Procaccia, Iyad Rahwan, Itai Shapira, Manuel Wuthrich"
      },
      {
        "title": "Best-of-Both-Worlds Fairness in Committee Voting.",
        "link": "http://arxiv.org/abs/2303.03642",
        "abstract": "The paradigm of best-of-both-worlds advocates an approach that achieves desirable properties both ex-ante and ex-post. We initiate a best-of-both-worlds fairness perspective for the important social choice setting of approval-based committee voting. To this end, we formalize a hierarchy of ex-ante properties including Individual Fair Share (IFS) and its strengthening Group Fair Share (GFS). We establish their relations with well-studied ex-post concepts such as extended justified representation (EJR) and proportional justified representation (PJR). Our central result is a polynomial-time algorithm that simultaneously satisfies ex-post EJR and ex-ante GFS. Our algorithm uses as a subroutine the first phase of the well-known Method of Equal Shares class of rules.",
        "creator": "Haris Aziz, Xinhang Lu, Mashbat Suzuki, Jeremy Vollen, Toby Walsh"
      },
      {
        "title": "Government Guarantees and Banks' Income Smoothing.",
        "link": "http://arxiv.org/abs/2303.03661",
        "abstract": "We propose four channels through which government guarantees affect banks' incentives to smooth income. Empirically, we exploit two complementary settings that represent plausible exogenous changes in government guarantees: the increase in implicit guarantees following the creation of the Eurozone and the removal of explicit guarantees granted to the Landesbanken. We show that increases (decreases) in government guarantees are associated with significant decreases (increases) in banks' income smoothing. Taken together, our results largely corroborate the predominance of a tail-risk channel, wherein government guarantees reduce banks' tail risk, thereby reducing managers' incentives to engage in income smoothing.",
        "creator": "Manuela M. Dantas, Kenneth J. Merkley, Felipe B. G. Silva"
      },
      {
        "title": "Spatial, Social and Data Gaps in On-Demand Mobility Services: Towards a Supply-Oriented MaaS.",
        "link": "http://arxiv.org/abs/2303.03881",
        "abstract": "After a decade of on-demand mobility services that change spatial behaviors in metropolitan areas, the Shared Autonomous Vehicle (SAV) service is expected to increase traffic congestion and unequal access to transport services. A paradigm of scheduled supply that is aware of demand but not on-demand is proposed, introducing coordination and social and behavioral understanding, urban cognition and empowerment of agents, into a novel informational framework. Daily routines and other patterns of spatial behaviors outline a fundamental demand layer in a supply-oriented paradigm that captures urban dynamics and spatial-temporal behaviors, mostly in groups. Rather than real-time requests and instant responses that reward unplanned actions, and beyond just reservation of travels in timetables, the intention is to capture mobility flows in scheduled travels along the day considering time of day, places, passengers etc. Regulating goal-directed behaviors and caring for service resources and the overall system welfare is proposed to minimize uncertainty, considering the capacity of mobility interactions to hold value, i.e., Motility as a Service (MaaS). The principal-agent problem in the smart city is a problem of collective action among service providers and users that create expectations based on previous actions and reactions in mutual systems. Planned behavior that accounts for service coordination is expected to stabilize excessive rides and traffic load, and to induce a cognitive gain, thus balancing information load and facilitating cognitive effort.",
        "creator": "Ronit Purian, Daniel Polani"
      },
      {
        "title": "Exchange Rate Pass-Through and Data Frequency: Firm-Level Evidence from Bangladesh.",
        "link": "http://arxiv.org/abs/2303.04101",
        "abstract": "The vast literature on exchange rate fluctuations estimates the exchange rate pass-through (ERPT). Most ERPT studies consider annually aggregated data for developed or large developing countries for estimating ERPT. These estimates vary widely depending on the type of country, data coverage, and frequency. However, the ERPT estimation using firm-level high-frequency export data of a small developing country is rare. In this paper, I estimate the pricing to market and the exchange rate pass-through at a monthly, quarterly, and annual level of data frequency to deal with aggregation bias. Furthermore, I investigate how delivery time-based factors such as frequent shipments and faster transport affect a firm`s pricing-to-market behavior. Using transaction-level export data of Bangladesh from 2005 to 2013 and the Poisson Pseudo Maximum Likelihood (PPML) estimation method, I find very small pricing to the markets to the exchange rates in the exporter's price. As pass-through shows how the exporters respond to macro shocks, for Bangladesh, this low export price response to the exchange rate changes indicates that currency devaluation might not have a significant effect on the exporter. The minimal price response and high pass-through contrast with the literature on incomplete pass-through at the annual level. By considering the characteristics of the firms, products, and destinations, I investigate the heterogeneity of the pass-through. The findings remain consistent with several robustness checks.",
        "creator": "Md Deluair Hossen"
      },
      {
        "title": "Consumption smoothing in the working-class households of interwar Japan.",
        "link": "http://arxiv.org/abs/1807.05737",
        "abstract": "I analyze factory worker households in the early 1920s in Osaka to examine idiosyncratic income shocks and consumption. Using the household-level monthly panel dataset, I find that while households could not fully cope with idiosyncratic income shocks at that time, they mitigated fluctuations in indispensable consumption during economic hardship. In terms of risk-coping mechanisms, I find suggestive evidence that savings institutions helped mitigate vulnerabilities and that both using borrowing institutions and adjusting labor supply served as risk-coping strategies among households with less savings.",
        "creator": "Kota Ogasawara"
      },
      {
        "title": "Sharp bounds on preferences in extended Roy models under stochastic monotonicity constraints.",
        "link": "http://arxiv.org/abs/2005.09095",
        "abstract": "We derive sharp bounds on the non consumption utility component in an extended Roy model of sector selection. We interpret this non consumption utility component as a compensating wage differential. The bounds are derived under the assumption that potential utilities in each sector are (jointly) stochastically monotone with respect to an observed selection shifter. The research is motivated by the analysis of women's choice of university major, their underrepresentation in mathematics intensive fields, and the impact of role models on choices and outcomes.",
        "creator": "Marc Henry, Romuald Meango, Ismael Mourifie"
      },
      {
        "title": "Optimal index insurance and basis risk decomposition: an application to Kenya.",
        "link": "http://arxiv.org/abs/2111.08601",
        "abstract": "Index insurance is a promising tool to reduce the risk faced by farmers, but high basis risk, which arises from imperfect correlation between the index and individual farm yields, has limited its adoption to date. Basis risk arises from two fundamental sources: the intrinsic heterogeneity within an insurance zone (zonal risk), and the lack of predictive accuracy of the index (design risk). Whereas previous work has focused almost exclusively on design risk, a theoretical and empirical understanding of the role of zonal risk is still lacking.  Here we investigate the relative roles of zonal and design risk, using the case of maize yields in Kenya. Our first contribution is to derive a formal decomposition of basis risk, providing a simple upper bound on the insurable basis risk that any index can reach within a given zone. Our second contribution is to provide the first large-scale empirical analysis of the extent of zonal versus design risk. To do so, we use satellite estimates of yields at 10m resolution across Kenya, and investigate the effect of using smaller zones versus using different indices. Our results show a strong local heterogeneity in yields, underscoring the challenge of implementing index insurance in smallholder systems, and the potential benefits of low-cost yield measurement approaches that can enable more local definitions of insurance zones.",
        "creator": "Matthieu Stigler, David Lobell"
      },
      {
        "title": "Efficient Bias Correction for Cross-section and Panel Data.",
        "link": "http://arxiv.org/abs/2207.09943",
        "abstract": "Bias correction can often improve the finite sample performance of estimators. We show that the choice of bias correction method has no effect on the higher-order variance of semiparametrically efficient parametric estimators, so long as the estimate of the bias is asymptotically linear. It is also shown that bootstrap, jackknife, and analytical bias estimates are asymptotically linear for estimators with higher-order expansions of a standard form. In particular, we find that for a variety of estimators the straightforward bootstrap bias correction gives the same higher-order variance as more complicated analytical or jackknife bias corrections. In contrast, bias corrections that do not estimate the bias at the parametric rate, such as the split-sample jackknife, result in larger higher-order variances in the i.i.d. setting we focus on. For both a cross-sectional MLE and a panel model with individual fixed effects, we show that the split-sample jackknife has a higher-order variance term that is twice as large as that of the `leave-one-out' jackknife.",
        "creator": "Jinyong Hahn, David W. Hughes, Guido Kuersteiner, Whitney K. Newey"
      },
      {
        "title": "Generalized Difference-in-differences Models: Robust Bounds.",
        "link": "http://arxiv.org/abs/2211.06710",
        "abstract": "The difference-in-differences (DID) method identifies the average treatment effects on the treated (ATT) under mainly the so-called parallel trends (PT) assumption. The most common and widely used approach to justify the PT assumption is the pre-treatment period examination. If a null hypothesis of the same trend in the outcome means for both treatment and control groups in the pre-treatment periods is rejected, researchers believe less in PT and the DID results. This paper develops a robust generalized DID method that utilizes all the information available not only from the pre-treatment periods but also from multiple data sources. Our approach interprets PT in a different way using a notion of selection bias, which enables us to generalize the standard DID estimand by defining an information set that may contain multiple pre-treatment periods or other baseline covariates. Our main assumption states that the selection bias in the post-treatment period lies within the convex hull of all selection biases in the pre-treatment periods. We provide a sufficient condition for this assumption to hold. Based on the baseline information set we construct, we first provide an identified set for the ATT that always contains the true ATT under our identifying assumption, and also the standard DID estimand. Secondly, we propose a class of criteria on the selection biases from the perspective of policymakers that can achieve a point identification of the ATT. Finally, we illustrate our methodology through some numerical and empirical examples.",
        "creator": "Kyunghoon Ban, D&#xe9;sir&#xe9; K&#xe9;dagni"
      }
    ]
  }
]
